{
  "LA": [
    {
      "type": "Alert",
      "startDate": "2016-02-11T05:00:00.000Z",
      "link": "http://travel.state.gov/content/passports/en/alertswarnings/laos-travel-alert.html",
      "text": "The Department of State alerts U.S. citizens to the risks of traveling to the Xaisomboun province of Laos due to recent shooting attacks and detonations of improvised explosive devices. The U.S. Embassy in Vientiane has prohibited its personnel from traveling to Xaisomboun province, and encourages U.S. citizens to adopt similar security measures. This Travel Alert expires on April 30, 2016. \n\r\n\r\n\n\r\n\r\n\r\n\r\nTwo roadside attacks occurred in Laos in late January 2016, killing three people and injuring a fourth.  These attacks underscore the risks associated with travel to Xaisomboun. The bombings come after a series of shooting attacks in November and December 2015 that prompted the U.S. Embassy in Vientiane to restrict official travel to Xaisomboun Province. The Department of State also reminds U.S. citizens that unexploded ordnance continues to be found throughout Laos. While this may not pose a threat in common tourist destinations, including Vientiane, Luang Prabang, and the Plain of Jars, we strongly discourage traveling off well-used roads, tracks, and paths\nU.S. citizens traveling to or residing in Laos should take precautions, remain vigilant about their personal security, and be alert to local security developments\nFor further information:\n\nSee the State Department’s travel website for the Worldwide Caution, Travel Warnings, Travel Alerts, and Country Specific Information for Laos\nEnroll in the Smart Traveler Enrollment Program (STEP) to receive security messages and make it easier to locate you in an emergency\nContact the U.S. Embassy in Laos, located at Thadeua Road Km 9, Ban Somvang Tai, Hatsayfong District, at +856-21-48-7000, 8:00 a.m. to 11:00 a.m. weekdays, excluding U.S. and Lao holidays. After-hours emergency number for U.S. citizens is also +856-21-48-7000. Non-emergency services are provided by appointment only.\nCall 1-888-407-4747 toll-free in the United States and Canada or 1-202-501-4444 from other countries from 8:00 a.m. to 8:00 p.m. Eastern Standard Time, Monday through Friday (except U.S. federal holidays).\nFollow us on Twitter and Facebook.",
      "colorClass": "alert-danger",
      "source": "US State Department",
      "textOverview": "The Department of State alerts U.S. citizens to the risks of traveling to the Xaisomboun province of Laos due to recent shooting attacks and detonations of improvised explosive devices."
    }
  ],
  "NE": [
    {
      "type": "Warning",
      "startDate": "2016-01-21T05:00:00.000Z",
      "link": "http://travel.state.gov/content/passports/en/alertswarnings/niger-travel-warning.html",
      "text": "The Department of State warns U.S. citizens of the risks of travel to Niger and specifically recommends citizens avoid travel to Niger’s border regions, including the Diffa region and particularly the Lake Chad basin area.  The entire Lake Chad region is especially vulnerable because of ongoing activities by the extremist group Boko Haram. This replaces the Travel Warning for Niger dated July 17, 2015, to update U.S. citizens on the current security situation in Niger.\n\r\n\r\n\n\r\n\r\n\r\n\r\nU.S. citizens currently in or travelling to Niger should evaluate their personal security situation. The U.S. Embassy has very limited capability to assist U.S. citizens in remote and rural areas. You should take steps to mitigate the risk of becoming a victim of violent acts, and avoid locations routinely frequented by Westerners, such as markets, hotels, restaurants, bars, and places of worship. Violent groups have targeted these kinds of venues in the past and will likely do so again. The Embassy requires that all U.S. Embassy personnel stay only in hotels having an armed Nigerien government security presence and recommends U.S. citizens follow the specific additional security guidance on the Embassy website.        \nAs a result of safety and security concerns, some organizations, including foreign companies, NGOs, and private aid organizations, have temporarily suspended operations in Niger or withdrawn family members and/or staff. Check with your organization’s security office before making travel plans to Niger.\nTerrorist groups have called for and executed attacks against countries that supported the intervention against terrorist groups in northern Mali, including Niger. Because of terrorist and kidnapping threats, the Embassy Travel Policy requires armed Nigerien government security escorts for U.S. government employees’ official travel north of Niamey and east of Maradi. The areas bordering Mali and Libya, and northern Niger continue to be areas in which bandits, smugglers, and terrorist organizations operate. Operations to counter Boko Haram in northern Nigeria and southeastern Niger have resulted in security degradation along the Niger-Nigeria border, primarily east of Maradi. The border is porous, and there are frequent reports of suspected terrorists and smugglers crossing into Niger.\nIn 2015, Boko Haram used small arms fire and suicide bombers to attack Bosso, Diffa town, and other villages in the Diffa region of Niger. On February 10, 2015, the Government of Niger declared a state of emergency in the Diffa region. A curfew has been in place in Diffa region since December, 2014. \nThe terrorist organization Al-Qaida in the Islamic Maghreb (AQIM) has kidnapped Europeans in the region and continues to threaten to kidnap Westerners, including U.S. citizens, in Niger. Exercise extreme caution in Niger due to the seriousness of this kidnapping threat. Although the U.S. government places the highest priority on the safe recovery of kidnapped U.S. citizens, it is U.S. government policy not to make concessions to kidnappers.\nIn 2015, large-scale protests occurred throughout Niger, which caused extensive property damage. The return of political candidate Hama Amadou to Niger sparked another large scale protest in Niamey, which resulted in the death of at least two people. You should avoid large public gatherings, and stay indoors if you hear reports of demonstrations in your area. Even demonstrations intended to be peaceful can turn confrontational without warning. Nigerien security services may interrupt cell and social media connection before and during protests. \nThe Government of Niger maintains security checkpoints in Niamey. Be especially careful around these checkpoints, as the security forces may be on a heightened state of alert. Do not drive away from, or through, a checkpoint until you receive clear permission to do so. If the instructions are unclear, request verbal confirmation before proceeding.\nOutside Niamey, the potential for violent crimes increases significantly. Armed bandits target travelers on roads in all parts of the country. For U.S. government personnel, all travel outside Niamey must occur during daylight hours with a minimum of a two vehicle convoy. We recommend U.S. citizens follow a similar procedure, travelling no earlier than after sunrise and no later than one hour prior to sunset. \nFor further information:\n\nSee the State Department's travel website for the Worldwide Caution, Travel Warnings, Travel Alerts, and  Country Specific Information for Niger.\nEnroll in the Smart Traveler Enrollment Program (STEP) to receive security messages and make it easier to locate you in an emergency. \nContact the U.S. Embassy in Niamey, located at 11201 Rue des Ambassades at +(227) 20-72-26-61, 8:00 a.m. to 5:30 p.m. Monday through Thursday and 8:00 a.m. to 1:00 p.m. on Friday.  After-hours emergency number for U.S. citizens is +(227) 20-99-49-90-66.\nCall 1-888-407-4747 toll-free in the United States and Canada or 1-202-501-4444 from other countries from 8:00 a.m. to 8:00 p.m. Eastern Standard Time, Monday through Friday (except U.S. federal holidays).\nFollow us on Twitter and Facebook.",
      "colorClass": "alert-warning",
      "source": "US State Department",
      "textOverview": "The Department of State warns U.S. citizens of the risks of travel to Niger and specifically recommends citizens avoid travel to Niger’s border regions, including the Diffa region and particularly the Lake Chad basin area."
    },
    {
      "type": "Alert",
      "startDate": "2016-02-18T05:00:00.000Z",
      "link": "http://travel.state.gov/content/passports/en/alertswarnings/Niger-travel-alert.html",
      "text": "The U.S. Department of State alerts U.S. citizens residing in or traveling to Niger to the upcoming presidential and legislative elections scheduled for February 21 through March 20.  U.S. citizens are reminded of the risks of travel to Niger and urged to exercise caution while traveling within Niger during the election season.  This Travel Alert expires on April 16, 2016.\n\r\n\r\n\n\r\n\r\n\r\n\r\nSpontaneous civil disruptions and demonstrations are expected to occur throughout the country during the election period.  Terrorist groups may also take advantage of this period to target election related events.\nU.S. citizens in Niger should remain vigilant and utilize appropriate personal security practices.  Avoid political rallies, campaign events, polling stations, demonstrations, protests, and other large gatherings in the weeks before and after elections; maintain situational awareness and exercise good judgment; stay alert and aware of your surroundings at all times; and stay abreast of the situation through media outlets.\nFor further information:\n\nSee the State Department's travel website for the Worldwide Caution, Travel Warnings, Travel Alerts, and Country Specific Information for Niger.\nEnroll in the Smart Traveler Enrollment Program (STEP) to receive security messages and make it easier to locate you in an emergency. \nContact the U.S. Embassy in Niamey, Rue des Ambassades, Niamey, Niger, at +227-20-72-26-61, Monday through Thursday, 8:00 a.m. to 5:30 p.m. and on Fridays from 8:00 a.m. to 1:00 p.m.  After-hours emergency number for U.S. citizens is +227-99-49-90-66.\nCall 1-888-407-4747 toll-free in the United States and Canada or 1-202-501-4444 from other countries from 8:00 a.m. to 8:00 p.m. Eastern Standard Time, Monday through Friday (except U.S. federal holidays).",
      "colorClass": "alert-danger",
      "source": "US State Department",
      "textOverview": "The U.S. Department of State alerts U.S. citizens residing in or traveling to Niger to the upcoming presidential and legislative elections scheduled for February 21 through March 20."
    }
  ],
  "ML": [
    {
      "type": "Warning",
      "startDate": "2016-02-26T05:00:00.000Z",
      "link": "http://travel.state.gov/content/passports/en/alertswarnings/mali-travel-warning.html",
      "text": "This Travel Warning informs U.S. citizens that the Department of State has terminated Authorized Departure status for Embassy Bamako, thereby allowing the return of non-emergency personnel and dependents who had previously departed Mali.   The Department of State nevertheless continues to warn U.S. citizens of the risks of travel to Mali.  This replaces the Travel Warning issued on December 7, 2015.  \n\nThe security environment in Mali remains fluid, and the potential for attacks throughout the country, including in Bamako, remains.  On November 20, 2015, heavily armed assailants stormed the Radisson Blu Hotel in Bamako using gunfire and grenades.  One U.S. citizen and 19 other foreigners were murdered in the attack.  Violent extremist and militant elements, including al-Qa'ida in the Lands of Islamic Maghreb (AQIM) and al-Murabitoun, have claimed responsibility for the attack on the Radisson Blu.\n\nThe attack on the Radisson followed two other terrorism incidents targeting foreigners:  the March 2015 La Terrasse nightclub attack in Bamako and an attack on the Byblos hotel in Sevare in August 2015.\n\nThe January 15, 2016, terrorist attack in Ouagadougou, Burkina Faso was also claimed by AQIM and al-Murabitoun.  Also in January, a Swiss citizen was kidnapped in Timbuktu and two Australian citizens were kidnapped along Burkina Faso’s border with Mali.  Additionally, extremist groups attacked UN peacekeepers’ (MINUSMA) base camps in Timbuktu and Kidal in February.\n\nThe Malian government’s nationwide state of emergency established in November 2015, following the Radisson Blu attack, continues until March 31.  U.S. citizens might see increases in security presence, including roadblocks and random police checkpoints, especially between sundown and sunup.  Extremist elements continue to target Malian security forces, resulting in attacks on Malian government outposts.  Extremists have also employed improvised explosive devices to attack vehicles and convoys moving in the northern areas of Mali.\n\nThe U.S. Embassy encourages all U.S. citizens in Mali to evaluate their personal security situation in light of continuing threats to safety and security, take steps to mitigate the risk of becoming a victim of violent acts, reduce exposure to locations routinely frequented by westerners, and register their presence within Mali with the Embassy by enrolling in the Smart Traveler Enrollment Program (STEP).\n\nAll U.S. government personnel require authorization from the U.S. Embassy to travel outside the Bamako region, and may be subject to other restrictions, as security situations warrant.  U.S. citizens should consider taking similar precautions when making travel plans.  Exercise caution throughout the country, especially at night.\nFor further information:\n\nSee the State Department's travel website for the Worldwide Caution, Travel Warnings, Travel Alerts, and Country Specific Information for Mali.\nEnroll in the Smart Traveler Enrollment Program (STEP) to receive security messages and make it easier to locate you in an emergency.\nThe U.S. Embassy in Bamako (http://mali.usembassy.gov/) is located at ACI 2000, Rue 243 Porte 297. The Consular Section can be contacted at +223 20 70 25 05, or via email at acsbamako@state.gov and consularbamako@state.gov. For after-hours emergencies, please contact the Embassy Duty Officer via the Marine Guard at (+223) 20 70 23 01 or 20 70 23 02.\nCall 1-888-407-4747 toll-free in the United States and Canada or 1-202-501-4444 from other countries from 8:00 a.m. to 8:00 p.m. Eastern Standard Time, Monday through Friday (except U.S. federal holidays).",
      "colorClass": "alert-warning",
      "source": "US State Department",
      "textOverview": "This Travel Warning informs U.S. citizens that the Department of State has terminated Authorized Departure status for Embassy Bamako, thereby allowing the return of non-emergency personnel and dependents who had previously departed Mali."
    }
  ],
  "TR": [
    {
      "type": "Warning",
      "startDate": "2016-02-29T05:00:00.000Z",
      "link": "http://travel.state.gov/content/passports/en/alertswarnings/turkey-travel-warning.html",
      "text": "The U.S. Department of State warns U.S. citizens to avoid travel to southeastern Turkey.   Given the recent terrorist attacks and increased threats from international and indigenous groups, U.S. citizens should exercise caution when traveling throughout the country.  This Travel Warning replaces the Travel Warning dated February 4, 2016. \n\r\n\r\n\n\r\n\r\n\r\n\r\nRecent terrorist attacks from international and indigenous groups have targeted popular tourist sites, U.S. government buildings, police, and other local authorities throughout Turkey.  The threat of kidnapping remains a concern, especially in the southeast.  There have been incidents of cross-border shelling from Syria into Turkey.  For your safety:\n\nAvoid travel to southeastern Turkey, particularly near the Syrian border.  \nStay away from large crowds, including at popular tourist destinations. \nExercise heightened vigilance and caution when visiting public access areas, especially those heavily frequented by tourists.  \nStay away from political gatherings and rallies.\nFollow the instructions of local authorities in an emergency. \nMonitor local media.\n\nTravel restrictions remain in place for U.S. government employees to southeastern Turkey for the provinces of Hatay, Kilis, Gaziantep, Sanliurfa, Sirnak, Diyarbakir, Van, Siirt, Mus, Mardin, Batman, Bingol, Tunceli, Hakkari, Bitlis, and Elazig.\nFor further detailed information regarding Turkey and travel:\n\nSee the State Department's travel website for the Worldwide Caution, Travel Warnings, Travel Alerts, and Turkey’s Country Specific Information.\nEnroll in the Smart Traveler Enrollment Program (STEP) to receive security messages and help us locate you in an emergency. \nContact the U.S. Embassy in Ankara, located at 110 Ataturk Boulevard, Kavaklidere, 06100 Ankara, at +90-312-455-5555, 8:30 a.m. to 5:30 p.m., Monday through Friday. The after-hours emergency number for U.S. citizens is +90-312-455-5555 or +90-212-335-9000 (U.S. Consulate General Istanbul).\nContact the U.S. Consulate General in Istanbul, located at 2 Uçsehitler Sokagi, 34460, Istinye, Sariyer, at +90-212-335-9000.\nContact the U.S. Consulate in Adana, located at 212 Girne Bulvari, Guzelevler Mahallesi, Yuregir, Adana at +90-322-455-4100.\nContact the Consular Agency in Izmir at Izmir@state.gov.\nCall 1-888-407-4747 toll-free in the United States and Canada or 1-202-501-4444 from other countries from 8:00 a.m. to 8:00 p.m. Eastern Standard Time, Monday through Friday (except U.S. federal holidays).\nFollow us on Twitter and Facebook.",
      "colorClass": "alert-warning",
      "source": "US State Department",
      "textOverview": "The U.S. Department of State warns U.S. citizens to avoid travel to southeastern Turkey."
    }
  ],
  "BI": [
    {
      "type": "Warning",
      "startDate": "2015-12-13T05:00:00.000Z",
      "link": "http://travel.state.gov/content/passports/en/alertswarnings/burundi-travel-warning.html",
      "text": "The U.S. Department of State warns U.S. citizens against all travel to Burundi and recommends that U.S. citizens currently in Burundi depart as soon as it is feasible to do so. As a result of continuing violence, the Department of State ordered the departure of dependents of U.S. government personnel and non-emergency U.S. government personnel from Burundi on December 13.  The U.S. Embassy is able to offer only very limited emergency services to U.S. citizens in Burundi.  This Travel Warning supersedes the Travel Warning issued on November 3, 2015.\n\r\n\r\n\n\r\n\r\n\r\n\r\nPolitical violence persists throughout Burundi in the aftermath of the country's contested elections, an attempted coup d'etat and the debate over the President standing for a third term.  Armed groups operate in Burundi and gunfire and grenade attacks occur with frequency, but are usually not directed at foreigners.  If you encounter such a situation, stay indoors in a ground floor interior room away from doors and windows.  Government command and control of the armed forces and security services is not complete.  Police and military checkpoints throughout the country have the potential to seriously restrict freedom of movement.  Police have also searched the homes of private U.S. citizens as a part of larger weapons searches.\nU.S. citizens interested in departing Burundi should note that departure plans can be subject to change because of safety and security factors as well as varying availability of commercial transport.  U.S. citizens interested in departing should therefore monitor the media, check with airlines to verify flight schedules, and also check U.S. Embassy Bujumbura's website for the latest consular information, including security messages.  The U.S. Embassy continues to monitor potential airport and land border closures. \nDemonstrations, gatherings, and even sporting events that are intended to be peaceful can turn violent without advance warning.  For this reason, U.S. citizens should routinely monitor local media sources and the Internet for reports of demonstrations and unrest, and avoid political rallies, demonstrations, and crowds of any kind.\nTravel outside of Bujumbura presents significant risks, especially after nightfall.  The U.S. embassy limits and monitors the travel of its personnel in Burundi.  All movement by embassy employees outside the city from 6:00 p.m. to 7:00 a.m. is prohibited.  Likewise, U.S. citizens should not travel on national highways from dusk to dawn.  Armed criminals ambush vehicles, particularly on the roads leading out of Bujumbura.  Keep vehicle doors locked and windows up when stopped in heavy traffic.\nCorruption is endemic in Burundi and contributes to an environment where the rule of law is not respected.  Criminals who have bribed local officials may operate with impunity.\nFor more information:\n\n\nSee the State Department's travel website for the Worldwide Caution, Travel Warnings, Travel Alerts, and Specific Information for Burundi.\n\n\nSee Embassy Bujumbura's website for the latest emergency and security messages for U.S. citizens.\n\n\nEnroll in the Smart Traveler Enrollment Program (STEP) to receive security messages and make it easier to locate you in an emergency.\n\n\nFor U.S. citizen inquiries, you may send an email to BURUNDIEMERGENCYUSC@state.gov.  Contact the U.S. Embassy in Bujumbura, located on the corner of Avenue des Etats-Unis and Avenue du Cinquantenaire, at +257-22-20-7000, 7:30 a.m. to 5:15 p.m. Monday through Thursday and 7:30 a.m. to 12:30 p.m. on Friday. After-hours emergency number for U.S. citizens is +257-22-20-7318, or +257-79-93-88-41.\n\n\n\nEmergency calls may also be placed through the Department of State at 1-888-407-4747 toll-free in the United States and Canada or 1-202-501-4444 from other countries.\n\n\n\nFollow us on Twitter and Facebook.",
      "colorClass": "alert-warning",
      "source": "US State Department",
      "textOverview": "The U.S. Department of State warns U.S. citizens against all travel to Burundi and recommends that U.S. citizens currently in Burundi depart as soon as it is feasible to do so."
    }
  ],
  "YE": [
    {
      "type": "Warning",
      "startDate": "2015-12-14T05:00:00.000Z",
      "link": "http://travel.state.gov/content/passports/en/alertswarnings/yemen-travel-warning.html",
      "text": "We urge U.S. citizens to defer travel to Yemen and for those U.S. citizens currently living in or visiting Yemen to depart.  For more information, view our Yemen Crisis page.\n \n\n\r\n\r\n    The U.S. Department of State warns U.S. citizens against all travel to Yemen because of the high  security threat level in Yemen posed by the ongoing conflict and terrorist activities. On February 11, 2015 due to the deteriorating security situation in Sanaa, the Department of State suspended embassy operations and U.S. Embassy Sanaa American staff have been relocated out of the country. All consular services, routine and/or emergency, have been suspended until further notice. The Department urges U.S. citizens to defer travel to Yemen and those U.S. citizens currently living in Yemen to depart when they are able to safely do so. This supersedes the Travel Warning for Yemen issued on April 3, 2015.\n\r\n\r\n\n\r\n\r\n\r\n\r\nThe level of instability and ongoing threats, including the threat of kidnapping, in Yemen is severe.  In March 2015, a Saudi-led coalition initiated an air campaign in support of the exiled Yemeni government.  The conflict between the Coalition, Yemeni loyalist forces, and Houthi/Saleh forces is ongoing.  Shelling and airstrikes remain a persistent threat in certain areas across the country. There are reports of land mines being placed in areas vacated by withdrawing forces. The military conflict has significantly destroyed infrastructure, limiting the availability of electricity, clean water, and medical care, and causing travel by internal roads to be dangerous.  This instability often hampers the ability of humanitarian organizations to deliver critically needed food, medicine, and water.\nWe have received recent reports of U.S. citizens and other foreigners, including aid workers, being detained and kidnapped in Yemen.  We warn all U.S. citizens considering traveling to Yemen, even with an established aid organization, of the risks of detention and kidnapping.\nIn addition, the threat posed by violent extremist groups in Yemen remains high.  Al-Qa’ida in the Arabian Peninsula expanded its influence in Yemen since the beginning of the conflict, especially in the area of Mukallah.  The Islamic State also has established a presence in Yemen, and has claimed responsibility for a number of attacks in the country, including against a mosque in Sana’a on September 24 and a series of attacks on facilities in Aden in October.\nThere are no plans for a U.S. government-coordinated evacuation of U.S. citizens at this time. We encourage all U.S. citizens to shelter in a secure location until they are able to depart safely. U.S. citizens wishing to depart should do so via commercial transportation options when they become available.U.S. should keep vital records and travel documents close at hand and be prepared to depart at a moment’s notice.  The airport in Sana’a is open but may close unexpectedly. There are not many flights arriving or departing on a regular schedule.  Operations at Aden airport are intermittent and hampered by security concerns.\nThe United States is also concerned about the risks to civil aviation operating in specified areas of the Sanaa (OYSC) Flight Information Region (FIR) due to the ongoing military operations, political instability, and violence from competing armed groups involved in combat operations and other military-related activity.  The Federal Aviation Administration (FAA) has prohibited U.S. civil aviation from flying in specific areas within the Sanaa FIR.  For additional background information regarding FAA flight prohibitions and advisories for U.S. civil aviation, U.S. citizens should consult the Federal Aviation Administration’s Prohibitions, Restrictions and Notices.   \nFor U.S. citizen inquiries, you may send an email to YEMENEMERGENCYUSC@state.gov.\nTerrorist organizations, including Al-Qaida in the Arabian Peninsula (AQAP), continue to be active throughout Yemen. The U.S. government remains extremely concerned about possible attacks on U.S. citizens (whether visiting or residing in Yemen), and U.S. facilities, businesses, and perceived U.S. and Western interests. In addition, piracy in the Red Sea, Gulf of Aden, and Indian Ocean is a security threat to maritime activities in the region. See our International Maritime Piracy Fact Sheet.\n\nFor further information:\n\nEnroll in the Smart Traveler Enrollment Program (STEP) to receive security messages and make it easier to locate you in an emergency.\nCall 1-888-407-4747 toll-free in the United States and Canada or 1-202-501-4444 from other countries from 8:00 a.m. to 8:00 p.m. Eastern Time, Monday through Friday (except U.S. federal holidays).\nFollow us on Twitter and Facebook.",
      "colorClass": "alert-warning",
      "source": "US State Department",
      "textOverview": "The U.S. Department of State warns U.S. citizens against all travel to Yemen because of the high  security threat level in Yemen posed by the ongoing conflict and terrorist activities."
    }
  ],
  "HT": [
    {
      "type": "Alert",
      "startDate": "2016-01-11T05:00:00.000Z",
      "link": "http://travel.state.gov/content/passports/en/alertswarnings/haiti-travel-alert.html",
      "text": "The State Department alerts U.S. citizens residing in or traveling to Haiti to exercise caution and remain abreast of the security situation throughout the current electoral period. The Haitian government has rescheduled the final round of elections, which were originally scheduled for December 27, 2015.  The new date is January 24, 2016.  This Travel Alert supersedes the Alert dated August 7, 2015, and reflects the announcement of the final round of elections.  This Travel Alert expires on April 7, 2016\n\n\r\n\r\n\n\r\n\r\n\r\n\r\nTensions remain high and we strongly urge U.S. citizens to exercise caution and remain abreast of the security situation as the electoral process progresses to a resolution.  Particular possible flashpoints would be the period leading up to and immediately following the date of the election, the date results are announced, and the inauguration of a new President – constitutionally set for February 7, 2016. \nThere may be restrictions on traffic circulation, either imposed by the authorities or caused by ad hoc political rallies. The Embassy Security Office has advised Embassy employees not involved in election monitoring to avoid unnecessary movement outside of their residences on the day of elections.  Because of this, and as a general matter of emergency preparedness, you should maintain adequate supplies of food, water, essential medicines, and other supplies that will allow you to shelter in place for at least 72 hours.\nMonitor local media for any changes in the election schedule. The U.S. Embassy may update this Travel Alert as the schedule or circumstances change. For more information about security conditions in Haiti, please see the Country Specific Information page for Haiti or the Haiti Travel Warning.\nThe U.S. Embassy is located in Port-au-Prince at Boulevard du 15 Octobre, Tabarre 41, Tabarre, Haiti, telephone: (509) 2229-8000, facsimile: (509) 2229-8027, email:  acspap@state.gov American Citizens Services (ACS) Unit office hours are 7:00 a.m. to 3:30 p.m., Monday through Friday.  The Consular Section is closed on U.S. and local holidays.  After hours, on weekends and on holidays, please call (509) 2229-8000 and an automated attendant will connect you with the Embassy duty officer.  U.S. citizens can also stay informed about conditions in Haiti by following the Embassy and ACS on Twitter and Facebook.",
      "colorClass": "alert-danger",
      "source": "US State Department",
      "textOverview": "The State Department alerts U.S. citizens residing in or traveling to Haiti to exercise caution and remain abreast of the security situation throughout the current electoral period."
    },
    {
      "type": "Warning",
      "startDate": "2015-08-05T04:00:00.000Z",
      "link": "http://travel.state.gov/content/passports/en/alertswarnings/haiti-travel-warning.html",
      "text": "The Department of State has issued this Travel Warning to inform U.S. citizens traveling to or living in Haiti about the lack of adequate emergency medical facilities, and the security environment in Haiti.   This replaces the Travel Warning dated December 4, 2014 and provides updated information regarding the changing nature of crime involving United States citizens in Haiti.  \n\r\n\r\n\n\r\n\r\n\r\n\r\nThe Department of State urges U.S. citizens to exercise caution when visiting Haiti given Haiti’s weak emergency response infrastructure.  Hundreds of thousands of U.S. citizens safely visit Haiti each year, but the poor state of Haiti’s emergency response network should be carefully considered when planning travel.  Travelers to Haiti are encouraged to use organizations that have solid evacuation and medical support options in place. (Please see the Country Specific Information page for Haiti.) \nHaiti's emergency management infrastructure remains in poor condition.  We strongly encourage visitors to Haiti to obtain evacuation insurance.  A new private air ambulance company has opened recently, representing a significant advance in response services, but its service is limited.  Those traveling in rural areas of Haiti should verify service to where they are traveling.  Additionally, medical facilities in Haiti, including road ambulance services, are particularly weak.  Some U.S. citizens injured in accidents and others with serious health concerns have been unable to find necessary medical care in Haiti and have had to arrange and pay for medical evacuation to the United States. \nReports of kidnappings have fallen off sharply, with just one incident involving a U.S. citizen reported to the Embassy so far in 2015, continuing a dramatic decline in such crimes since 2011.  While the Government of Haiti, however, has made progress in arresting and disrupting perpetrators, kidnapping for ransom can still affect anyone in Haiti, most particularly those maintaining long-term residency in the country. \nWe urge U.S. citizens to remain aware of the possibility of robbery, especially in the Port-au-Prince area and in particular soon after leaving the airport.  While Haitian authorities have taken serious measures to improve airport security and the frequency of these crimes is down, from May to October 2014 there were 64 reported cases of U.S. citizens being robbed shortly after departing the airport, a spike associated with the busy travel period during the summer.  Three of these robberies resulted in the death of U.S. citizens.  In almost all cases reported to the Embassy, the victims were U.S. citizens of Haitian descent visiting family and friends.  Therefore, we urge U.S. citizens to be circumspect in sharing specific travel plans, and we recommend that U.S. citizens have their host or organization meet them at the airport upon arrival and/or have pre-arranged airport transfers and hotels.  The Embassy is currently monitoring the occurrence of airport robberies as we move into the busy summer travel season.\nWe also urge U.S. citizens to exercise caution when visiting banks in Port-au-Prince.  Robbery crews have been known to surveil banks and rob customers shortly after departure. \n\nRegions of Haiti outside the capital have reported fewer incidents of crime.  The Haitian authorities' ability to respond to emergencies is limited, however, and in some areas nonexistent.  Embassy employees are required to adhere to certain required security and safety measures when traveling outside of Port-au-Prince, and they have restrictions on travel in certain areas or times.  Additionally, U.S. Embassy personnel are under an Embassy-imposed curfew from 1:00 a.m. to 5:00 a.m. and must remain at home or another safe facility during curfew hours.  This may constrain the Embassy’s ability to provide emergency services to U.S. citizens outside of Port-au-Prince.  For additional details on restrictions on staff travel within Haiti, please see our Country Specific Information for Haiti.\nWhile the United Nations’ Stabilization Mission in Haiti (MINUSTAH) currently supports the activities of the Haitian National Police (HNP), their numbers will decrease during 2015 as mandated by the U.N. Security Council.  The HNP, with assistance from MINUSTAH, is responsible for maintaining order and rendering assistance.  Given the possibility and unpredictability of spontaneous protests, however, their ability to assist U.S. citizens during disturbances is very limited.  U.S. government-facilitated evacuations, such as the evacuation that took place from Haiti in 2010, occur only when no safe commercial alternatives exist.  Please see our website for additional information on how the Department of State assists U.S. citizens during a crisis.\nWe urge U.S. citizens who choose to travel to Haiti to review our Country Specific Information page.  U.S. private sector organizations with operations in Haiti can obtain additional information on the security situation in the country through the U.S. Department of State’s Overseas Security Advisory Council (OSAC).  OSAC’s mission is to promote security cooperation between U.S. private sector interests worldwide and the U.S. Department of State.  OSAC also maintains an active Country Council in Haiti to promote the exchange of security-related information.  The Council is comprised of security professionals and is co-chaired by the Regional Security Officer at the U.S. Embassy Port-au-Prince and a private sector representative.  U.S. private sector entities can obtain additional information on OSAC by visiting the OSAC website.\nWe strongly urge U.S. citizens to enroll in the Smart Traveler Enrollment Program (STEP) in order to receive the most up-to-date security information.  While the Embassy's ability to provide emergency consular services is extremely limited, travel enrollment will enable you to receive security messages via email.  Current information on safety and security can also be obtained by calling 1-888-407-4747 toll-free in the United States; callers outside the United States and Canada can receive the information by calling a regular toll line at 1-202-501-4444. These numbers are available from 8:00 a.m. to 8:00 p.m. Eastern Time, Monday through Friday, except U.S. federal holidays. \nThe U.S. Embassy is located in Port-au-Prince at Boulevard du 15 Octobre, Tabarre 41, Tabarre, Haiti, telephone: (509) 2229-8000, facsimile: (509) 2229-8027, email:  acspap@state.gov American Citizens Services (ACS) Unit office hours are 7:00 a.m. to 3:30 p.m., Monday through Friday.  The Consular Section is closed on U.S. and local holidays.  After hours, on weekends and on holidays, please call (509) 2229-8000 and an automated attendant will connect you with the Embassy duty officer.  U.S. citizens can also stay informed about conditions in Haiti by following the Embassy and ACS on Twitter and Facebook.",
      "colorClass": "alert-warning",
      "source": "US State Department",
      "textOverview": "The Department of State has issued this Travel Warning to inform U.S. citizens traveling to or living in Haiti about the lack of adequate emergency medical facilities, and the security environment in Haiti."
    }
  ],
  "UG": [
    {
      "type": "Alert",
      "startDate": "2016-01-22T05:00:00.000Z",
      "link": "http://travel.state.gov/content/passports/en/alertswarnings/uganda-travel-alert.html",
      "text": "The State Department alerts U.S. citizens residing in or traveling to Uganda to the upcoming general elections scheduled for February 18, and local elections scheduled between February 24 and March 10.   U.S. citizens are urged to exercise caution and remain abreast of the security situation throughout the electoral period.  This Travel Alert expires on March 31, 2016. \n\r\n\r\n\n\r\n\r\n\r\n\r\nThe State Department recommends U.S. citizens maintain a high level of security awareness leading up to, during, and following the election period.  U.S. citizens should avoid political rallies, polling centers, demonstrations, and crowds of any kind as gatherings intended to be peaceful can become confrontational and turn violent.  Review your personal security plans; remain aware of your surroundings, including local events; and monitor local news stations for updates.  Although there is no indication that U.S. citizens may be targets of violence, you are urged to exercise caution and stay current with media coverage of local events.\nMonitor local media for any changes in the election schedule.  General election results are expected to be announced within a week of the election.  For more information about security conditions in Uganda, please see the Country Specific Information page for Uganda.\nFor further information:\n\nSee the State Department's travel website for the Worldwide Caution, Travel Warnings, Travel Alerts, and Country Specific Information for Uganda.\nEnroll in the Smart Traveler Enrollment Program (STEP) to receive security messages and make it easier to locate you in an emergency.\nContact the U.S. Embassy in Uganda, located at Plot 1577 Ggaba Road, Kamapala, at :+(256)(0) 414-306-001 and +(256)(0)312-306-001 or e-mail at KampalaUScitizen@state.gov.  The Embassy is open Monday-Thursday, 7:30 a.m.-4:30 p.m. and Friday 7:30 – 12:30 a.m.  For after-hours emergencies, U.S. citizens should call +(256)(0) 414-306-001 and ask to speak with the Embassy duty officer.\nCall 1-888-407-4747 toll-free in the United States and Canada or 1-202-501-4444 from other countries from 8:00 a.m. to 8:00 p.m. Eastern Standard Time, Monday through Friday (except U.S. federal holidays).\nFollow us on Twitter and Facebook.",
      "colorClass": "alert-danger",
      "source": "US State Department",
      "textOverview": "The State Department alerts U.S. citizens residing in or traveling to Uganda to the upcoming general elections scheduled for February 18, and local elections scheduled between February 24 and March 10."
    }
  ],
  "BD": [
    {
      "type": "Alert",
      "startDate": "2016-02-12T05:00:00.000Z",
      "link": "http://travel.state.gov/content/passports/en/alertswarnings/bangladesh-travel-alert.html",
      "text": "The Department of State alerts U.S. citizens to the ongoing potential for extremist violence in Bangladesh.   This Travel Alert supersedes the November 10, 2015 alert and expires on May 1, 2016. Reports suggest that terrorist attacks could occur against foreigners in Bangladesh, especially in large gatherings.  Since September 2015, Bangladesh has experienced a series of increasingly sophisticated violent attacks.  These include the murders of two foreign nationals, as well as bombs and other attacks against gatherings of religious groups and security forces.  The Islamic State of Iraq and the Levant (ISIL) publicly claimed credit for many of these attacks.  Additionally, groups saying they represent Al Qaeda in the Indian Subcontinent (AQIS) claimed responsibility for a series of threats and terrorist attacks targeting writers, publishers, and others in the media, including the murder of a U.S. citizen blogger.  The U.S. government assesses that the terrorist threat remains real and credible, and further attacks are possible.\n\r\n\r\n\n\r\n\r\n\r\n\r\nThe Government of Bangladesh has taken steps to pursue extremists and strengthen security, and thousands of U.S. citizens visit each year without incident. Nevertheless, U.S. citizens should take precautions, remain vigilant, and be alert to local security developments. Although U.S. government officials in Bangladesh continue to conduct official business without incident, U.S. government officials and their families currently are not permitted to:\n\nvisit many public places;\ntravel on foot, motorcycle, bicycle, rickshaw, or other uncovered means on public thoroughfares and sidewalks;\nattend large gatherings in Bangladesh, including events at international hotels. \n\nThe Embassy encourages U.S. citizens to adopt similar security measures.\nFor further information:\n\nSee the State Department's travel website for the Worldwide Caution, Travel Warnings, Travel Alerts, and Country Specific Information.\nEnroll in the Smart Traveler Enrollment Program (STEP) to receive security messages and make it easier to locate you in an emergency. \nContact the U.S. Embassy in Dhaka, Bangladesh, located at Madani Avenue, Baridhara, Dhaka, Bangladesh 1212, at (88) (02) 5566-2000, 8:00 a.m. to 4:30 p.m. Sunday through Thursday.  Weekends and After-hours emergency number for U.S. citizens is (88) (02) 5566-2000 (press “0” and ask for the duty officer).\nCall 1-888-407-4747 toll-free in the United States and Canada or 1-202-501-4444 from other countries from 8:00 a.m. to 8:00 p.m. Eastern Standard Time, Monday through Friday (except U.S. federal holidays).\nFollow us on Twitter and Facebook.",
      "colorClass": "alert-danger",
      "source": "US State Department",
      "textOverview": "The Department of State alerts U.S. citizens to the ongoing potential for extremist violence in Bangladesh.   This Travel Alert supersedes the November 10, 2015 alert and expires on May 1, 2016."
    }
  ],
  "TN": [
    {
      "type": "Alert",
      "startDate": "2015-12-29T05:00:00.000Z",
      "link": "http://travel.state.gov/content/passports/en/alertswarnings/tunisia-travel-alert.html",
      "text": "The U.S. Department of State alerts U.S. citizens to the risks of travel to Tunisia and recommends that U.S. citizens in Tunisia maintain a high level of vigilance in light of recent terrorist attacks on sites frequented by tourists as well as security forces in central Tunis. The Tunisian government has shown its commitment to addressing security concerns and has visibly augmented its security presence at tourist locations, but challenges persist and the threat of terrorism remains high.  A state of emergency was declared on November 24, 2015 throughout the country and extended to February 21, 2016.  This Travel Alert expires on February 29, 2016. \n\n\r\n\r\n\n\r\n\r\n\r\n\r\nU.S. citizens should exercise extreme caution in Tunisia when frequenting public venues that are visited by large numbers of foreigners, such as: hotels, shopping centers, tourist sites, and restaurants.  Two attacks in 2015 targeted tourists: March 18, 2015 at the Bardo Museum in Tunis, and June 26, 2015 near Sousse at the Riu Imperial Marhaba and Riu Bellevue Park hotels.  The Islamic State of Iraq and the Levant (ISIL) claimed responsibility for both attacks.  U.S. citizens should also be alert to the possibility of kidnapping. \nTerrorist organizations have also increasingly targeted Tunisian security forces and government installations.  Most recently on November 24, 2015, a suicide bomber struck a bus carrying Tunisian Presidential Guard personnel on Avenue Mohammed V in central Tunis, killing 12 security personnel.  ISIL has claimed responsibility for the attack.  The Tunisian government officially designated the group Ansar al-Sharia in Tunisia (AAS-T), a group with known anti-U.S. and anti-Western sentiments, as a terrorist organization on August 27, 2013.  The Tunisian government continues security force operations against AAS-T, ISIL, and al-Qa’ida in the Islamic Maghreb (AQIM).\nOn November 24, 2015, President Caid Essebsi declared a 30-day state of emergency that grants security forces more authority to maintain civil order, enabling the government to focus on combating terrorism.  This state of emergency was extended on December 22 for an additional 60 days, expiring February 21, 2016.  The Minister of Interior has stated that the state of emergency will assist in securing hotels and tourist areas. \nProtests, demonstrations, and civil unrest can occur with little warning throughout the country.  U.S. citizens should avoid large crowds and demonstrations, as even demonstrations that are meant to be peaceful have the potential to become unpredictable.  When the last significant protests took place in Tunisia in the summer of 2013, they were non-violent and not directed against U.S. citizens or foreigners.  U.S. citizens should be aware of anti-U.S. and anti-Western sentiment held by several groups in country.  U.S. citizens should also be alert and aware of their surroundings.  Travelers should monitor local events, report suspicious activity to the local police, and take appropriate steps to bolster personal security.\nTravelers contemplating trips to the interior of the country should assess local conditions and routes when making travel plans.  In particular, all travel south of the designated military zone in the south must be coordinated in advance with Tunisian authorities.  Also, travel to either border should be avoided, if possible, given the periodic security incidents along the border regions, including the Mount Chaambi region near the Algerian border where security operations continue against armed extremists.  The Tunisian National Guard encourages persons traveling into the desert to register their travel beforehand.  For details on how and where to register, please visit the U.S. Embassy’s desert travel page.  No special authorization is required to travel to the desert as far south as Remada.  The desert south of Remada is designated as a military zone by the Government of Tunisia. If travelers wish to enter the military zone, for example to travel to Borma, a special authorization is required. Please visit the U.S. Embassy’s desert travel page. \nTunisia shares borders with Algeria and Libya.  Developments in Libya continue to affect the security situation along the border areas, and the Department of State warns U.S. citizens against all travel to Libya.  Due to tighter security, backups of several hours can occur on the Tunisian side of the border.  The Ras Jedir and Dehiba border crossings with Libya may be closed occasionally, and access to both crossings is strictly controlled by Tunisian security forces.  Travelers should consult local authorities before travelling to the Libyan border, and should read the Department of State’s Travel Warning for Libya, as well as the Department of State’s Country Specific Information and other international travel safety and security information for Libya and Algeria.  Travelers should consult local authorities before travelling to the Algerian border and read the Department of State’s Travel Warning for Algeria.  Some crossings may be closed occasionally and access is strictly controlled by Tunisian and Algerian security forces.\nGovernment security forces, including the army, police, and National Guard, are visibly present throughout Tunisia.  Under the state of emergency, the Ministry of Interior is granted broad powers and may ban rallies and demonstrations.  The Minister of Interior, as well as local governors, have the prerogative to put any individual under house arrest, if considered a threat to national and public security; and to search houses and conduct other activities without requiring prior judicial authorization.  Security personnel, including plain clothes officials, may at times place foreign visitors under surveillance.  It is against Tunisian law to photograph government offices and other security facilities.  Suspicious incidents or problems should be reported immediately to Tunisian authorities and the U.S. Embassy.  Travelers should remain alert to local security developments and heed directions given by uniformed security officials.  U.S. citizens are urged to always carry a copy of their passport as proof of nationality and identity and, if moving about alone, a cell phone or other means of communication that works in Tunisia.\nThe U.S. government considers the potential threat to U.S. Embassy personnel assigned abroad sufficiently serious to require them to live and work under security restrictions which vary by country of assignment.  Embassy Tunis travel regulations require advance notification to Embassy security officials of travel outside greater Tunis.  These measures occasionally prevent the movement of U.S. Embassy officials and the provision of consular services in certain areas of the country.\nAlthough these restrictions do not apply to travelers not associated with the U.S. government, U.S. citizens in Tunisia should take these restrictions into account when planning travel.  The Embassy regularly reviews the security of these areas for possible modification.  Travelers should keep informed of local developments by following local press, radio, and television reports prior to their visits.  Visitors should also consult their hosts, including U.S. and Tunisian business contacts, hotels, tour guides, and travel organizers.\nUnless otherwise indicated in a public announcement, the U.S. Embassy is open for all routine American Citizens Services by appointment.  U.S. citizens needing emergency assistance do not need an appointment.  The Embassy will notify U.S. citizens as quickly as possible of any closing and the types of emergency consular services that will be available.  Visit the Embassy website to check the latest changes to Embassy hours or services.\nFor further information: \n\nSee the State Department's travel website for the Worldwide Caution, Travel Warnings, Travel Alerts, and Country Specific Information for Tunisia.\nEnroll in the Smart Traveler Enrollment Program (STEP) to receive security messages and make it easier to locate you in an emergency. \nContact the U.S. Embassy in Tunisia located at North East Zone Berges du Lac, North of Tunis 2045 La Goulette, at +216 71 107 000, 8:00 a.m. until 5:00 p.m. Monday through Friday.  After-hours emergency number for U.S. citizens is +216 71 107 000.\nCall 1-888-407-4747 toll-free in the United States and Canada, or 1-202-501-4444 from other countries, from 8:00 a.m. to 8:00 p.m. Eastern Standard Time, Monday through Friday (except U.S. federal holidays).\nFollow us on Twitter and Facebook.",
      "colorClass": "alert-danger",
      "source": "US State Department",
      "textOverview": "The U.S. Department of State alerts U.S. citizens to the risks of travel to Tunisia and recommends that U.S. citizens in Tunisia maintain a high level of vigilance in light of recent terrorist attacks on sites frequented by tourists as well as security forces in central Tunis."
    }
  ],
  "NG": [
    {
      "type": "Warning",
      "startDate": "2016-02-05T05:00:00.000Z",
      "link": "http://travel.state.gov/content/passports/en/alertswarnings/nigeria-travel-warning.html",
      "text": "The Department of State warns U.S. citizens of the risks of travel to Nigeria and recommends that U.S. citizens avoid all travel to Adamawa, Borno, and Yobe states because the security situation in northeast Nigeria remains fluid and unpredictable. The U.S. Department of State strongly urges U.S. citizens in Nigeria to consider their own personal security and to keep personal safety in the forefront of their travel planning.  This Travel Warning replaces the Travel Warning for Nigeria dated July 27, 2015.\n\r\n\r\n\n\r\n\r\n\r\n\r\nThe ability of the Mission to provide assistance to U.S. citizens in Adamawa, Borno, and Yobe states remains severely limited.  The Department continues to recommend against all but essential travel to the following states due to the risk of kidnappings, robberies, and other armed attacks: Adamawa, Bauchi, Bayelsa, Borno, Delta, Gombe, Jigawa, Kaduna, Kano, Katsina, Kebbi, Niger, Plateau, Rivers, Sokoto, Yobe, and Zamfara.  The Department also warns against travel in the Gulf of Guinea because of the threat of piracy.\nBased on safety and security risk assessments, the Embassy maintains restrictions for travel by U.S. officials to those states listed above; officials must receive advance clearance by the U.S. Mission for any travel deemed as mission-essential.  U.S. citizens should be aware that extremists could expand their operations beyond northern Nigeria to other areas of the country.\n\nThe U.S. Mission advises all U.S. citizens to be particularly vigilant around government security facilities; churches, mosques, and other places of worship; locations where large crowds may gather, such as hotels, clubs, bars, restaurants, markets, shopping malls; and other areas frequented by expatriates and foreign travelers.  Security measures in Nigeria remain heightened due to threats posed by extremist groups, and U.S. citizens may encounter police and military checkpoints, additional security, and possible road blocks throughout the country.\n\nBoko Haram, an extremist group based in northeast Nigeria designated as a Foreign Terrorist Organization by the Department of State, has claimed responsibility for many attacks, mainly in northern Nigeria.  Its members have killed or wounded thousands of people during the past five years.  Boko Haram has targeted churches, schools, mosques, government installations, educational institutions, and entertainment venues in Adamawa, Bauchi, Borno, Gombe, Kaduna, Kano, Plateau, Taraba, the Federal Capital Territory, and Yobe states.  Hundreds of thousands of Nigerians have been displaced as a result of violence in the north.\n\n2015 saw an increase in attacks by Boko Haram and clashes with Nigerian government security forces in northern Nigeria.  Boko Haram targets men, women, and children for kidnapping and is known to descend on whole towns, robbing banks and businesses, attacking police and military installations, and setting fire to private homes.  For example, in January 2015, Boko Haram attacked the town of Baga in Borno state, resulting in an estimated 2,000 casualties; in January - July 2015 there were attacks and suicide bombings in Adamawa, Plateau, Borno, and Kano states; in October 2015, suicide bombers targeted Abuja and villages in Kuje and Nyanya; and in January 2016, upwards of 80 people, including children, were killed in the village of Dalori.\n\nVarious local government curfews are intermittently in effect in several states in the North. All U.S. citizens should remain aware of current situations including curfews, travel restrictions, and states of emergency in the areas they are in or plan to visit.  This information is commonly announced via the news media, but at times it can change with very little notice.  Please take the time to find out this information for your area.\n\nCell phone service has, at times, been disrupted in Nigeria, particularly in areas where a State of Emergency has been declared, and when extremists have attacked cellular telephone towers.  U.S. citizens should attempt to arrange for multiple means of communication in case of need during emergencies.\n\nKidnappings remain a security concern throughout the country. Criminal elements throughout Nigeria orchestrate kidnappings for ransom; Islamic extremists, operating predominantly in the North, also have been known to conduct kidnappings. Criminals or militants have abducted foreign nationals, including U.S. citizens, from off-shore and land-based oil facilities, residential compounds, airports, and public roadways.  In 2015, six U.S. citizens were kidnapped in separate incidents in the states of Kogi, Ondo, Anambra, Plateau, and Imo.  Local authorities and international corporations operating in Nigeria assert that the number of kidnapping incidents throughout Nigeria remains under-reported.\nAttacks by pirates off the coast of Nigeria in the Gulf of Guinea have increased substantially in recent years.  Armed gangs have boarded both commercial and private vessels to rob travelers.  The Nigerian Navy has limited capacity to respond to criminal acts at sea.\nFor further information:\n\nSee the State Department's travel website for the Worldwide Caution, Travel Warnings, Travel Alerts, and Nigeria Country-Specific Information.\nEnroll in the Smart Traveler Enrollment Program (STEP) to receive security messages and make it easier to locate you in an emergency. \nContact the U.S. Embassy in Abuja, located at Plot 1075 Diplomatic Drive, Central District Area, open Monday-Thursday, 7:30 a.m. to 4:30 p.m. and Friday, 7:30 a.m. to 1:30 p.m.  The U.S. Consulate General in Lagos, located at 2 Walter Carrington Crescent, Victoria Island, is open Monday-Thursday from 7:00 a.m. to 4:00 p.m. and Friday from 7:00 a.m. to 1:00 p.m.  The U.S. Embassy in Abuja can be reached by telephone, including after-hours emergencies, at +234(9) 461-4000, or by email at AbujaACS@state.gov.  The U.S. Consulate General in Lagos can be reached by telephone, including after-hours emergencies, at +234(1) 460-3600 or +234 (1) 460-3400, or by email at LagosACS@state.gov.  For more information, please visit the U.S. Mission in Nigeria website.\nCall 1-888-407-4747 toll-free in the United States and Canada or 1-202-501-4444 from other countries from 8:00 a.m. to 8:00 p.m. Eastern Standard Time, Monday through Friday (except U.S. federal holidays).\nFollow us on Twitter and Facebook.",
      "colorClass": "alert-warning",
      "source": "US State Department",
      "textOverview": "The Department of State warns U.S. citizens of the risks of travel to Nigeria and recommends that U.S. citizens avoid all travel to Adamawa, Borno, and Yobe states because the security situation in northeast Nigeria remains fluid and unpredictable."
    }
  ],
  "SD": [
    {
      "type": "Warning",
      "startDate": "2016-01-21T05:00:00.000Z",
      "link": "http://travel.state.gov/content/passports/en/alertswarnings/sudan-travel-warning.html",
      "text": "The U.S. Department of State warns U.S. citizens of the continued risks of travel to Sudan. U.S. citizens should avoid all travel to the Darfur region, Blue Nile, and Southern Kordofan states, and consider carefully the risks of travel in other areas of Sudan, due to the continued threat of terrorism, armed conflict, violent crime and kidnapping. The U.S. Embassy's ability to provide services outside of Khartoum is very limited. This replaces the Travel Warning issued on June 15, 2015. \n\r\n\r\n\n\r\n\r\n\r\n\r\nTerrorist groups remain present in Sudan and are intent on harming Westerners and Western interests. Terrorist actions may include suicide operations, bombings, shootings, or kidnappings. The threat of violent crime targeting Westerners, including kidnappings, armed robberies, home invasions, and carjackings is particularly high in the Darfur region.  \nU.S. citizens should mitigate the risk of becoming a victim of terrorism or violent crime by being vigilant and aware of their surroundings, especially at public gatherings and locations frequented by foreigners. Exercise caution at all times and monitor reliable news sources for information on the local security situation. Follow the advice of local authorities. All U.S. citizens should assess their personal security and have evacuation plans that can be carried out quickly. Do not rely solely on U.S. government assistance.\nViolent flare-ups, tribal violence, and armed banditry continue in the Darfur region, along the border between Chad and Sudan, and in areas that border South Sudan. There are landmines and unexploded ordnance in Sudan, especially in the Eastern Sudan, Blue Nile, and South Kordofan regions. Hostilities between Sudanese forces and armed opposition groups continue in Blue Nile and Southern Kordofan states, including the disputed area of Abyei. In addition to risking injury or death, U.S. citizens who are in these areas without permission of the Sudanese government may be detained by security forces.\nThe U.S. Coast Guard from time to time issues Maritime Security Directives designating certain sea areas as \"high risk waters\" due the possibility of terrorism, piracy, or armed robbery against ships. U.S. flag vessel owners take these designations into consideration in the development of vessel security plans. In the past, the United States Maritime Administration (MARAD) advised that regional tensions increase the risk of maritime attacks being conducted against vessels operating in the Gulf of Oman, North Arabian Sea, Gulf of Aden, and the Bab el Mandeb regions. View current advisories here.\nThe U.S. Embassy has implemented enhanced security measures to protect U.S. government personnel, including requiring travel in armored vehicles at all times. U.S. government personnel are not authorized to travel outside of Khartoum without advanced permission or to certain areas of Darfur without appropriate security precautions. Family members of U.S. personnel under age 21 are not allowed to reside in Sudan.\nFor further information:\n\nSee the State Department's travel website for the Worldwide Caution, Travel Warnings, Travel Alerts, and Country Specific Information for Sudan.\nEnroll in the Smart Traveler Enrollment Program (STEP). Be sure to provide your current contact and next-of-kin information in STEP.\nContact the U.S. Embassy in Khartoum, U.S. Embassy Road, Kilo 10, Soba, Khartoum, at  telephone (+254) (20) 363-6000, 7:15 a.m. to 4:30 p.m. Monday through Thursday and 7:15 a.m. to 12:15 p.m. on Friday.  In the event of an after-hours emergency, contact the Embassy duty officer at (+254) (20) 363-6000. U.S. Citizens may email the Embassy at ACSKhartoum@state.gov. \nCall 1-888-407-4747 toll-free in the United States and Canada or 1-202-501-4444 from other countries from 8:00 a.m. to 8:00 p.m. Eastern Standard Time, Monday through Friday (except U.S. federal holidays).\nFollow us on Twitter and Facebook.",
      "colorClass": "alert-warning",
      "source": "US State Department",
      "textOverview": "The U.S. Department of State warns U.S. citizens of the continued risks of travel to Sudan."
    },
    {
      "type": "Warning",
      "startDate": "2015-12-31T05:00:00.000Z",
      "link": "http://travel.state.gov/content/passports/en/alertswarnings/republic-of-south-sudan-travel-warning.html",
      "text": "The U.S. Department of State warns U.S. citizens against travel to the Republic of South Sudan. The U.S. Embassy in Juba continues to operate at reduced staffing levels due to continued armed conflict outside Juba. The U.S. Embassy has little capacity to reach U.S. citizens with emergencies outside Juba because of the poor security situation and lack of critical infrastructure. The U.S. Embassy notes it is rarely informed of the arrest of U.S. citizens in a timely manner and its ability to provide consular assistance to detainees both in Juba and outside the capital is extremely limited. U.S. citizens traveling to South Sudan despite this warning should develop contingency plans prior to arrival to ensure their safety and security. This amends the Travel Warning issued July 1, 2015 to update U.S. citizens about the risks to civil aviation operating in South Sudan as a result of the ongoing armed conflict between the government of the Republic of South Sudan and armed opposition groups.\n\r\n\r\n\n\r\n\r\n\r\n\r\nThe Federal Aviation Administration on December 24, 2015, issued an advisory “Notice to Airmen” (NOTAM) expressing concern about the risks to civil aviation in South Sudan.  For further background information about FAA flight prohibitions and advisories for U.S. civil aviation, please consult the Federal Aviation Administration’s Prohibitions, Restrictions and Notices. Furthermore, in an official press statement released on December 11, 2015, the government of the Republic of South Sudan threatened to shoot down aircraft engaged in illicit activities or which violate the country’s airspace by failing to properly identify themselves. South Sudan also recently deployed a functional radar-guided Strategic Surface-to-Air Missile near Juba.\nThe South Sudanese government is currently engaged in an armed conflict with opposition forces led by the former vice president Riek Machar, which has led to the displacement of more than two million people. Although the conflict is primarily concentrated in Unity, Jonglei, and Upper Nile states, other areas of the country have experienced periodic fighting. Instability persists across the country due to retaliatory attacks, intercommunal violence and cattle raiding, and economic uncertainty.\nHealth care in South Sudan is extremely limited and poor. U.S. citizens with medical conditions should not travel to South Sudan, and all travelers should ensure their travel is covered by overseas medical insurance, including medical evacuation.\nThe government of South Sudan has limited capacity to deter crime or provide security to travelers, particularly outside of Juba. In addition to instability related to the current armed conflict, the risk of violent crime is high in South Sudan. The U.S. Embassy in Juba has imposed a curfew from 10:00 p.m. to 6:00 a.m. and has implemented other measures to protect U.S. government personnel living and working in South Sudan. These include requiring personnel to travel in armored government vehicles and coordinating with the host government for travel outside of Juba. Due to security concerns, spouses and family members of U.S. government personnel are not permitted to reside in South Sudan. U.S. citizens should consider those restrictions and take measures to mitigate exposure to violent crime and other threats. U.S. citizens currently working on humanitarian relief or development efforts in Juba, or elsewhere in South Sudan, should closely follow the security policies and procedures of the sponsoring organization.\nCarjackings and banditry are common in South Sudan. If travel outside of Juba is necessary, it should be undertaken preferably with a minimum of two vehicles with appropriate recovery and medical equipment in case of mechanical failure or other emergency. Additionally, there are widespread fuel shortages across South Sudan, and access to gasoline and or diesel cannot be guaranteed.\nFor further information:\n\nSee the State Department's travel website for the Worldwide Caution, Travel Warnings, Travel Alerts, and Country Specific Information for South Sudan.\nEnroll in the Smart Traveler Enrollment Program (STEP). U.S. citizens who decide to travel to or remain in South Sudan despite this Travel Warning to provide their current contact information and next-of-kin information through STEP. \nContact the U.S. Embassy in South Sudan located on Kololo Road in Tongping next to the European Union compound, at +(211) 912-105-188 8:00 a.m. to 5:00 p.m. Monday through Thursday and 8:00 a.m. to 12:00 p.m. on Friday. After-hours emergency number for U.S. citizens is +(211) 912-105-107.\nCall 1-888-407-4747 toll-free in the United States and Canada or 1-202-501-4444 from other countries from 8:00 a.m. to 8:00 p.m. Eastern Standard Time, Monday through Friday (except U.S. federal holidays).\nFollow us on Twitter and Facebook.",
      "colorClass": "alert-warning",
      "source": "US State Department",
      "textOverview": "The U.S. Department of State warns U.S. citizens against travel to the Republic of South Sudan."
    }
  ],
  "IR": [
    {
      "type": "Warning",
      "startDate": "2016-01-29T05:00:00.000Z",
      "link": "http://travel.state.gov/content/passports/en/alertswarnings/iran-travel-warning.html",
      "text": "The Department of State warns U.S. citizens to carefully consider the risks of travel to Iran. This replaces the Travel Warning for Iran of August 5, 2015, to reiterate and highlight the risk of arrest and detention of U.S. citizens, particularly dual national Iranian-Americans, in Iran.  All U.S. citizens should stay current with media coverage of local events and carefully consider nonessential travel.    \n\r\n\r\n\n\r\n\r\n\r\n\r\nVarious elements in Iran remain hostile to the United States.  Since the United States and Iran reached a Joint Comprehensive Plan of Action to address the international community's concerns over Iran's nuclear program on July 14, 2015, Iran has continued to harass, arrest, and detain U.S. citizens, in particular dual nationals.  \nThe U.S. government does not have diplomatic or consular relations with the Islamic Republic of Iran and therefore cannot provide protection or routine consular services to U.S. citizens in Iran.  The Swiss government, acting through its Embassy in Tehran, serves as protecting power for U.S. interests in Iran.  The range of consular services provided by the Foreign Interests Section at the Swiss Embassy is limited and may require significantly more processing time than at U.S. embassies or consulates. \nThe Iranian government does not recognize dual citizenship and will not allow the Swiss to provide protective services for U.S. citizens who are also Iranian nationals. The Iranian authorities make the determination of a dual national’s Iranian citizenship without regard to the dual national’s personal wishes.  Consular access to U.S. citizens without dual nationality is often denied as well. \nIranian authorities have unjustly detained or imprisoned U.S. citizens, particularly Iranian-Americans, including journalists, businessmen and academics, on charges including espionage and posing a threat to national security.  Iranian authorities have also prevented the departure, in some cases for months, of a number of Iranian-American citizens who traveled to Iran for personal or professional reasons. \nThe Iranian government continues to repress some minority religious and ethnic groups, including Christians, Baha'i, Arabs, Kurds, Azeris, and others.  Consequently, some areas within the country where these minorities reside, including the Baluchistan border area near Pakistan and Afghanistan, the Kurdish northwest of the country, and areas near the Iraqi border, remain unsafe. Iranian authorities have detained and harassed U.S. citizens, particularly those of Iranian origin.  Former Muslims who have converted to other religions, religious activists, and persons who encourage Muslims to convert are subject to arrest and prosecution.\nThe U.S. government’s ability to assist U.S. citizens in Iran in the event of an emergency is extremely limited.  U.S. citizens in Iran should ensure that they have updated documentation at all times and make their own plans in the event of an emergency. For more information, see \"What the Department of State Can and Can't Do in a Crisis\" at the Department's website.\" \n\nFor further information:\n\nSee the State Department's travel website for the Worldwide Caution, Travel Warnings, Travel Alerts, and Iran Country-Specific Information.\nEnroll in the Smart Traveler Enrollment Program (STEP) to receive security messages and make it easier to locate you in an emergency.\nContact the the U.S. Interests Section at the Swiss Embassy, located at No. 39, Shahid Mousavi (Golestan 5th), Pasdaran, Tehran.  The telephone numbers for the U.S. Interests Section are (+98)(21)2279-3912, (+98)(21)2279-3697,(+98)(21) 2254-2178, and (+98)(21) 2256-5273, fax (+98)(21) 2258-0432, email: tie.vertretung@eda.admin.ch.\nCall 1-888-407-4747 toll-free in the United States and Canada or 1-202-501-4444 from other countries from 8:00 a.m. to 8:00 p.m. Eastern Time, Monday through Friday (except U.S. federal holidays).\n\nFollow us on Twitter and Facebook.",
      "colorClass": "alert-warning",
      "source": "US State Department",
      "textOverview": "The Department of State warns U.S. citizens to carefully consider the risks of travel to Iran."
    }
  ],
  "UA": [
    {
      "type": "Warning",
      "startDate": "2015-12-14T05:00:00.000Z",
      "link": "http://travel.state.gov/content/passports/en/alertswarnings/ukraine-travel-warning.html",
      "text": "The Department of State warns U.S. citizens to defer all travel to Crimea and the eastern regions of Donetsk and Luhansk, and recommends those U.S. citizens currently living in or visiting these regions to depart. This supersedes the Travel Warning for Ukraine dated July 16 to provide updated information on the security situation in southern and eastern Ukraine.\n\r\n\r\n\n\r\n\r\n\r\n\r\nRussia-backed separatists continue to control areas in the Donetsk and Luhansk oblasts, where violent clashes have resulted in over 9,000 deaths.  A ceasefire agreement established a de facto dividing line between Ukrainian government-controlled and separatist-held areas of Ukraine, with numerous checkpoints controlled by government and separatist forces.  The Department of State warns all U.S. citizens to defer all travel to the Donetsk and Luhansk oblasts.  There have been multiple casualties due to land mines in areas previously controlled by separatists, and separatist leaders have made statements indicating their desire to push the front line to the administrative borders of the Donetsk and Luhansk oblasts.  Individuals, including U.S. citizens, have been threatened, detained, or kidnapped for hours or days after being stopped at separatist checkpoints.  The Government of Ukraine has stated that foreigners, including U.S. citizens, who enter Ukraine from Russia through separatist-controlled territory will not be allowed through checkpoints into government-controlled territory. \nThe Federal Aviation Administration (FAA) prohibits U.S. civil aviation from flying in the Ukrainian Simferopol (UKFV) and Dnepropetrovsk (UKDV) Flight Information Regions.  This prohibition remains in effect.  For additional background information regarding FAA flight prohibitions and advisories for U.S. civil aviation, consult the FAA’s Prohibitions, Restrictions and Notices web page.\nThe situation in Ukraine is unpredictable and could change quickly.  U.S. citizens throughout Ukraine should avoid large crowds and be prepared to remain indoors should protests or demonstrations escalate.\nU.S. Embassy Kyiv's Consular Section is open for all public services; however, in light of the ongoing unrest, the Embassy has severely restricted the travel of U.S. government personnel to Donetsk and Luhansk oblasts and Crimea, and occasionally limits travel to adjacent regions. As a result, the Embassy's ability to provide consular services, including responding to emergencies, to U.S. citizens in eastern Ukraine and Ukraine's Crimean region is extremely limited.\nFor further security information in Ukraine:\n\nSee the State Department's travel website for the Worldwide Caution, Travel Warnings, Travel Alerts, and Ukraine Country Specific Information.\nEnroll in the Smart Traveler Enrollment Program (STEP) to receive security messages and make it easier to locate you in an emergency.\nContact the U.S. Embassy in Ukraine, located at 4 A.I Sikorsky Street (formerly Tankova) at +380-44-521-5566, or e-mail KyivACS@state.gov 8:30 a.m. to 5:30 p.m. Monday through Friday. After-hours emergency number for U.S. citizens is +380-44-521-5000.\nCall 1-888-407-4747 toll-free in the United States and Canada, at 1-202-501-4444 from other countries. These numbers are available from 8:00 a.m. to 8:00 p.m. Eastern Standard Time, Monday through Friday (except U.S. federal holidays).\nFollow us on Twitter and Facebook.",
      "colorClass": "alert-warning",
      "source": "US State Department",
      "textOverview": "The Department of State warns U.S. citizens to defer all travel to Crimea and the eastern regions of Donetsk and Luhansk, and recommends those U.S. citizens currently living in or visiting these regions to depart."
    }
  ],
  "LB": [
    {
      "type": "Warning",
      "startDate": "2015-12-11T05:00:00.000Z",
      "link": "http://travel.state.gov/content/passports/en/alertswarnings/lebanon-travel-warning.html",
      "text": "The Department of State urges U.S. citizens to avoid all travel to Lebanon because of ongoing safety and security concerns. U.S. citizens living and working in Lebanon should understand that they accept the risks of remaining in the country and should carefully consider those risks.  This supersedes the Travel Warning issued on May 29, 2015.\n\r\n\r\n\n\r\n\r\n\r\n\r\nSudden outbreaks of violence can occur at any time in Lebanon, and armed clashes have occurred in major cities.  On November 12, 2015, twin suicide bombings in a commercial and residential area of the Burj al-Barajneh neighborhood in Beirut’s southern suburbs killed 43 people and wounded 239 others.  ISIL claimed responsibility for the bombings.  After the implementation of the security plan in Tripoli in October 2014, the neighborhoods of Bab al-Tabbaneh and Jabal Mohsen remain tense.  Armed clashes have resulted in deaths and injuries in these neighborhoods in the past, and there are potentially large numbers of weapons in the hands of non-governmental elements.  The Lebanese Armed Forces are routinely brought in to quell the violence in these situations. \nThe Lebanese government cannot guarantee the protection of U.S. citizens in the country against sudden outbreaks of violence.  Public demonstrations occur with little warning and may become violent.  Since August 2015, demonstrations by protestors calling for an end to the country’s trash crisis and political deadlock have resulted in numerous injuries and arrests. Family, neighborhood, or sectarian disputes can escalate quickly and can lead to gunfire or other violence with no warning.  U.S. citizens have died in such incidents.  The ability of U.S. government personnel to reach travelers or provide emergency services is severely limited.  Protesters have blocked major roads to gain publicity for their causes, including the primary road between downtown Beirut and Rafiq Hariri International Airport temporarily without warning.  Access to the airport may be cut off if the security situation deteriorates.\nU.S. citizens traveling or residing in Lebanon despite this Travel Warning should keep a low profile, assess their personal security, and vary times and routes for all required travel.  U.S. citizens also should pay close attention to their personal security at locations where Westerners generally are known to congregate, and should avoid demonstrations and large gatherings.  They should consider avoiding areas where bombings have taken place recently.  The most recent Security Messages are posted on the U.S. Embassy Beirut website.\nOn November 5, 2015, a deadly blast ripped through Lebanon’s restive northeast border town of Arsal killing at least four people and wounding several others. The attack targeted a meeting in the Sabil neighborhood of the Committee of Qalamoun Scholars and was caused by a suicide bomber using a motorbike.  The very next day, a Lebanese Armed Forces patrol was reportedly targeted by a roadside explosive device, in the same al-Sabil neighborhood of Arsal.\nThere have been episodic clashes between the Lebanese army and Syrian-based extremists along the border with Syria since August 2014.  U.S. citizens in Lebanon should monitor ongoing political and security developments in both Lebanon and Syria.  There have been incidents of cross-border shelling and air strikes of Lebanese villages from Syria, resulting in deaths and injuries.  There have been reports of armed groups from Syria kidnapping or attacking Lebanese citizens living in border areas. Clashes between Lebanese authorities and criminal elements continue to occur in areas of the Bekaa Valley and border regions.  Similar incidents could occur again without warning.  With the potential for violence and abductions, the U.S. Embassy strongly urges U.S. citizens to avoid the Lebanese-Syrian border region.\nThere are border tensions to the south with Israel as well, and the U.S. Embassy also urges U.S. citizens to avoid the border.  In January 2015, hostilities between Israel and Hizballah flared in the Golan Heights and Shebaa Farms area, and the potential for wider conflict remains.  South of the Litani River, Hizballah has stockpiled large amounts of munitions in anticipation of a future conflict with Israel.  In the past, there have been sporadic rocket attacks from southern Lebanon into Israel in connection with the violence between Israel and Hamas in Gaza.  These attacks, normally consisting of rockets fired at northern Israel, often provoke a prompt Israeli military response.  The rocket attacks and responses can occur without warning.  Landmines and unexploded ordnance pose significant dangers throughout southern Lebanon, particularly south of the Litani River, as well as in areas of the country where fighting was intense during the civil war.  More than 40 civilians have been killed and more than 300 injured by unexploded ordnance since the 2006 Israel-Hizballah war.  Travelers should watch for posted landmine warnings and strictly avoid all areas where landmines and unexploded ordnance may be present.\nExtremist groups operate in Lebanon, including Hizballah, ISIL, ANF, Hamas, and the Abdullah Azzam Brigades (AAB).  The U.S. government has designated all of these groups as terrorist organizations. ISIL and ANF have claimed responsibility for suicide bombings in Lebanon, and these groups are active in northern Lebanon, the Bekaa Valley, and in border areas with Syria. U.S. citizens have been the target of terrorist attacks in Lebanon in the past, and the threat of anti-Western terrorist activity remains. \nThere is potential for death or injury in Lebanon because of terrorist bombings.  Even attacks that target specific individuals or venues frequently resulted in death and injuries to innocent bystanders.  Although there is no evidence that these attacks were directed specifically at U.S. citizens, there is a real possibility of “wrong place, wrong time” harm.  The security services have made great progress in improving their capacity to detect and intercept terrorist attacks, resulting in a marked decline in suicide and car bombs, but many extremist groups remain actively engaged in planning attacks.  These regularly involve suicide bombers, many of whom have detonated their vests or vehicles short of their targets.\nHizballah maintains a strong presence in parts of south Beirut, the Bekaa Valley, and areas in southern Lebanon.  Hizballah has been the target of attacks by other extremist groups for their support of the Asad regime in Syria.  As was demonstrated again by the events of November 12, 2015, the potential for extremist violence in Lebanon remains a strong possibility at any time.  Hizballah and other groups have at times detained and extensively interrogated U.S. citizens or other foreigners for political motivations.\nPalestinian groups hostile to both the Lebanese government and the United States operate autonomously in formal and informal refugee camps in different areas of the country.  Intra-communal violence within the camps has resulted in shootings and explosions.  U.S. citizens should avoid Palestinian refugee camps.  The security situation in informal encampments of Syrian refugees is equally problematic.\nKidnapping, whether for ransom or political motives, is a problem in Lebanon, and U.S. citizens have been victims of kidnapping in recent years.  Kidnappers have abducted business people under the guise of coming to Lebanon for meetings.  Suspects in kidnappings sometimes have ties to terrorist or criminal organizations.  The U.S. government’s ability to help U.S. citizens kidnapped or taken hostage is very limited.  Although the U.S. government places the highest priority on the safe recovery of kidnapped U.S. citizens, it is U.S. policy not to make concessions to hostage takers.  U.S. law also makes it illegal to provide material support to terrorist organizations.\nThe U.S. Department of State warns U.S. citizens of the risk of traveling on airlines that fly over Syria.  Commercial aircraft are at risk when flying over regions in conflict.  We strongly recommend that U.S. citizens considering air travel overseas evaluate the route that their proposed commercial flight may take and avoid any flights that pass through Syrian airspace.  U.S. government personnel in Lebanon have been prohibited from taking flights that pass through Syrian airspace. \nThe Department of State considers the threat to U.S. government personnel in Beirut sufficiently serious to require them to live and work under strict security restrictions.  The internal security policies of the U.S. Embassy may be adjusted at any time and without advance notice.  These practices limit, and may prevent, access by U.S. Embassy officials to certain areas of the country, especially to parts of metropolitan Beirut, Tripoli, the Bekaa Valley, and southern Lebanon.  Because of security concerns, unofficial travel to Lebanon by U.S. government employees and their family members is strictly limited, and requires the Department of State’s prior approval.\nIn the event that the security climate in Lebanon worsens, U.S. citizens will be responsible for arranging their own travel out of Lebanon.  U.S. citizens should be aware that the Embassy does not offer protection services to individuals who feel unsafe.  U.S. citizens with special medical or other needs should be aware of the risks of remaining given their condition, and should be prepared to seek treatment in Lebanon if they cannot arrange for travel out of the country.\nU.S. government-facilitated evacuations, such as the evacuation that took place from Lebanon in 2006, occur only when no safe commercial alternatives exist.  Evacuation assistance is provided on a cost-recovery basis, which means the traveler must reimburse the U.S. government for travel costs.  The lack of a valid U.S. passport may hinder U.S. citizens' ability to depart the country and may slow the U.S. Embassy's ability to provide assistance.  U.S. citizens in Lebanon should therefore ensure that they have proper and current documentation at all times.  U.S. Legal Permanent Residents should consult with the Department of Homeland Security before they depart the United States to ensure they have proper documentation to re-enter.  Further information on the Department’s role during emergencies is provided on the Bureau of Consular Affairs’ website.  \nFor more information:\n\nSee the State Department's travel website for the Worldwide Caution, Travel Warnings, Travel Alerts, and Specific Information for Lebanon.\nEnroll in the Smart Traveler Enrollment Program (STEP) to receive security messages and make it easier to locate you in an emergency.  U.S. citizens without Internet access may enroll directly with the U.S. Embassy in Beirut. \nInformation on consular services and enrollment in STEP can also be found at the U.S. Embassy in Beirut's website, or by phone at the above telephone numbers between 2:00 p.m. and 4:00 p.m., Monday through Friday local time.  U.S. citizens in Lebanon may also contact the consular section by email at BeirutACS@state.gov.  \nThe U.S. Embassy is located in Awkar, near Antelias, Beirut, Lebanon.  Public access hours for U.S. citizens are Monday, Tuesday, and Thursday, from 8:00 a.m. to 11:00 a.m.  U.S. citizens must make appointments in advance.  U.S. citizens who require emergency services outside these hours may contact the Embassy by telephone at any time.  The Embassy’s telephone numbers are (961-4) 542-600, (961-4) 543-600, and fax (961-4) 544-209 (Note: the (961) is only necessary when dialing from outside the country.  When dialing inside the country, use ‘0’ before the number, e.g., 04 542-600).\nEmergency calls may also be placed through the Department of State at 1-888-407-4747 toll-free in the United States and Canada or 1-202-501-4444 from other countries.\nFollow us on Twitter and Facebook.",
      "colorClass": "alert-warning",
      "source": "US State Department",
      "textOverview": "The Department of State urges U.S. citizens to avoid all travel to Lebanon because of ongoing safety and security concerns."
    }
  ],
  "IQ": [
    {
      "type": "Warning",
      "startDate": "2015-12-04T05:00:00.000Z",
      "link": "http://travel.state.gov/content/passports/en/alertswarnings/iraq-travel-warning.html",
      "text": "The Department of State warns U.S. citizens against all but essential travel to Iraq.   Travel within Iraq remains very dangerous given the security situation.  The ability of the Embassy to assist U.S. citizens facing difficulty, including arrest, is extremely limited.  Private U.S. citizens are strongly discouraged from traveling to Iraq to join in armed conflict.  The Embassy in Baghdad and the Consulates General in Basrah and Erbil are open and operating.  This supersedes the Travel Warning dated October 19, 2015. \n\r\n\r\n\n\r\n\r\n\n\r\n\r\n\r\n\r\nU.S. citizens in Iraq remain at high risk for kidnapping and terrorist violence.  Methods of attack have included roadside improvised explosive devices (IEDs) including explosively formed penetrators (EFPs), magnetic IEDs placed on vehicles, human and vehicle-borne IEDs, mines placed on or concealed near roads, mortars and rockets, and shootings using various direct fire weapons.  When such attacks occur, they frequently take place in public gathering places such as cafes, markets, and other public venues.\nNumerous insurgent groups, including the Islamic State of Iraq and the Levant (ISIL), remain active and terrorist activity and violence persist in many areas of the country.  ISIL controls Mosul, Iraq's second largest city, as well as significant territory in northern, western, and central Iraq, particularly along the Tigris and Euphrates valleys, and the group continues to attack Iraqi security forces in those areas.  Terrorist attacks within the Iraqi Kurdistan Region (IKR) occur less frequently than in other parts of Iraq, although the Kurdistan Regional Government (KRG), U.S. Government facilities, and western interests remain possible targets, as evidenced by the April 17 bombing in the public area outside U.S. Consulate General Erbil.  In addition, anti-U.S. sectarian militias may threaten U.S. citizens and western companies throughout Iraq.\nDue to the potential for political protests and demonstrations to become violent, U.S. citizens in Iraq are strongly urged to avoid protests and large gatherings.\nThe U.S. government considers the potential threat to U.S. government personnel in Iraq to be serious enough to require them to live and work under strict security guidelines.  All U.S. government employees under the authority of the U.S. Chief of Mission must follow strict safety and security procedures when traveling outside the Embassy and Consulates.  In addition, the internal security policies of the U.S. Mission in Iraq may be changed or adjusted at any time and without advance notice.  The Mission will regularly restrict or prohibit movements by its personnel, often on short notice and for security threats or demonstrations.  State Department guidance to U.S. businesses in Iraq advises the use of protective security details.  Detailed security information is available on the U.S. Embassy website.\nThe U.S. Embassy is located in the International Zone (IZ) in Baghdad.  The IZ is a restricted access area.  Iraqi authorities are responsible for control of the IZ.  Travelers to the IZ should be aware that Iraqi authorities may require special identification to enter the IZ or may issue IZ-specific access badges.  On October 4, 2015, Iraqi authorities began to allow passenger vehicles to transit the IZ on the 14 July Expressway after undergoing a security screening.  Individuals residing and traveling within the IZ should continue to exercise good personal safety precautions.\nSome U.S. and third-country business people travel throughout much of Iraq; however, their movement is restricted, and they travel with security advisors and protective security teams.\nThe Government of Iraq strictly enforces requirements regarding visas and stamps for entry and exit, vehicle registration, authorizations for weapons, and movements through checkpoints.  The Embassy highly recommends that all U.S. citizens in Iraq carefully review the status of their travel documents and any necessary licenses and government authorizations to ensure that they are current and valid.  U.S. citizens are urged to immediately correct any deficiencies in their travel documents.  U.S. citizens are strongly advised against entering or traveling within Iraq with invalid documents.  For more information about entry/exit requirements for U.S. citizens, please see our Country Specific Information page for Iraq.\nThe Federal Aviation Administration (FAA) has determined that U.S. civil aviation flying in Iraqi airspace is at risk from ongoing combat operations involving military forces (military aerial combat operations and other militarily-related activity) and militant groups. As a result, the FAA currently prohibits U.S. civil aviation from operating in or overflying Iraqi airspace with very limited exceptions. Foreign airlines operating in Iraq may cancel their operations without warning due to the security environment or other factors. Travelers should remain vigilant and reconfirm all flight schedules with their airline prior to commencing any travel. For further background information regarding FAA prohibitions on U.S. civil aviation, U.S. citizens should consult the Federal Aviation Administration’s Prohibitions, Restrictions and Notices website.\nU.S. citizens should avoid areas near the Syrian, Turkish, or Iranian borders, which are especially dangerous and not always clearly defined.  The Governments of Turkey and Iran continue to carry out military operations against insurgent groups in the mountainous regions bordering Iraq.  These operations have included troop movements and both aerial and artillery bombardments.  Extensive unmarked minefields also remain along these borders.  Border skirmishes with smugglers have become commonplace.  Unrest in Syria has resulted in large numbers of people seeking refuge in the area.  Iranian authorities previously detained, for an extended period, U.S. citizens who were hiking in the IKR in the vicinity of the Iranian border.  The resources available to the U.S. Embassy to assist U.S. citizens who venture close to or cross Iraq’s border with Iran are extremely limited.  The Department of State discourages travel in close proximity to the Iranian border.\nThe Government of Iraq has begun to take measures to improve the structural integrity of the Mosul Dam.  A dam failure could cause significant flooding and interruption of essential services from Mosul to Baghdad.  While it is impossible to accurately predict the likelihood of the dam failing, the Embassy has made contingency plans to relocate its personnel in such an event.  The Embassy recommends that U.S. citizens in Iraq, especially those who reside in the floodplain of the Tigris River, prepare their own contingency plans and stay informed of local media reports and Embassy security messages for updates.\nThe ability of the U.S. Embassy to provide consular services to U.S. citizens throughout Iraq, including Baghdad, is particularly limited given the security environment.  The U.S. Consulate General in Basrah cannot provide routine services such as passport applications, notary services, or Consular Reports of Birth Abroad.  U.S. citizens in need of these services in Erbil must make an appointment with the Consulate on-line, either through the Embassy's website or the website for the Consulate General in Erbil. \nU.S. citizens who choose to visit or reside in Iraq despite this Travel Warning are urged to take responsibility for their own personal security and belongings (including their U.S. passports) and should be aware that Iraqi authorities have arrested or detained U.S. citizens whose purpose of travel is not readily apparent.  Persons also have been detained for taking photographs of buildings, monuments, or other sites, especially in the International Zone in Baghdad, where photography is forbidden.\nFor more information:\n\nSee the State Department's travel website for the Worldwide Caution, Travel Warnings, Travel Alerts, and  Specific Information for Iraq.\nEnroll in the Smart Traveler Enrollment Program (STEP) to receive security messages and make it easier to locate you in an emergency. \nContact the U.S. Embassy in Iraq, located in the International Zone, Baghdad, via email, or by accessing U.S. Embassy Baghdad’s website.  The after-hours emergency numbers are 011-964-770-443-1286 or 011-964-770-030-4888 (from the United States) or 0770-443-1286 or 0770-030-4888 (within Iraq). \nAs cell phone service is unreliable in Iraq, emergency calls may also be placed through the Department of State at 1-888-407-4747 toll-free in the United States and Canada or 1-202-501-4444 from other countries.\nFollow us on Twitter and Facebook.",
      "colorClass": "alert-warning",
      "source": "US State Department",
      "textOverview": "The Department of State warns U.S. citizens against all but essential travel to Iraq."
    }
  ],
  "AF": [
    {
      "type": "Warning",
      "startDate": "2015-11-19T05:00:00.000Z",
      "link": "http://travel.state.gov/content/passports/en/alertswarnings/afghanistan-travel-warning.html",
      "text": "The Department of State continues to warn U.S. citizens against travel to Afghanistan. The security situation in Afghanistan is extremely unstable, and the threat to all U.S. citizens in Afghanistan remains critical.  This Travel Warning supersedes the Travel Warning for Afghanistan issued on May 22, 2015. \n\r\n\r\n\n\r\n\r\n\r\n\r\nThe U.S. government remains highly concerned about possible attacks on U.S. citizens (whether visiting or residing in Afghanistan), U.S. facilities, businesses, and perceived U.S. and foreign interests.  Attacks may target official government convoys and compounds, including Afghan and U.S. government facilities, foreign embassies and military installations, as well as restaurants, hotels, airports, non-governmental organization (NGO) offices, international organizations, religious institutions, educational centers, foreign guest houses, and other commercial entities.\nTravel to all areas of Afghanistan remains unsafe due to ongoing military combat operations, landmines, banditry, armed rivalry between political and tribal groups, and insurgent attacks, including attacks using vehicle-borne or other improvised explosive devices (IED).  Extremists associated with various Taliban networks, Islamic State of Iraq and the Levant – Khorasan Province (ISIL-KP), and members of other armed opposition groups are active throughout the country.  Violent and deadly clashes between insurgent groups and Afghan security forces have occurred throughout the country.  On September 28, 2015, the Taliban attacked the provincial capital of Kunduz, causing as many as 100,000 residents to flee their homes.  A strong possibility exists throughout the country for hostile acts, either targeted or random, against U.S. and other foreign nationals at any time. \nKabul remains at high risk for militant attacks, including vehicle-borne improvised explosive devices (VBIED), direct and indirect fire, and suicide bombings. The same risks also exist in other major cities in Afghanistan, to include, but not limited to, Herat, Mazar-e-Sharif, Kunduz, Lashkar Gah, Maimana, Ghazni, and Jalalabad. An ongoing risk of kidnapping and hostage taking exists throughout Afghanistan. \nMilitant attacks throughout the country continue, with many of these attacks specifically targeting U.S. and other foreign citizens and entities.  Examples include the October 11, 2015 bombing of a Coalition convoy in Kabul using a suicide vehicle borne improvised explosive device (SVBIED), which wounded three Afghan civilians, the August 22 SVBIED attack on a convoy in Kabul that killed three U.S. citizens, and the August 17, 2015, kidnapping for ransom of a German citizen working for the German Technical Cooperation Agency (GTZ). \nRiots and civil disturbances can occur anywhere in Afghanistan, often without warning.  U.S. citizens should avoid all rallies and demonstrations.  Protests intended to be peaceful can become confrontational and escalate into violence at any point.  The size of these demonstrations has ranged from as small as 20 to as large as 3,000 people.  The issues that typically prompt demonstrations include grievances against the government or coalition forces, as well as spontaneous public expressions of social, political, and ethnic tensions. \nU.S. citizens representing foreign interests in property or contract disputes – a common problem for foreign companies doing business in Afghanistan – have reported that local parties to the disputes have threatened their lives or held them or their employees captive under extrajudicial conditions while awaiting payouts or intervention by local authorities.  U.S. citizens who find themselves in such situations should not assume that local law enforcement or the U.S. Embassy will be able to assist them in resolving such disputes or intervene on their behalf with Afghan officials.\nThe Department of State considers the threat to U.S. government personnel in Afghanistan sufficiently critical to require them to live and work under strict security restrictions.  All locations outside the U.S. Embassy and other U.S. government facilities are considered off-limits to Embassy personnel unless there is a compelling government interest in permitting such travel that outweighs the risk.  The internal security policies of the U.S. Embassy may be changed or adjusted at any time, without advance notice.  The Embassy will regularly restrict or prohibit movements by its personnel, often on short notice, for reasons such as terrorist attacks, security threats, or demonstrations.  Because of security concerns, unofficial travel to Afghanistan by U.S. government employees and their family members is also restricted, and requires prior approval from the Department of State.\nThe U.S. Embassy's ability to provide emergency consular services to U.S. citizens in Afghanistan is severely limited, particularly for those persons outside of Kabul.  U.S. citizens who choose to visit or remain in Afghanistan despite this Travel Warning are encouraged to limit nonessential travel within Afghanistan, formulate personal contingency plans, monitor the Embassy’s website, and enroll in the Smart Traveler Enrollment Program (STEP) in order to obtain the most current information on travel and security within Afghanistan.  Enrollment in STEP makes it easier for the Embassy to contact U.S. citizens in case of an emergency.  U.S. citizens without Internet access may enroll directly with the U.S. Embassy.\nU.S. government-facilitated evacuations occur only when no safe, commercial alternatives exist. Evacuation assistance is provided on a cost-recovery basis, which means the traveler must reimburse the U.S. government for travel costs.  The lack of a valid U.S. passport and Afghan visa may hinder a U.S. citizen’s ability to depart the country and may slow the U.S. Embassy's ability to assist.  U.S. citizens in Afghanistan should ensure that they have proper and current documentation at all times. Evacuation options from Afghanistan are extremely limited due to the lack of infrastructure, geographic constraints, and other security concerns.  The U.S. government typically evacuates U.S. citizens to a safe haven, and travelers are responsible for making their own onward travel plans.  U.S. citizens should not expect to be evacuated to the United States and should always maintain medevac insurance while living or traveling abroad in case they need emergency medical evacuation back to the United States, which can be a significant expense.  For more information, see \"What the Department of State Can and Can't Do in a Crisis.\"\nThe U.S. Embassy often receives threat information concerning U.S. citizens and U.S. interests in Afghanistan.  For the latest security information, U.S. citizens living or traveling abroad should regularly monitor the Department of State’s Consular Affairs’ website where current Worldwide Caution, Travel Alerts and Travel Warnings, and Country Specific Information for Afghanistan can be found.  Up-to-date information on security can also be obtained by calling 1-888-407-4747 toll free in the United States and Canada or, for callers in other countries, by calling a regular toll line at 1-202-501-4444.  These numbers are available 8:00 a.m. to 8:00 p.m. Eastern Time, Monday through Friday (except U.S. federal holidays).\nFor further information:\n\nSee the Department of State’s Consular Affairs’ website where the Worldwide Caution, Travel Alerts and Travel Warnings can be found for the the latest security information.   \nEnroll in STEP to receive security messages and make it easier to locate you in an emergency.\nContact the U.S. Embassy, located at Great Massoud Road (also known as Bibi Mahru or Airport Road) between Radio Television Afghanistan (RTA) and the Ministry of Public Health.  The Consular Section of the U.S. Embassy can be reached at 301-490-1042, ext. 8499 from the United States, or +93(0) 700-108-499 from abroad during business hours, Sunday through Thursday, 8:00 a.m. to 4:00 p.m., Kabul time.  For after-hours, truly exigent emergencies involving U.S. citizens, please contact the Embassy Duty Officer at +93-(0)700-108-001.  Any routine consular correspondence relating to services for U.S. citizens may be sent to KabulACS@state.gov.\nCall 1-888-407-4747 toll-free in the United States and Canada or 1-202-501-4444 from other countries from8:00 a.m. to 8:00 p.m. Eastern Standard Time, Monday through Friday (except U.S. federal holidays).",
      "colorClass": "alert-warning",
      "source": "US State Department",
      "textOverview": "The Department of State continues to warn U.S. citizens against travel to Afghanistan."
    }
  ],
  "KP": [
    {
      "type": "Warning",
      "startDate": "2015-11-20T05:00:00.000Z",
      "link": "http://travel.state.gov/content/passports/en/alertswarnings/north-korea-travel-warning.html",
      "text": "The Department of State strongly recommends against all travel by U.S. citizens to North Korea (Democratic People's Republic of Korea, or DPRK). This replaces the Travel Warning for North Korea of April 15, 2015, to reiterate and highlight the risk of arrest and long-term detention due to the DPRK’s inconsistent application of its criminal laws.\n\r\n\r\n\n\r\n\r\n\r\n\r\nTravel by U.S. citizens to North Korea is not routine, and U.S. citizens have been subject to arrest and long-term detention for actions that would not be cause for arrest in the United States or other countries.  North Korean authorities have arrested U.S. citizens who entered the DPRK legally on valid DPRK visas as well as U.S. citizens who accidentally or intentionally crossed into DPRK territory without valid visas. The Department of State has received reports of DPRK authorities detaining U.S. citizens without charges and not allowing them to depart the country.  North Korea has even detained several U.S. citizens who were part of organized tours.  Do not assume that joining a group tour or using a tour guide will prevent North Korean authorities from detaining you or arresting you.  Efforts by private tour operators to prevent or resolve past detentions of U.S. citizens in the DPRK have not succeeded in gaining their release.\nThe Government of North Korea has detained, arrested, and imposed extremely heavy fines on persons who violated DPRK laws, such as entering the country illegally. Travelers to North Korea must enter the DPRK with a valid passport and valid DPRK visa.  Foreign visitors to North Korea may be arrested, detained, or expelled for activities that would not be considered criminal outside North Korea, including involvement in unsanctioned religious and/or political activities (whether those activities took place inside or outside North Korea), unauthorized travel, or unauthorized interaction with the local population.\nNorth Korean security personnel may regard as espionage unsanctioned religious or political activities, unauthorized or unescorted travel inside North Korea and unauthorized attempts to speak directly to North Korean citizens.  North Korean authorities may fine or arrest travelers for exchanging currency with an unauthorized vendor, for taking unauthorized photographs, or for shopping at stores not designated for foreigners.  It is a criminal act in North Korea to show disrespect to the country's former leaders, Kim Jong Il and Kim Il Sung, or to the current leader, Kim Jong Un.\nDPRK customs officials will inspect USB drives, CDs, DVDs, mobile phones, tablets, laptops, or other electronic and multimedia devices brought into the country.  Internet browsing histories and cookies on travelers’ computers and other electronic devices are subject to search for banned content, including pornography or material critical of the DPRK government.  Possession of any media, either printed or electronic, criticizing the DPRK government is a criminal act.  Bringing pornography into the country is also a criminal act.\n\nPlease be sure that the information contained on those devices does not violate the laws or regulations of the DPRK, as penalties for knowingly or unknowingly violating North Korea's laws may be much harsher than U.S. penalties for similar offenses.  Sentences for crimes can include years of detention in hard labor camps or death.\nIf DPRK authorities permit you to keep your cell phone upon entry into the country, please keep in mind that you have no right to privacy in North Korea and should assume your communications are monitored. \nGPS-trackers and satellite phones are not allowed.\nSince the United States does not maintain diplomatic or consular relations with the DPRK, the U.S. government has no means to provide normal consular services to U.S. citizens in North Korea.  The Embassy of Sweden, the U.S. Protecting Power in the DPRK capital of Pyongyang, provides limited consular services to U.S. citizens traveling in North Korea who are ill, injured, arrested, or who have died while there.  The U.S.-DPRK Interim Consular Agreement provides that North Korea will notify the Embassy of Sweden within four days of an arrest or detention of a U.S. citizen and will allow consular visits by the Swedish Embassy within two days after a request is made.  However, the DPRK government routinely delays or denies consular access.\nU.S. citizens who plan to travel to North Korea are strongly encouraged to contact the U.S. Embassy in Beijing, China, about their trip by enrolling in the State Department's Smart Traveler Enrollment Program.  If you enroll in this program, the State Department can keep you up to date with important safety and security announcements via email messages (though you may not have access to email while in the DPRK).  Enrollment also makes it easier for friends and family to get in touch with you via the U.S. Embassy in case of an emergency.\nU.S. citizens residing in China can contact the U.S. Embassy in Beijing directly. The Embassy is located next to the Ladies' Street (Nuren Jie) and Laitai Flower Market, near the Kempinski Hotel and Lufthansa shopping Center on Tianze Road near the Liangmaqiao subway stop:\nU.S. Embassy Beijing\nAmerican Citizens Services Unit\nNo. 55 An Jia Lou Road\nChaoyang District\nBeijing, China 100600\nTelephone: (86-10) 8531-4000\nFacsimile: (86-10) 8531-3300\nEmail: BeijingACS@state.gov\n Emergency after-hours telephone: (86-10) 8531-4000\nU.S. citizens traveling to North Korea are also strongly encouraged to contact the Embassy of Sweden by telephone or email prior to travel.  Please provide the Embassy of Sweden with your name, date of birth, dates of your trip, and emergency contact information:\nSwedish Embassy  (U.S. Protecting Power in North Korea)\nMunsu-Dong District\nPyongyang, DPRK\nTelephone: (850-2) 3817 485 (reception)\nTelephone: (850-2) 3817 904, (850-2) 3817 907 (Deputy)\nTelephone: (850-2) 3817 908, (850-2) 3817 905 (Ambassador)\nFacsimile: (850-2) 3817 663\nEmail:ambassaden.pyongyang@gov.se\nU.S. citizens should also consult the Department of State's Country Specific Information for North Korea, and the current Worldwide Caution, which are located on the Department's travel website at travel.state.gov.  U.S. citizens can obtain current information on safety and security conditions by calling 1-888-407-4747 toll-free in the United States and Canada or, from outside the United States and Canada, +1-202-501-4444.  These numbers are available from 8:00 a.m. to 8:00 p.m. Eastern Time, Monday through Friday (except U.S. federal holidays).\nStay up to date by bookmarking our Bureau of Consular Affairs website, which contains the current Travel Warnings and Travel Alerts as well as the Worldwide Caution. Follow us on Twitter and the Bureau of Consular Affairs page on Facebook as well.",
      "colorClass": "alert-warning",
      "source": "US State Department",
      "textOverview": "The Department of State strongly recommends against all travel by U.S. citizens to North Korea (Democratic People's Republic of Korea, or DPRK)."
    }
  ],
  "CO": [
    {
      "type": "Warning",
      "startDate": "2015-06-05T04:00:00.000Z",
      "link": "http://travel.state.gov/content/passports/en/alertswarnings/colombia-travel-warning.html",
      "text": "The Department of State has issued this Travel Warning to inform U.S. citizens about the security situation in Colombia. Tens of thousands of U.S. citizens safely visit Colombia each year for tourism, business, university studies, and volunteer work. Security in Colombia has improved significantly in recent years, including in tourist and business travel destinations such as Bogota, Cartagena, Barranquilla, Medellin, and Cali.  However, violence linked to narco-trafficking continues to affect some rural and urban areas. This Travel Warning replaces the previous travel warning released on April 14, 2014, with minor changes to the travel restrictions for U.S. government officials and their families in Colombia.  It was reviewed on June 5, 2015 with no changes.\n\r\n\r\n\n\r\n\r\n\r\n\r\nThere have been no reports of U.S. citizens targeted specifically for their nationality. While the U.S. Embassy has no information regarding specific and credible threats against U.S. citizens in Colombia, both the Revolutionary Armed Forces of Colombia – People’s Army (FARC) and National Liberation Army (ELN) terrorist groups continue to condemn any U.S. influence in Colombia.  The Department of State strongly encourages U.S. citizens to exercise caution and remain vigilant as terrorist and criminal activities remain a threat throughout the country. Explosions occur throughout Colombia on a regular basis, including in Bogota. Small towns and rural areas of Colombia can be extremely dangerous due to the presence of terrorists and  criminal elements, including armed gangs (referred to as \"BACRIM\" in Spanish), that are active throughout much of the country. Violence associated with the BACRIM has spilled over into many of Colombia's major cities. These groups are heavily involved in the drug trade, extortion, kidnapping, and robbery.\nThe incidence of kidnapping in Colombia has diminished significantly from its peak in 2000.  However, kidnapping remains a threat. Terrorist groups and other criminal organizations continue to kidnap and hold civilians, including foreigners, for ransom.  No one is immune from kidnapping on the basis of occupation, nationality, or other factors.  The U.S. government places the highest priority on the safe recovery of kidnapped U.S. citizens, but it is U.S. policy not to make concessions to kidnappers.\nU.S. government officials in Colombia regularly travel to the major cities of Colombia such as Bogota, Medellin, Cali, Barranquilla, and Cartagena without incident. U.S. government officials and their families in Colombia normally are permitted to travel to major cities only by air. They may not use inter- or intra-city bus transportation, or travel by road outside urban areas at night. U.S. government officials in Colombia and their families are restricted to traveling within certain areas. This includes using the main highways to travel between Bogota and Bucaramanga, and between Bogota and Ibague. Personnel are also allowed to drive between Manizales, Pereira, and Armenia and within the “coffee country” departments of Caldas, Risaralda, and Quindío. On the Caribbean coast, personnel are restricted to driving along Highway 90 from Cartagena, through Barranquilla to Santa Marta.  Travel to all other areas of Colombia is off limits unless specific authorization is granted.  All U.S. citizens in Colombia are urged to follow these precautions and exercise extra caution outside of the aforementioned areas.\nFor more detailed information on staying safe in Colombia, please see the State Department's Country Specific Information for Colombia. For the latest security information, U.S. citizens traveling abroad should regularly monitor the Bureau of Consular Affairs' internet web site, where the current Worldwide Caution, Travel Warnings, and Travel Alerts can be found. Follow us on Twitter and the Bureau of Consular Affairs page on Facebook as well.\nUp-to-date information on security can also be obtained by calling 1-888-407-4747 toll free in the United States and Canada or, for callers outside the United States and Canada, a regular toll line at 001-202-501-4444. These numbers are available from 8:00 a.m. to 8:00 p.m. Eastern Time, Monday through Friday (except U.S. federal holidays). U.S. citizens living or traveling in Colombia are encouraged to enroll with the State Department's Smart Traveler Enrollment Program to obtain updated information on travel and security within Colombia. For any emergencies involving U.S. citizens in Colombia, please contact the U.S. Embassy or the closest U.S. Consulate as listed below.\nThe U.S. Embassy is located at Calle 24 Bis No. 48-50 Bogota, D.C., Colombia. Mailing address: Carrera 45 No. 24B-27 Bogota, D.C., Colombia. In case of a serious emergency that jeopardizes the health or safety of a U.S. citizen in Colombia, please call the Embassy at (+57-1) 275-2000; Embassy fax: (+57-1) 275-4501; Consular Section phone: (+57-1) 275-4900. The Embassy's American Citizens Services office provides routine information at http://bogota.usembassy.gov. For questions not answered there, inquiries may be sent by email to ACSBogota@state.gov.\nThe U.S. Consular Agency in Barranquilla, which accepts passport applications and performs notarial services, is located at Calle 77B, No. 57-141, Piso 5, Centro Empresarial Las Americas, Barranquilla, Atlantico, Colombia; telephone (+57-5) 353-2001/353-2182/369-0149. In case of an emergency in the Barranquilla/North Coast area, please contact the Embassy in Bogota at (+57-1) 275-2000 which will forward the call to our Consular Agent.",
      "colorClass": "alert-warning",
      "source": "US State Department",
      "textOverview": "The Department of State has issued this Travel Warning to inform U.S. citizens about the security situation in Colombia."
    }
  ],
  "VE": [
    {
      "type": "Warning",
      "startDate": "2015-09-18T04:00:00.000Z",
      "link": "http://travel.state.gov/content/passports/en/alertswarnings/venezuela-travel-warning.html",
      "text": "The Department of State has issued this Travel Warning to inform U.S. citizens about security conditions in Venezuela. Thousands of U.S. citizens safely visit Venezuela each year for study, tourism, business, and volunteer work. While U.S. citizens are not specifically targeted, violent crime in Venezuela is pervasive, both in the capital, Caracas, and in the interior. This replaces the Travel Warning issued on December 11, 2014 to include updated crime data.\n\n\n\n\r\n\r\n\n\r\n\r\n\r\n\r\nArmed robberies take place throughout Caracas and other cities, including in areas generally presumed safe and frequented by tourists. Street crime can take place at any time, and upscale residential areas where many U.S. citizens live and visit are not immune from street crime and home invasion robberies. Recently, heavily armed criminals used grenades and assault rifles to commit crimes at banks, shopping malls, public transportation stations, and universities.\nAccording to the non-governmental organization Venezuelan Violence Observatory (VVO), Venezuela has the second highest homicide rate in the world. Kidnappings are also a serious concern throughout the country, and, according to police sources, roughly 80 percent go unreported. Most can be classified as “express kidnappings” which last only a few hours, while the victim and/or family members gather as much money as possible for a quick release. Victims are often physically roughed up or even killed if they resist kidnappers’ demands. In addition, there is cross-border violence, kidnappings, drug trafficking, and smuggling along Venezuela’s western border with Colombia.\nThe Department of State considers the criminal threat to U.S. government personnel in Venezuela sufficiently serious to require them to live and work under strict security restrictions. All U.S. direct-hire personnel and their families assigned to the U.S. Embassy in Caracas are subject to an embassy movement policy for their safety and well-being. The details of the policy are found in our Country Specific Information on Venezuela. These practices limit, and may occasionally prevent, access by U.S. Embassy officials to certain areas of Caracas and the interior of the country.\nIn addition, all U.S. direct-hire personnel and their family members who are assigned to the U.S. Embassy in Caracas are required to take an armored vehicle when traveling to and from the Maiquetia Airport as well as when traveling in some parts of Caracas and the interior.\nU.S. citizens in Venezuela should be vigilant of their surroundings at all times and in all locations, especially when entering or exiting their homes, hotels, cars, garages, schools, and workplaces. Whenever possible, U.S. citizens should travel in groups of two or more persons; avoid wearing jewelry and carrying large sums of money or displaying cash, ATM/credit cards, mobile phones, or other valuables; and avoid walking at night in most areas of Venezuela and walking alone on beaches, historic ruins, and trails. Incidents of crime along inter-city roads, including carjacking and kidnapping, are common in Venezuela. Motorists should avoid traveling at night and always drive with their doors locked to deter potential robberies at traffic lights and on congested city streets.\nFor further information:\n\nSee the State Department's travel website for the Worldwide Caution, Travel Warnings, Travel Alerts, and Venezuela Specific Information.\nEnroll in the Smart Traveler Enrollment Program (STEP) to receive security messages and make it easier to locate you in an emergency.\nContact the U.S. Embassy in Venezuela, located at Calle F con Calle Suapure, Lomas de Valle Arriba, Caracas at +[58] 212-975-6411, 8:00 a.m. to 5:00 p.m. Monday through Friday. After-hours emergency number for U.S. citizens is +[58] 0212-907-8400.\nCall 1-888-407-4747 toll-free in the United States and Canada or 1-202-501-4444 from other countries from 8:00 a.m. to 8:00 p.m. Eastern Standard Time, Monday through Friday (except U.S. federal holidays).\nFollow us on Twitter and Facebook.",
      "colorClass": "alert-warning",
      "source": "US State Department",
      "textOverview": "The Department of State has issued this Travel Warning to inform U.S. citizens about security conditions in Venezuela."
    }
  ],
  "PH": [
    {
      "type": "Warning",
      "startDate": "2015-10-21T04:00:00.000Z",
      "link": "http://travel.state.gov/content/passports/en/alertswarnings/philippines-travel-warning.html",
      "text": "The Department of State warns U.S. citizens of the risks of travel to the Philippines, in particular to the Sulu Archipelago, certain regions and cities of the island of Mindanao, and the southern Sulu Sea area. This Travel Warning replaces the Travel Warning dated May 20, 2015, and reflects continuing threats in those areas due to terrorist and insurgent activities.\n\r\n\r\n\n\r\n\r\n\r\n\r\nU.S. citizens should continue to defer non-essential travel to the Sulu Archipelago, due to the high threat of kidnapping of international travelers and violence linked to insurgency and terrorism there.\nBased on a history of kidnappings and attempted kidnappings of foreigners in the Eastern Sabah province of Malaysia and in the southern Sulu Sea area by terrorist or insurgent groups based in the Sulu Archipelago, U.S. citizens should continue to exercise extreme caution if considering travel in the southern Sulu Sea region from the southern tip of Palawan, along the coast of Sabah, Malaysia and the islands of the Sulu Archipelago, up to Zamboanga City, Mindanao.\nU.S. citizens should also continue to exercise extreme caution if traveling to certain regions and cities of the island of Mindanao. Separatist and terrorist groups continue to conduct bombings, kidnappings and attacks against civilians, political leaders, and Philippine security forces. Over the past nine months, at least 15 separate kidnappings have been reported across Mindanao. In western Mindanao, terrorist, insurgent, and criminal gangs regularly conduct kidnappings for ransom, including the kidnapping of a foreigner in Dipolog City in early October 2015 by unknown assailants. In central Mindanao, the Bangsamoro Islamic Freedom Fighters (BIFF) remain active in the Cotabato City area, and in the Maguindanao, North Cotabato, and Sultan Kudarat provinces, where the government maintains a state of emergency and a greater police presence. While there have been no recent reported terrorist threats or incidents within the Davao City or Surigao city limits, eastern Mindanao is not free from threats. In September 2015, assailants believed to be members of the Abu Sayyaf Group kidnapped four individuals from the popular resort island of Samal, a 15 minute boat ride from Davao City. Two other individuals narrowly escaped kidnapping in the same incident. There have been no reports of U.S. citizens in Mindanao targeted specifically for their nationality; however, general threats to U.S. citizens and other foreigners throughout Mindanao remain a concern.\nAlthough U.S. government officials in the Philippines travel to Mindanao for official business without incident, the Embassy has imposed a strict restriction on all but the most essential travel to the area, and Embassy employees must receive special authorization from Embassy security officials to travel to any location in Mindanao and the Sulu archipelago.\nWe strongly recommend that U.S. citizens traveling to or residing in the Philippines enroll in the Department of State’s Smart Traveler Enrollment Program (STEP). STEP enrollment gives you the latest security updates, and makes it easier for the nearest U.S. embassy or consulate to contact you in an emergency. If you don’t have Internet access, enroll directly with the nearest U.S. embassy or consulate.\nRegularly monitor the State Department's website, where you can find current Travel Warnings, Travel Alerts, and the Worldwide Caution. Read the Country Specific Information for the Philippines. For additional information, refer to the Traveler's Checklist on the State Department’s website.\nContact the U.S. embassy or consulate for up-to-date information on travel restrictions. You can also call 1-888-407-4747 toll-free in the United States and Canada or 1-202-501-4444 from other countries. These numbers are available from 8:00 a.m. to 8:00 p.m. Eastern Time, Monday through Friday (except U.S. federal holidays). Follow us on Twitter and Facebook to have travel information at your fingertips.\nThe U.S. Embassy is located at: 1201 Roxas Boulevard, Manila, Philippines, tel. 63-2-301-2000. The American Citizens Services (ACS) section's fax number is 63-2-301-2017, and you may reach the ACS Section by email at ACSinfoManila@state.gov. The ACS Section's website includes consular information and the most recent messages to the U.S. citizen community in the Philippines.",
      "colorClass": "alert-warning",
      "source": "US State Department",
      "textOverview": "The Department of State warns U.S. citizens of the risks of travel to the Philippines, in particular to the Sulu Archipelago, certain regions and cities of the island of Mindanao, and the southern Sulu Sea area."
    }
  ],
  "HN": [
    {
      "type": "Warning",
      "startDate": "2015-10-30T04:00:00.000Z",
      "link": "http://travel.state.gov/content/passports/en/alertswarnings/honduras-travel-warning.html",
      "text": "The Department of State continues to warn U.S. citizens that the level of crime and violence in Honduras remains critically high, although it has declined in the past two years. This Travel Warning supersedes the Travel Warning dated March 2015 and includes additional information on crime and security in Honduras.\n\r\n\r\n\n\r\n\r\n\r\n\r\nCrime and violence are serious problems throughout the country.  The Government of Honduras lacks sufficient resources to properly respond to, investigate, and prosecute cases.  As a result, criminals operate with a high degree of impunity throughout Honduras.  \nSince 2010, Honduras has had one of the highest murder rates in the world, and the U.S. Embassy has recorded 42 murders of U.S. citizens during the same time period, with 10 recorded since January 2014.  However, official statistics from the Honduran Observatory on National Violence show Honduras’ homicide rate has decreased to 66 per 100,000 in 2014, down from its peak of 86.5 per 100,000 in 2011, and mid-year estimates in July 2015 predict a lower rate for 2015. \nU.S. citizens are victims of crime at levels similar to those of the local population and do not appear to be targeted based on their nationality.  The Government of Honduras added additional police in areas frequented by tourists, such as the Copan Mayan ruins and Roatan.  The Honduran Government is implementing similar programs for other locations, including La Ceiba and Trujillo, and major hotels and other tourist installations have private and police security. \nTourists traveling with group tours report fewer criminal incidents.  Honduran law enforcement reports frequent highway assaults and carjackings, including remote areas of Choluteca, Olancho, Colon and Copan Departments.  Reporting indicates that these assaults are frequently executed by criminals posing as Honduran law enforcement.  This criminal activity occurs frequently enough to present security challenges for anyone traveling in remote areas. \nKidnappings and extortion are common in Honduras.  Since January 2012, four cases of kidnapped U.S. citizens were reported to the U.S. Embassy and the kidnapping victims were all subsequently released after paying ransoms.  As families of kidnapping victims often pay ransoms without reporting these crimes to police out of fear of retribution, kidnapping figures may be underreported.\nTransnational criminal organizations conduct narcotics trafficking and other unlawful activities throughout the country and use violence to control drug trafficking routes and carry out criminal activity.  Other criminals, acting both individually and in gangs in Tegucigalpa, San Pedro Sula, and other large cities, are known to commit crimes such as murder, kidnapping, extortion, carjacking, armed robbery, rape, and other aggravated assaults.\nSexual assault is a concern in Honduras.  Most Honduran local police and medical staff do not have the capacity to properly handle evidence collection and medical care of sexual assault cases.\nRoatan & Bay Islands\nRoatan and the Bay Islands experience lower crime rates than the Honduras mainland.  The national government of Honduras, Roatan authorities, and businesses took measures in 2014 to improve tourism security.  As on the mainland, thefts, break-ins, assaults, rapes, and murders do occur, and rates are still high by international standards.  You should exercise caution, especially at night.  If staying at a hotel resort, book tours and sightseeing through the resort or reputable tour companies.  Coxen Hole on the island of Roatan should be avoided after dark. \nIf you are traveling on a cruise ship, you should take safety precautions, avoid unfamiliar areas, and take care to book only with reputable tour companies during your stopover in Honduras.  Cruise lines and port agencies work with approved tour companies to offer packages.  The port agencies at Mahogany Bay and Towne Center have worked to improve taxi service to and from the ports.  The vast majority of cruise line passengers in Honduras experience no problems, but incidents of armed robbery and carjacking have been reported.\nPrecautions While in Honduras\nBe vigilant of your surroundings at all times and in all locations, especially when entering or exiting your home/hotel, car, garage, school, and workplace.  Whenever possible, travel in groups of two or more.  Avoid wearing jewelry, carrying large sums of money, or displaying cash, ATM/credit cards, or other valuables.  Avoid walking at night in most areas of Honduras or walking alone on beaches, in historic ruins, and on trails.  Several U.S. citizens have reported being robbed while walking on isolated beaches.  Motorists should avoid traveling between cities at night and always drive with the doors locked and windows up to deter potential robberies at traffic lights and on congested downtown streets.  Arriving U.S. citizens are strongly urged to exercise caution in discussing travel plans in public since criminals may conduct crimes based on tips from sources at airport arrival areas. \nThe location and timing of criminal activity is unpredictable in Honduras.  All travelers should exercise caution when traveling anywhere in the country; however, certain areas of the country demonstrate higher levels of criminal activity than others.  Most of Honduras’ major cities (Tegucigalpa, San Pedro Sula, La Ceiba, and others), as well as several Honduran “departments” (a geographic designation similar to U.S. states) have homicide rates higher than the national average for 2014, including:\nDEPARTMENT                      CAPITAL\nAtlántida                               La Ceiba\nColón                                   Trujillo\nCortés                                  San Pedro Sula\nFrancisco Morazan                  Tegucigalpa\nYoro                                     Yoro\nTravelers to the department of Gracias a Dios should note that it is a remote location where narcotics trafficking is frequent, infrastructure is weak, government services are limited, and police or military presence is scarce.  The U.S. Embassy has restricted U.S. government personnel travel to Gracias a Dios due to credible threat information against U.S citizens by criminal and drug trafficking organizations.  U.S. citizens traveling to Gracias a Dios should consider postponing their travel.  Those who choose to travel or currently reside in Gracias a Dios should remain alert to local conditions and for signs of danger, be extra cautious, maintain a high level of vigilance, and take appropriate steps to enhance personal security.\nGetting Informed before Traveling\nFor more detailed information regarding personal security, please see the State Department's Country Specific Information for Honduras. For the latest security information, U.S. citizens traveling abroad should regularly monitor the Bureau of Consular Affairs’ web site for the latest Worldwide Caution, Travel Warnings, and Travel Alerts.\nThe Embassy strongly encourages U.S. citizens living or traveling in Honduras to sign up for the State Department's Smart Traveler Enrollment Program (STEP) to obtain updated information on travel and security within Honduras.  Travelers may obtain up-to-date information on security conditions by calling 1-888-407-4747 toll-free in the United States or outside the United States and Canada on a regular toll line at 1-202-501-4444.  Stay up to date by bookmarking the Bureau of Consular Affairs’ web site, which contains Travel Warnings and Travel Alerts, as well as the Worldwide Caution.\nContact Information\nIf you or someone you know becomes the victim of a crime in Honduras, you should contact the local police and the U.S. Embassy in Tegucigalpa.  If you are in the two major cities of Tegucigalpa or San Pedro Sula, you can reach the local police by dialing 911; other smaller cities or rural areas have their own local police assistance numbers.\nThe U.S. Embassy is located on Avenida La Paz in Tegucigalpa and can be reached at:\nTelephone:      (504) 2236-9320/2238-5114\nFax:               (504) 2236-9037\nAfter Hours:    (504) 2236-8497\nWebsite:         http://honduras.usembassy.gov\nThe Embassy's American Citizens Services Unit is open to walk-in services Monday through Friday from 8:00 to 11:30 am and can be reached directly at:\nTelephone:       (504) 2238-5114 ext. 4400\nAfter Hours:      (504) 2238-5114/2236-9320 ext.4100\nFax:                 (504) 2238-4357\nEmail:              usahonduras@state.gov\nFacebook:         www.facebook.com/acstegucigalpa\nThe U.S. Consular Agency in San Pedro Sula is located on the eleventh floor of the Banco Atlantida building (across from Central Park).   The agency is open to walk-in services on Monday, Wednesday and Friday from 12:00 to 4:00 pm and can be reached at telephone: (504) 2558-1580.",
      "colorClass": "alert-warning",
      "source": "US State Department",
      "textOverview": "The Department of State continues to warn U.S. citizens that the level of crime and violence in Honduras remains critically high, although it has declined in the past two years."
    }
  ],
  "LY": [
    {
      "type": "Warning",
      "startDate": "2015-09-16T04:00:00.000Z",
      "link": "http://travel.state.gov/content/passports/en/alertswarnings/libya-travel-warning.html",
      "text": "The Department of State warns U.S. citizens against all travel to Libya and recommends that U.S. citizens currently in Libya depart immediately. On July 26, 2014, the U.S. Embassy suspended all embassy operations in Libya and relocated staff outside of the country because of ongoing violence between Libyan militias in the immediate vicinity of the Embassy. The security situation in Libya remains unpredictable and unstable. If in Libya, make contingency emergency plans and maintain security awareness at all times. This Travel Warning supersedes the Travel Warning issued on January 20, 2015.\n\r\n\r\n\n\r\n\r\n\r\n\r\nPlease direct inquiries regarding U.S. citizens in Libya to LibyaEmergencyUSC@state.gov. Callers in the United States and Canada may dial the toll free number 1-888-407-4747. Callers outside the United States and Canada may dial 1-202-501-4444.\nRecent worldwide terrorism alerts, including the Department of State’s Worldwide Caution, have stated that extremist groups continue to plan terrorist attacks against U.S. interests in the Middle East region, including Libya.\nThe Libyan government has not been able to build its military and police forces and improve security following the 2011 revolution. Many military-grade weapons remain in the hands of private individuals, U.S. and UN-designated terrorists, and other armed groups, including antiaircraft weapons that may be used against civilian aviation. Crime levels remain high in many parts of the country. In addition to the threat of crime, the threat of kidnapping is high and various groups have called for attacks against U.S. citizens and U.S. interests in Libya.\nThe internationally recognized House of Representatives has relocated to Tobruk, and its government is based in Bayda. Government authorities lack control over much of the country. Tripoli and its environs are controlled by a coalition of militias known as Operation Dawn, and affiliated authorities calling themselves the “National Salvation Government.”\nClashes are ongoing throughout the country and attacks by armed groups can occur nationwide. Hotels frequented by westerners have been caught in the crossfire. Tripoli and other urban areas have witnessed fighting between armed groups and government forces as well as terrorist attacks. Checkpoints controlled by militias are common outside of Tripoli, as well as inside the capital at times. Most international airports are closed, and flights out of operational airports are sporadic and may be cancelled without warning. The United States is very concerned about the targeting of commercial transportation in Libya. The U.S. government prohibits U.S. commercial aviation operations within Libyan airspace.\nAlong with airports, seaports and roads can close with little or no warning. The escalation of violence in Libya against civilian commercial interests raises serious concerns about the safety of maritime vessels and their crew. U.S. mariners are advised to exercise extreme caution while transiting in or near Libyan territorial waters. The Libyan National Army announced on January 7, 2015 that all vessels in Libyan waters require army approval for transit, following the January 4, 2015 bombing of a Greek-operated oil tanker that killed two crewmen near Derna, Libya. Vessels are advised to proceed with extreme caution when approaching all Libyan oil terminals and ports and are encouraged to adhere to the recommendations in the U.S. Coast Guard’s Port Security Advisory 1-14 issued April 1, 2014. Mariners planning travel to Libya should check the U.S. Coast Guard Homeport Website for any Port Security Advisory Updates and the NGA Broadcast Warnings Website (select “Broadcast Warnings”) for any special warnings or Maritime Administration Advisories before arrival.\nViolent extremist activity in Libya remains high, and violent extremist groups in Libya have made several specific threats against U.S. government officials, citizens, and interests in Libya. On January 27, 2015, the Corinthia hotel in Tripoli was attacked by a group affiliated with ISIL claiming responsibility, resulting in the death of nine individuals including five foreigners, one of whom was a U.S. citizen. Because of the presumption that foreigners, especially U.S. citizens, in Libya may be associated with the U.S. government or U.S. NGOs, travelers should be aware that they may be targeted by violent extremist groups seeking to injure, kidnap or kill U.S. citizens, and should act accordingly with extreme caution. Sporadic episodes of civil unrest have occurred throughout the country and attacks by armed militants can occur in many different areas; hotels frequented by westerners have been caught in the crossfire.\nVarious militias have supplanted the police in maintaining internal security. Militia members operate checkpoints within and between major cities. Libyan militia members are poorly trained and may be unaffiliated with the interim government, which has not yet reconstituted the national army and police. There are frequent reports of violent (and sometimes fatal) clashes between rival militias and occasional reports of vigilante revenge killings. Militia groups sometimes detain travelers for arbitrary or unclear reasons, without access to a lawyer or legal process, and without allowing detainees to inform others of their status. The State Department advises carrying proof of citizenship and valid immigration status at all times, but notes that these documents do not guarantee fair treatment. The State Department has extremely limited capacity to assist U.S. citizens who are detained by militia groups.\nU.S. citizens should avoid areas of demonstrations and exercise caution if in the vicinity of any large gatherings, protests, or demonstrations, as even demonstrations intended to be peaceful can turn confrontational and escalate into violence.\nIf travel in desert and border regions of Libya is critically necessary, exercise caution and comply with local regulations. Terrorist organizations, including ISIL affiliated groups and al-Qaeda in the Islamic Maghreb, continue to threaten the region. Recent terrorist attacks have occurred in the border region, where extremists have kidnapped Westerners. Please note the travel warnings and alerts for neighboring countries, Algeria, Tunisia, Chad, Niger, and Sudan.\nFor more information:\n\nSee the State Department's travel website for the Worldwide Caution, Travel Warnings, Travel Alerts, and  Specific Information for Libya.\nEnroll in the Smart Traveler Enrollment Program (STEP) to receive security messages and make it easier to locate you in an emergency.\nAs cell phone service is unreliable in Libya, emergency calls may also be placed through the Department of State at 1-888-407-4747 toll-free in the United States and Canada or 1-202-501-4444 from other countries.\nFollow us on Twitter and Facebook.",
      "colorClass": "alert-warning",
      "source": "US State Department",
      "textOverview": "The Department of State warns U.S. citizens against all travel to Libya and recommends that U.S. citizens currently in Libya depart immediately."
    }
  ],
  "CF": [
    {
      "type": "Warning",
      "startDate": "2015-09-30T04:00:00.000Z",
      "link": "http://travel.state.gov/content/passports/en/alertswarnings/central-african-republic-travel-warning.html",
      "text": "The Department of State warns U.S. citizens against all travel to the Central African Republic (CAR) due to an unpredictable security situation subject to rapid deterioration, activities of armed groups, and violent crime. The border between Chad and CAR is currently closed. Other land border crossings may close at short notice. U.S. citizens who have decided to stay in CAR despite this warning should seriously consider departing. Embassy Bangui cannot provide consular services to U.S. citizens in CAR at this time. This replaces the Travel Warning of May 1, 2015 to reflect the risk of remaining in CAR and continued lack of security.\n\r\n\r\n\n\r\n\r\n\r\n\r\nIndiscriminate violence and looting has occurred in CAR since the overthrow of the Government in March 2013. Sectarian violence is frequent and has resulted in thousands of deaths. Despite the creation of a transitional government in January 2014 and the presence of a United Nations stabilization force, the security situation remains highly fragile. Instability has increased as the political transition process unfolds around the upcoming constitutional referendum and elections which were initially scheduled for October 2015.\nFor further information:\n\nSee the State Department's travel website for the Worldwide Caution, Travel Warnings, Travel Alerts, and Country Specific Information for the Central African Republic.\nEnroll in the Smart Traveler Enrollment Program (STEP).\nU.S. citizens who decide to travel to or remain in the CAR despite this Travel Warning are urged to provide their current contact information and next-of-kin information through STEP.\nU.S. citizens in CAR in need of emergency assistance should contact the U.S. Embassy in Yaounde, Cameroon; Telephone: 237 2220-1500 ext. 4341/4023 (Monday through Friday, 9:00 a.m. – 12:00 p.m. local time) Emergencies: 237 2220-1500, ext. 4531 or 237 2222-25-89; E-mail: YaoundeACS@state.gov. For information about U.S. citizen services in CAR from the Office of Overseas Citizens Services in Washington, e-mail: CARemergencyUSC@state.gov.\nCall 1-888-407-4747 toll-free in the United States and Canada or 1-202-501-4444 from other countries from 8:00 a.m. to 8:00 p.m. Eastern Standard Time, Monday through Friday (except U.S. federal holidays).\nFollow us on Twitter and Facebook.",
      "colorClass": "alert-warning",
      "source": "US State Department",
      "textOverview": "The Department of State warns U.S. citizens against all travel to the Central African Republic (CAR) due to an unpredictable security situation subject to rapid deterioration, activities of armed groups, and violent crime."
    }
  ],
  "IL": [
    {
      "type": "Warning",
      "startDate": "2015-12-16T05:00:00.000Z",
      "link": "http://travel.state.gov/content/passports/en/alertswarnings/israel-travel-warning.html",
      "text": "The security environment remains complex in Israel, the West Bank, and Gaza.  U.S. citizens need to be aware of the continuing risks of travel to areas described in this Travel Warning where there are heightened tensions and security risks. The security situation can change day to day, depending on the political situation, recent events, and geographic area.  A rise in political tensions and violence in Jerusalem and the West Bank has resulted in injuries to and deaths of U.S. citizens.  The Government of Israel and the Palestinian Authority both make considerable efforts to police major tourist attractions and ensure security in areas where foreigners frequently travel.  Although these efforts to reduce the threat are not 100 percent effective, hundreds of thousands of U.S. citizens safely visit Israel and the West Bank each year for study, tourism, and business.  This replaces the Travel Warning issued February 18, 2015.  \n\r\n\r\n\n\r\n\r\n\r\n\r\nThe Department of State strongly warns U.S. citizens against travel to the Gaza Strip and urges those in Gaza to leave immediately when border crossings are open; U.S. government employees are not allowed to conduct official or personal travel to Gaza. \nU.S. citizens should consider the rules U.S. government employees must follow when planning their travel:\n\nWith the exception of Jericho and Bethlehem, U.S. government employees are prohibited from personal travel to the West Bank.  There are some restrictions on the personal travel of U.S. government employees to Bethlehem, listed in the section below on the West Bank;\nU.S. government employees are prohibited from using public and inter-city buses (and associated bus terminals) throughout Israel and the West Bank.  From mid-October until the end of November 2015, there was a temporary prohibition on using the Jerusalem light rail north of the City Hall stop on Jaffa Road; and\nU.S. government employees must obtain advance approval if they wish to travel to the following locations:\nwithin 7 miles of the Gaza demarcation line;\nwithin 1.5 miles of the Lebanon border;\nnorth and east of the Sea of Galilee;\non or east of Route 98 in the Golan; and\nsouth of Be’er Sheva.\n\n\n\nThe U.S. Embassy in Tel Aviv and U.S. Consulate General in Jerusalem are continuously monitoring the security situation.  As conditions change, they can make adjustments, as necessary, to these travel restrictions on U.S. government employees.  Please review the security messages at the U.S. Embassy in Tel Aviv and the U.S. Consulate General in Jerusalem for the most current information.  \nMajor Metropolitan Areas\nPersonal safety conditions in major metropolitan areas, including Tel Aviv and Haifa and surrounding regions, are comparable to other major global cities. Nonetheless, political and religious tension associated, in part, with access to the Haram al-Sharif/Temple Mount in the Old City of Jerusalem has led to increased levels of violence, particularly in Jerusalem and the West Bank, not seen in those areas in a decade.  Since October 2015, attacks on individuals and groups have occurred with increased frequency in East and West Jerusalem, Hebron, and Bethlehem, as well as various other places in the West Bank and Israel, including Tel Aviv.  There is no indication that U.S. citizens have been specifically targeted based on their nationality, although perceived religious affiliation may have been a factor in some violent attacks on U.S. citizens.  More than 12 U.S. citizens have been among those killed and injured in multiple attacks in 2014 and 2015.  U.S. citizens involved in or observing demonstrations have sustained serious injuries.  Therefore, the Department of State recommends U.S. citizens avoid all demonstrations for their own safety.\nThe Department of State also recommends that U.S. citizens maintain a high state of situational awareness, be aware of their surroundings at all times, avoid any unattended items or packages, and report any unusual or suspicious activities or items to police or other security officials.  See below for specific safety and security information regarding Gaza, the West Bank, Jerusalem, and Israel’s northern region.\nTravelers should be aware of the potential for military conflict between Israel and foreign terrorist organizations like Hamas.  Such attacks can occur with little or no warning.  During the conflict in Gaza in July and August 2014, long-range rockets launched from Gaza reached many locations in Israel and the West Bank – including Tel Aviv, Jerusalem, and cities in northern and southern Israel.  The Government of Israel’s Iron Dome rocket and missile defense system successfully intercepted many rockets.  However, rocket and mortar impacts also caused four deaths of Israeli citizens living near Gaza, as well as injuries and property damage.  There have been additional small arms fire and mortar and rocket launches from Gaza into southern Israel on several occasions between September and December 2014 and again between May and November 2015 that resulted in limited property damage.\nVisitors to and residents of Israel and the West Bank should familiarize themselves with the location of the nearest bomb shelter or other hardened site.  We advise all U.S. citizens to take note of guidance on proper procedures in the event of rocket attacks or other crisis events by visiting the website of the government of Israel's Home Front Command.  Consult municipality websites, such as those for Jerusalem, for locations of public bomb shelters and other emergency preparedness information.  Visitors should seek information on shelters from hotel staff or building managers. \nTravelers should also be aware of the heightened state of alert maintained by Israeli authorities along Israel's border with Egypt.  There have been cross-border incidents from Egypt, including rocket attacks and ground incursions, Rockets and mortars were launched from Sinai, Egypt in the direction of Eilat and Israel’s Negev region in January, July, and August 2014, and July 2015.   \nJerusalem \nU.S. citizens visiting and living in Jerusalem should be aware of the numerous political, cultural, and religious tensions that permeate the city.  These sensitivities have the potential to fuel rallies, protests, civil unrest, acts of terrorism, and retaliatory attacks against groups and individuals. \nDemonstrations are a regular occurrence throughout Jerusalem.  Even peaceful demonstrations can turn violent with little or no advance warning.  Since October 2015, there have been frequent clashes between protesters and Israeli authorities, checkpoints and barriers have been set up by Israeli security forces that restrict movement of residents, and acts of terrorism have taken place, resulting in death and injury, including to U.S. citizens.  Travelers should be aware that protests and violence have occurred across Jerusalem, including in some West Jerusalem neighborhoods, and in East Jerusalem neighborhoods such as Sheikh Jarrah, Shufat, Beit Hanina, Mt. of Olives, As Suwaneh, Silwan, Shuafat Refugee Camp, Issawiyeh, Tsur Baher, and within the Old City.  Skirmishes, violent clashes and demonstrations also have occurred in the northern parts of Jerusalem near the Qalandia Checkpoint, and Checkpoint 300 located in the southern part of Jerusalem near Bethlehem. \nFrom mid-October until the end of November 2015, U.S. government employees were temporarily prohibited for security reasons from using the Jerusalem Light Rail north of the City Hall stop along Jaffa Road.  Travel to the Old City is also periodically restricted for U.S. government employees, including on Fridays during Ramadan. The Department of State advises U.S. citizens to exercise caution in and around the Damascus, Lions’, and Herod's gates to the Old City as these locations have been the scene of past attacks. \nThe number of violent incidents resulting in the death of bystanders remains high.  The frequency of such incidents often increases following Haram al-Sharif/Temple Mount access restrictions, in response to random attacks, or during Israel National Police (INP) operations in predominantly Palestinian neighborhoods.  The INP often deploys a heavy presence in many of the neighborhoods that have seen clashes and may restrict pedestrian and vehicular traffic to some of these neighborhoods without notice.  U.S. citizens are advised not to enter any neighborhoods restricted by the INP and to avoid any locations with active demonstrations, clashes, or a heavy police presence.\nThe clashes and violence have not been anti-American in nature.  However, politically-motivated violence in Jerusalem claimed the lives of U.S. citizens who were inside a synagogue in November 2014 and a U.S. citizen who was riding a bus in October 2015.  Other U.S. citizens have been injured in such attacks.  In July 2015, an attack on participants at the Jerusalem gay pride march resulted in the death of one person and injuries to several others, including a U.S. citizen. \nTravelers are reminded to exercise caution at Islamic religious sites on Fridays and on holy days, particularly during the holy month of Ramadan.  The INP often imposes restrictions on visitors to the Old City’s Haram al-Sharif/Temple Mount, and has closed access for temporary periods without advance notice.  Many orthodox Jewish communities in and around Jerusalem restrict vehicle traffic on Shabbat, and entering these neighborhoods with a vehicle may result in protests and violence.   \nNorthern Israel and Golan Heights\nRocket attacks and small arms fire into Israel from Lebanon have occurred without warning along the Israeli-Lebanese border.  Heightened tensions persist along portions of the Disengagement Zone with Syria in the Golan Heights as a result of Syria’s internal conflict.  There have been several incidents of rockets, mortar shells, and light arms fire landing on the Israeli-controlled side of the zone as a result of spillover from the fighting in Syria.  Travelers should be aware that cross-border gunfire can occur without warning.  Furthermore, there are active land mines in areas of the Golan Heights, so visitors should walk only on established roads or trails. \nThe West Bank\nThe Department of State urges U.S. citizens to exercise caution when traveling to the West Bank due to the complex security situation there.  Increasingly frequent and violent clashes between Israeli security forces, Israeli settlers and Palestinian residents of the West Bank have resulted in the death and injury to U.S. citizens and others. \nU.S. citizens considering travel to the West Bank should take into consideration the danger of death, injury or kidnapping of U.S. citizen residents and visitors in the West Bank evident from incidents in 2014 and 2015.  On October 1, 2015, a U.S. citizen man and his Israeli wife were shot and killed on the road between Alon Moreh and Itamar, near Nablus.  In November 2015, a U.S. citizen studying in Israel was one of three people killed by a gunman who fired shots into their vehicle in Gush Etzion, and another was injured by a gunshot near the Cave of the Patriarchs/Ibrahimi Mosque.  In September 2015 five U.S. citizens were attacked and their car destroyed in Hebron. \nDemonstrations and violent incidents can occur without warning, and vehicles are sometimes damaged by rocks, Molotov cocktails, and gunfire on West Bank roads.  U.S citizens have been injured or killed in such attacks in the past.  There have also been an increasing number of violent incidents involving Israeli settlers and Palestinian villagers in the corridor stretching from Ramallah to Nablus, including attacks by Israeli settlers on Palestinian villages and attacks by Palestinians on settlements.  U.S. citizens can be caught in the middle of potentially dangerous situations, and some U.S. citizens involved in political demonstrations in the West Bank have sustained serious injuries.  During periods of unrest, the Israeli government may restrict access to and within the West Bank, and some areas may be placed under curfew.  All persons in areas under curfew should remain indoors to avoid arrest or injury.  Security conditions in the West Bank may hinder the ability of U.S. government officials to offer timely assistance to U.S. citizens. \nPersonal travel in the West Bank by U.S. government personnel is permitted to the towns of Jericho and Bethlehem, and on Routes 1, 443, and 90.  U.S. government employees traveling to Bethlehem must comply with the following additional security requirements:  The Rachel’s Tomb/Gilo crossing and areas adjacent to the Ayda and Al Azza refugee camps are restricted; and travel in Bethlehem must be completed between 8:00 am and 8:00 pm.  These restrictions change periodically based on the current security environment. Please review the security messages at the U.S. Embassy in Tel Aviv and the U.S. Consulate General in Jerusalem for current information.  The Rachel’s Tomb checkpoint between Jerusalem and Bethlehem has seen an increase in public demonstrations, which have the potential to become violent.  U.S. government employees may also engage in personal travel to Qumran off Route 90 by the Dead Sea and to the Allenby Bridge crossing to Jordan, as well as stops at roadside facilities along Routes 1 and 90.  All other personal travel by U.S. government personnel in the West Bank is prohibited.  U.S. government personnel routinely travel to the West Bank for official business, but do so with special security arrangements.\nThe Gaza Strip\nThe Department of State strongly urges U.S. citizens to avoid all travel to the Gaza Strip, which is under the control of Hamas, a foreign terrorist organization.  U.S. citizens in Gaza are advised to depart immediately when border crossings are opened; U.S. citizens who choose to travel to Gaza should not rely on the U.S. government to assist them in departing Gaza.  U.S. citizen employees of the U.S. government are not allowed to travel to Gaza, in either personal or professional capacities.  U.S. government travel in Israel within seven miles of the Gaza demarcation requires special security arrangements.  The security environment within Gaza, including its border with Egypt and its seacoast, is dangerous and volatile.  Exchanges of gunfire between the Israel Defense Forces and militant groups in Gaza take place intermittently, and civilians have been caught in the crossfire in the past.\nSince October 2014, Egyptian authorities have closed the Rafah crossing between Gaza and Egypt for extended periods, sometimes with little notice.  When operating, the Rafah crossing normally allows for some passenger travel; however, prior coordination with local authorities - which could take days or weeks to process - may be required and crossing points may be closed for days or weeks.  Travelers who enter the Gaza Strip through the Rafah crossing must also exit through the Rafah crossing, and those entering the Gaza Strip may not be able to depart at a time of their choosing.  Many U.S. citizens have been unable to exit Gaza or faced lengthy delays while attempting to exit Gaza.  Furthermore, the schedule and requirements for exiting through the Rafah crossing are unpredictable and can involve significant expense.\nThe ability of U.S. government personnel to offer timely assistance to U.S. citizens, including assistance departing Gaza, is extremely limited.  The Consulate General and Embassy are often unable to assist U.S. citizens to exit Gaza via the Erez crossing to Israel.\nEntry/Exit Difficulties\nU.S. citizens planning to travel to Israel, the West Bank, or Gaza should consult the detailed information concerning entry and exit difficulties in the Country Specific Information. \nIndividuals registered in the Palestinian Authority population registry, who Israeli authorities believe may have a claim to a Palestinian ID, are denied entry into Israel or Jerusalem, regardless of other nationality or place of residence.  These individuals seeking to visit the West Bank are required to enter from Jordan through the Allenby/King Hussein Bridge. \nSome U.S. citizens of Arab or Muslim heritage not on the Palestinian Population Registry or otherwise prohibited from entering Israel have experienced significant difficulties and unequal and hostile treatment at Israel’s borders and checkpoints.  U.S. citizens of Arab or Muslim origin visiting the West Bank, including those not on the Palestinian Population Registry, have experienced restrictions by Israeli authorities from visiting Jerusalem or Israel. \nDual U.S.-Israeli citizens of military age who have not completed Israeli military service may be prohibited from departing Israel until service is completed or may be subject to criminal penalties for failure to serve.\nFor More Information \nContact the Consular Section of the U.S. Embassy for information and assistance in Israel, the Golan Heights, and ports of entry at Ben Gurion Airport, Haifa Port, the northern (Jordan River/Sheikh Hussein) and southern (Arava) border crossings connecting Israel and Jordan, and the border crossings between Israel and Egypt.  An embassy officer can be contacted in an emergency at (972) (3) 519-7575.\nContact the Consular Section of the U.S. Consulate General in Jerusalem for information and assistance in Jerusalem, the West Bank, the Gaza Strip, and the Allenby/King Hussein Bridge crossing between the West Bank and Jordan, at (972) (2) 630-4000 from Monday through Friday during working hours.  The after-hours emergency number is (972) (2) 622-7250. \nEnroll in the Department of State’s Smart Traveler Enrollment Program (STEP) in order to obtain the most current information on travel and security within Israel, the West Bank and Gaza.  Enrollment in STEP makes it easier for the Embassy or Consulate General to contact U.S. citizens in case of emergency.  \nMonitor the Department of State’s Internet website where the Worldwide Caution, Country Specific Information for Israel, the West Bank and Gaza, Travel Warnings, and Travel Alerts can be found, including the current Travel Warning for Israel, the West Bank and Gaza. \nFollow the Bureau of Consular Affairs on Twitter and on Facebook.  Up-to-date information on security conditions can also be accessed at http://israel.usembassy.gov, http://jerusalem.usconsulate.gov or on the Embassy and Consulate General Facebook pages. \nUp-to-date information on travel and security in Israel, the West Bank and Gaza also can be obtained by calling 1-888-407-4747 toll-free in the United States and Canada, or, for callers outside of the United States and Canada, on a regular toll-line at 1-202-501-4444.  These numbers are available from 8:00 a.m. to 8:00 p.m. Eastern Time, Monday through Friday (except U.S. federal holidays).",
      "colorClass": "alert-warning",
      "source": "US State Department",
      "textOverview": "The security environment remains complex in Israel, the West Bank, and Gaza.  U.S. citizens need to be aware of the continuing risks of travel to areas described in this Travel Warning where there are heightened tensions and security risks."
    }
  ],
  "KE": [
    {
      "type": "Warning",
      "startDate": "2015-11-10T05:00:00.000Z",
      "link": "http://travel.state.gov/content/passports/en/alertswarnings/kenya-travel-warning.html",
      "text": "The U.S. Department of State warns U.S. citizens of the risk of traveling to Kenya.   U.S. citizens in Kenya, and those considering travel to Kenya, should be aware of continuing and recently heightened threats from terrorism and the high rate of violent crime in some areas.  This replaces the Travel Warning of May 13, 2015, to update information regarding the change of travel restrictions for United States government personnel within the country. \n\n\r\n\r\n\n\r\n\r\n\r\n\r\nAlthough thousands of U.S. citizens visit Kenya each year without incident, caution and keen awareness of one’s personal security situation is vitally important.  The U.S. government continues to receive information about potential terrorist threats aimed at U.S., Western, and Kenyan interests in Kenya, including within the Nairobi area, along the coast, and within the northeastern region of the country.  Terrorist acts can include suicide operations, bombings – to include car bombings - kidnappings, attacks on civil aviation, and attacks on maritime vessels in or near Kenyan ports.  Travelers should consult the Worldwide Caution webpage for further information and details.\nAl-Qaeda and its affiliate, Al-Shabaab, have attacked targets in Kenya for years.  Since late 2013, there have been numerous attacks involving shootings, grenades, or other explosive devices in Kenya, killing hundreds and causing injury to hundreds more within the Nairobi area, along the coast, and in the northeastern region of the country.  Most of these attacks occurred in northeastern Kenya, mainly in Wajir, Garissa, and Mandera counties.  The most deadly of these took place on April 2 at the Garissa University College, where al-Shabaab terrorists killed almost 150 people, primarily students, and wounded many others.  Al-Shabaab targets have included government sites, such as police stations and police vehicles, and soft targets including public transportation, nightclubs and bars, religious institutions, universities, and shopping areas.\nGrenade and improvised explosive device attacks have occurred in Nairobi, including the January 2014 attack at a restaurant in the Jomo Kenyatta International Airport.  In 2014 and 2015, the Mombasa area had at least eight such attacks.  Two occurred in May 2014, one of which targeted a local resort frequented by Westerners.\nIn September 2013, al-Shabaab attacked the Westgate Shopping Mall in Nairobi, killing at least 67 people, both Kenyan and non-Kenyan nationals, and wounding approximately 200 hundred others, including five U.S. citizens. \nKenyan security services have disrupted several other terrorist plots throughout the country, which may have prevented additional deaths and injury from terrorist attacks.  Although the pursuit of those responsible for previous terrorist activities continues, some of those involved remain at large and still operate in the region.\nEthnic clashes sometimes occur in various parts of Kenya, primarily in the rural areas of the country.  These clashes are often fueled by disagreements over land or ownership of cattle.  While this violence is not directed at foreigners, ethnic clashes and protests are unpredictable and may affect non-Kenyans.  U.S. citizens are advised to check conditions and monitor local media reports before traveling to these areas.\nKidnappings of Westerners have occurred in Kenya in the past.  In April 2014, gunmen ambushed a convoy vehicle and attempted to kidnap an international humanitarian staff member at the Dadaab refugee complex.  While the kidnapping attempt was unsuccessful, one Kenyan staff member was injured in the attack.\nAs part of a wide-ranging security operation that began in 2014, refugees, primarily Somalis, in Nairobi and other cities were ordered to report to established refugee camps.  U.S. citizens of Somali descent should be aware that they may encounter interruptions in their travel due to increased police scrutiny based on the encampment policy.  It is very important to carry at all times proof of identity and legal status in Kenya (i.e., valid visa).  If you are detained by police or immigration officials, you should request to speak to someone from the Consular Section of the U.S. Embassy in Nairobi.\nThe U.S. Embassy has lifted travel restrictions for U.S. government personnel to certain locations along the coast that were imposed in June 2014.  Travel is now permitted to Malindi city in Kilifi County south through Mombasa and Kwale counties to the Tanzanian border.  U.S. government personnel, however, are prohibited from using the Likoni ferry in Mombasa and visits to the Old Town in Mombasa are restricted to daylight hours only.  Travel restrictions to the following areas remain in place:  the Nairobi neighborhood of Eastleigh; the area of Kilifi County from Malindi north; the coastal counties of Tana River and Lamu; and northeastern Kenya, including the cities of El Wak, Wajir, Garissa, Mandera, and Liboi.  Travel to these restricted areas by any U.S. Embassy personnel must be pre-approved by appropriate Embassy offices.  U.S. citizens in Kenya should always remain vigilant and be aware of their own personal security, and take appropriate precautions for travel in and to any location within the country.\nAlthough these restrictions do not apply to travelers not associated with the U.S. government, U.S. citizens in Kenya should take these restrictions into account when planning travel.  The Embassy regularly reviews the security of these areas for possible modification.  Travelers should keep informed of local developments by following local press, radio, and television reports prior to their visits.  Visitors should also consult their hosts, including U.S. and Kenyan business contacts, hotels, tour guides, and travel organizers.\nThe Embassy continues to consider carefully all U.S. government-sponsored regional conferences and trainings in Nairobi and the number of temporary duty personnel coming to the country for official purposes.  In addition, the Embassy relocated some staff to other countries in June and July of 2014 due to the security situation.  As of July 2014, the Peace Corps suspended its volunteer activities in Kenya and all Peace Corps Volunteers in Kenya departed the country due to the security situation. \nViolent and sometimes fatal criminal attacks, including armed carjackings, grenade attacks, home invasions and burglaries, and kidnappings can occur at any time and in any location, particularly in Nairobi.  U.S. citizens, including U.S. Embassy employees, have been victims of such crimes within the past year.\nU.S. citizens in Kenya should be extremely vigilant with regard to their personal security, particularly in crowded public places such as clubs, hotels, resorts, shopping centers, restaurants, bus stations, and places of worship.  U.S. citizens should also remain alert in residential areas, at schools, and at outdoor recreational events.  U.S. citizens should use commonsense precautions at all times, to include the following practices: avoid crowded transportation venues; visit only legitimate businesses and tourist areas only during daylight hours; use well-marked taxis and be sure to lock vehicle doors and keep windows up; lock all lodging doors and windows; carry minimal amounts of cash and credit cards; do not wear jewelry which attracts undue attention; know emergency phone numbers; do not resist or antagonize armed criminals; and always be aware of your surroundings.  These measures can help prevent a “wrong place, wrong time” scenario in the event of an attack as well as ensuring that your travel to Kenya is safe and enjoyable.\nFor further information:\n\nSee the State Department's travel website for the Worldwide Caution, Travel Warnings, Travel Alerts, and Kenya.\nEnroll in the Smart Traveler Enrollment Program (STEP) to receive security messages and make it easier to locate you in an emergency.\nContact the U.S. Embassy in Nairobi located on United Nations Avenue, Gigiri, Nairobi, at  telephone (+254) (20) 363-6000, 7:15 a.m. to 4:30 p.m. Monday through Thursday and 7:15 a.m. to 12:15 p.m. on Friday.  In the event of an after-hours emergency, contact the Embassy duty officer at (+254) (20) 363-6000. \nCall 1-888-407-4747 toll-free in the United States and Canada or 1-202-501-4444 from other countries from 8:00 a.m. to 8:00 p.m. Eastern Standard Time, Monday through Friday (except U.S. federal holidays).",
      "colorClass": "alert-warning",
      "source": "US State Department",
      "textOverview": "The U.S. Department of State warns U.S. citizens of the risk of traveling to Kenya."
    }
  ],
  "ER": [
    {
      "type": "Warning",
      "startDate": "2015-05-06T04:00:00.000Z",
      "link": "http://travel.state.gov/content/passports/en/alertswarnings/eritrea-travel-warning.html",
      "text": "The U.S. Department of State continues to warn U.S. citizens of the risks of travel to Eritrea.   The Government of Eritrea continues to restrict the travel of all foreign nationals, including U.S. diplomats posted in Asmara.  Consequently, the U.S. Embassy cannot guarantee its ability to provide emergency consular assistance outside of Asmara.  In addition, contrary to its obligations under the Vienna Convention, the Government of Eritrea does not notify the U.S. Embassy when a U.S. citizen is detained or arrested.  U.S. citizens of Eritrean ethnicity are often subject to the same laws and obligations as Eritrean nationals, particularly those who enter the country using their Eritrean identity card in lieu of a U.S. passport with an Eritrean visa.  This Travel Warning replaces the Travel Warning for Eritrea dated September 12, 2014.\n\r\n\r\n\n\r\n\r\n\r\n\r\nThe Eritrean government continues to restrict the travel of all foreign nationals.  These restrictions require all visitors and residents, including U.S. diplomats, to apply 10 days in advance for permission to travel beyond 25 kilometers (15 miles) of Asmara’s city limits.  While permission is often granted for popular tourist destinations such as Massawa and Keren, requests to travel near the border areas, particularly with Ethiopia and Djibouti, are regularly denied.  Requests by U.S. diplomats to travel to areas outside of Asmara are also routinely turned down, thus impairing the ability of consular officers to provide emergency services to U.S. citizens in areas outside Asmara. \nTravelers should be aware that travel permits are valid for the approved final destination only, and do not allow for stops along the way to or in the proximity of the approved destination.  In addition, travel to religious institutions, such as monasteries, requires separate travel permissions even when such facilities are located in or near approved destination cities.  Foreign travelers not adhering strictly to the terms of travel permits have reported being detained by law enforcement authorities.\nU.S. citizens are strongly advised to avoid travel near the Eritrean-Ethiopian border and the Southern Red Sea Region because of the presence of large numbers of Eritrean and Ethiopian troops along the contested border area, and because of the military tensions between the two countries.  U.S. citizens should also avoid travel to the contested Eritrea-Djibouti border region, where troops from Qatar patrol this area and tensions remain high.\nLandmines and unexploded ordnance remain a serious problem in parts of the country.  Some areas still have not been certified free of mines and unexploded ordnance following the 30-year war of independence and the subsequent 1998-2000 border conflict with Ethiopia.  Visitors should avoid walking alone and hiking in riverbeds or areas that local government officials have not certified as safe.\nEritrea has complicated citizenship laws and does not recognize renunciation of Eritrean citizenship.  U.S. citizens born in Eritrea to Eritrean parents or who in other ways may have Eritrean origins are required by the Government of Eritrea to register with the Immigration and Nationality Office in Asmara within seven business days of their entry into the country.  The Eritrean government sometimes subjects U.S. citizens of Eritrean ethnicity to the same entry/exit requirements as Eritrean citizens, including obtaining an exit permit.  Dual nationals, who enter the country on Eritrean travel documents, including a national ID, are treated as Eritrean citizens, regardless of their dual citizenship status and may be subject to additional obligations.  Dual nationals may not be able to obtain Eritrean civil documents, such as birth and death certificates, marriage and divorce documents, educational transcripts, or property ownership records, without proof of payment of the two percent government diaspora tax.\nU.S. citizens choosing to travel to Eritrea despite this Travel Warning must obtain an Eritrean visa before their arrival.  Persons arriving in Eritrea without a visa are generally refused admission and returned to their point of origin on the next flight unless prior arrangements were made for an airport visa. \nIn connection with the May 24 Independence Day holiday, travelers will notice an increase in the presence of military and police personnel throughout Asmara during the months of April and May.  It is during these two months that military and police personnel most frequently check documentation. \nAlthough there have been no specific incidents of violence targeting U.S. citizens, U.S. citizens are urged to exercise caution, stay current with media coverage of local events, and be aware of their surroundings at all times. \nPiracy on the Red Sea continues to occur and recreational vessels are strongly encouraged to avoid the region.  Commercial vessels without explicit agreements with Eritrean authorities are urged to avoid Eritrean territorial waters.  The Eritrean government has, as recently as December 2013, seized ships which do not hold such agreement.  These seizures have resulted in lengthy detentions of international crew members, including U.S. nationals.  U.S. citizens are cautioned that commercial/tourist ships are not allowed to dock at some Eritrean ports, even to refuel.  The Eritrean government has not granted the U.S. Coast Guard access to Eritrean ports to assess safety and security conditions despite repeated requests to do so.  U.S. citizens should consult the Maritime Administration's Horn of Africa Piracy page for information on maritime advisories, self-protection measures, and naval forces in the region.\nModern telecommunications options are limited in Eritrea and cannot be counted upon in an emergency.  International cell phone service plans do not work on Eritrean networks.  Local cellular phone service is tightly controlled by the Eritrean government and difficult to obtain.  When available, international cell phone calls are extremely expensive and only available using pre-paid minutes.  Internet cafés are widespread but sometimes lack power, and internet service is often very slow, unreliable, and does not support Voice over Internet Protocol (VoIP) services such as Skype.\nThe U.S. Embassy in Asmara urges citizens who travel or remain in Eritrea despite this travel warning to enroll in the Smart Traveler Enrollment Program (STEP), so you can receive the most up-to-date security information.  Please keep all of your information in STEP current. \nU.S. citizens should consult the Country Specific Information for Eritrea and the Worldwide Caution, both located on the Department of State's Bureau of Consular Affairs website.  Current information on safety and security can also be obtained by calling 1-888-407-4747 toll-free in the United States and Canada, or a regular toll line at 1-202-501-4444 from other countries.  These numbers are available from 8:00 a.m. to 8:00 p.m. Eastern Time, Monday through Friday (except U.S. federal holidays).\nStay up to date by bookmarking our Bureau of Consular Affairs website, which contains the current Travel Warnings and Travel Alerts as well as the Worldwide Caution.  Follow us on Twitter and the Bureau of Consular Affairs page on Facebook as well.\nThe consular section of the U.S. Embassy in Asmara is open for all U.S. citizen services on Thursday afternoon by appointment only.  In the case of an emergency, please contact the Embassy for an emergency appointment.  The U.S. Embassy in Asmara is located at 179 Alaa Street, P.O. Box 211, Asmara, Eritrea; telephone (291) (1) 120-004, available 24 hours a day in case of emergency; fax (291) (1) 124-255 and (291) (1) 127-584.",
      "colorClass": "alert-warning",
      "source": "US State Department",
      "textOverview": "The U.S. Department of State continues to warn U.S. citizens of the risks of travel to Eritrea."
    }
  ],
  "TZ": [
    {
      "type": "Alert",
      "startDate": "2015-09-04T04:00:00.000Z",
      "link": "http://travel.state.gov/content/passports/en/alertswarnings/tanzania-travel-alert.html",
      "text": "The State Department alerts U.S. citizens residing in or traveling to Tanzania to the upcoming general elections scheduled for October 25, 2015. U.S. citizens are urged to exercise caution and remain abreast of the security situation throughout the electoral period.  This Travel Alert expires on November 30, 2015. \n\r\n\r\n\n\r\n\r\n\r\n\r\n\nThe State Department recommends U.S. citizens maintain a high level of security awareness leading up to, during, and following the election period. U.S. citizens should avoid political rallies, polling centers, demonstrations, and crowds of any kind as even gatherings intended to be peaceful can become confrontational and turn violent. Review your personal security plans; remain aware of your surroundings, including local events; and monitor local news stations for updates. Although there have been no specific incidents of violence targeting U.S. citizens, U.S. citizens are urged to exercise caution and stay current with media coverage of local events.\nMonitor local media for any changes in the election schedule. Election results are expected to be announced within a week of the election. For more information about security conditions in Tanzania, please see the Country Specific Information page for Tanzania.\n For further information:\n\nSee the State Department's travel website for the Worldwide Caution, Travel Warnings, Travel Alerts, and Country Specific Information for Tanzania.\n\n\nEnroll in the Smart Traveler Enrollment Program (STEP) to receive security messages and make it easier to locate you in an emergency.\n\n\nContact the U.S. Embassy in Tanzania, located at 646 Old Bagamoyo Rd, Msasani, Dar es Salaam, at+255-22-229-4000 or e-mail at drsacs@state.gov, and is open Monday-Thursday, 7:30 a.m.-5:00 p.m and Friday 7:30 – 11:30 a.m. For after-hours emergencies, U.S. citizens should call +255-22-229-4000 and ask to speak with the duty officer.\n\n\nCall 1-888-407-4747 toll-free in the United States and Canada or 1-202-501-4444 from other countries from 8:00 a.m. to 8:00 p.m. Eastern Standard Time, Monday through Friday (except U.S. federal holidays).\n\n\nFollow us on Twitter and Facebook.",
      "colorClass": "alert-danger",
      "source": "US State Department",
      "textOverview": "The State Department alerts U.S. citizens residing in or traveling to Tanzania to the upcoming general elections scheduled for October 25, 2015. U.S. citizens are urged to exercise caution and remain abreast of the security situation throughout the electoral period."
    }
  ],
  "DJ": [
    {
      "type": "Warning",
      "startDate": "2015-07-17T04:00:00.000Z",
      "link": "http://travel.state.gov/content/passports/en/alertswarnings/djibouti-travel-warning.html",
      "text": "The Department of State warns U.S. citizens of the risks of travel to Djibouti, including the risk of attack by terrorist organizations in the region. This Travel Warning replaces the Travel Warning for Djibouti dated November 25, 2014.\n\r\n\r\n\n\r\n\r\n\r\n\r\nThe U.S. government remains concerned about possible attacks on U.S. citizens, whether visiting or residing in Djibouti, and perceived U.S. and foreign interests.  Attacks may target official government facilities, including embassies and military installations, as well as soft targets such as restaurants, clubs, hotels, and other commercial entities. The Government of Djibouti continues to pursue members of Al-Shabaab involved in a May 2014 terrorist attack.\nOn May 24, 2014, two suicide bombers attacked a restaurant popular with foreigners in Djibouti’s city center.  One person was killed and several others were severely injured.  Al-Shabaab claimed initial responsibility and stated that it intended to conduct similar attacks in Djibouti against both native and foreign targets in the future. Such threats have recurred repeatedly since 2011 following Djibouti’s commitment to contribute military forces to the African Union Mission in Somalia (AMISOM).\nU.S. citizens in Djibouti should remain vigilant about their personal security, particularly in public places such as shopping areas, hotels, clubs, bars, restaurants, transportation hubs, and places of worship. In addition, they should remain alert while in the presence of large public gatherings. Adopt the following safe travel practices: avoid crowded venues; visit only legitimate businesses and tourist areas, preferably during daylight hours; lock all doors and windows; carry minimal cash and credit cards; do not wear flashy jewelry; memorize emergency phone numbers; do not resist or antagonize armed criminals; and always be aware of your surroundings.\n\nU.S. citizens who travel to or reside in Djibouti despite this Travel Warning are urged to maintain proper and current travel documents at all times, including a valid U.S. passport and Djibouti visa, and to enroll in the Smart Traveler Enrollment Program (STEP) for the most up-to-date security information and for assistance in case of a personal emergency. U.S. citizens without Internet access may enroll directly at the U.S. Embassy in Djibouti.\nThe U.S. Embassy in Djibouti is located at Lotissement Haramous Lot #350B and may be reached by telephone at + (253) 21-453-000. For after-hours, truly exigent medical or police emergencies involving U.S. citizens, please call + (253) 77-877-229. Any routine consular correspondence relating to U.S. citizen services may be directed to ConsularDjibouti@state.gov.\nFor the latest security information, U.S. citizens living or traveling abroad should regularly monitor the Department of State’s Consular Affairs’ website where the current Worldwide Caution, Travel Alerts and Travel Warnings, and Country Specific Information for Djibouti can be found. Up-to-date information on security can also be obtained by calling 1-888-407-4747 toll free in the United States and Canada or, for callers in other countries, by calling a regular toll line at 1-202-501-4444. These numbers are available 8:00 a.m. to 8:00 p.m. Eastern-time, Monday through Friday (except U.S. federal holidays).\nThe U.S. Embassy also encourages U.S. citizens to review the Traveler's Checklist, which includes valuable security information for those living or traveling abroad.\nFollow us on Twitter and the Bureau of Consular Affairs page on Facebook as well.",
      "colorClass": "alert-warning",
      "source": "US State Department",
      "textOverview": "The Department of State warns U.S. citizens of the risks of travel to Djibouti, including the risk of attack by terrorist organizations in the region."
    }
  ],
  "SV": [
    {
      "type": "Warning",
      "startDate": "2016-01-15T05:00:00.000Z",
      "link": "http://travel.state.gov/content/passports/en/alertswarnings/el-salvador-travel-warning.html",
      "text": "The Department of State continues to warn U.S. citizens that crime and violence levels in El Salvador remain critically high, and U.S. citizens traveling to El Salvador should remain alert to their surroundings. This Travel Warning supersedes the Travel Warning dated June 22, 2015, and includes updated information on crime and security in El Salvador.\n\r\n\r\n\n\r\n\r\n\r\n\r\nTens of thousands of U.S. citizens safely visit El Salvador each year for study, tourism, cruise ship visits, business, and volunteer work.  There is no information to suggest that U.S. citizens are specifically targeted by criminals; however, crime and violence are serious problems throughout the country. Since a rise in violence in the summer of 2015, the current murder rate in El Salvador is among the highest in the world, an annual rate of 103.1 murders per 100,000 citizens for 2015. In comparison, the U.S. rate is 4.5 per 100,000.  While U.S. citizens are not singled out as targets, the pervasive violence greatly increases the chance of someone being “in the wrong place at the wrong time.”  Since January 2010, 38 U.S. citizens have been murdered in El Salvador.  During the same time period, 449 U.S. citizens reported having their passports stolen, while others were victims of violent crimes.\nTypical crimes in El Salvador include extortion, mugging, highway assault, home invasion, and car theft.  There have also been cases reported in which criminals observe and follow customers making withdrawals at ATMs and banks, then rob them on the road or at a residence.  Some victims unwittingly wander into gang-controlled territory and may be targeted, normally at night.  Assaults against police officers have risen, and public shootouts are not uncommon.  Armed robberies of climbers and hikers in El Salvador’s national parks are known to occur, and the U.S. Embassy strongly recommends engaging the services of a local guide certified by the national or local tourist authority when hiking in back country areas.  The National Civilian Police (PNC) has a special tourist police force (POLITUR) to provide security and assistance to visitors.  It has officers located in 19 tourist destinations.\nA majority of serious crimes are never solved; only seven of the 38 murders of U.S. citizens since January 2010 have resulted in convictions.  The Government of El Salvador lacks sufficient resources to properly investigate and prosecute cases and to deter violent crime.  While several of the PNC’s investigative units have shown promise, routine street-level patrol techniques, anti-gang, and crime suppression efforts are limited.  Equipment shortages (particularly radios, vehicles, and fuel) further limit their ability to deter or respond to crimes effectively. As a result, criminals operate with a high degree of impunity throughout El Salvador.\n\nEl Salvador, a country of roughly six million people, has, according to Government of El Salvador statistics, thousands of known gang members from several gangs including Mara Salvatrucha (MS-13) and Eighteenth Street (M18). Gang members are quick to engage in violence or use deadly force if resisted.  These “maras” concentrate on narcotics and arms trafficking, murder for hire, carjacking, extortion, and violent street crime.  Authorities believe a significant number of disappearances are related to gang activity, since many of the missing were in gangs or were friends or family members of gang members.  Police sources claim that the families of gang members often face the same risks of being killed or disappearing as the gang members themselves. \nIn the past year, Salvadoran gangs have escalated their tactics.  In late July 2015, they used threats and violence to halt most public transportation, killing 8 drivers and burning two buses from the transportation companies that continued to provide service.  This followed a July 25, 2015 grenade attack near the Sheraton hotel in San Salvador.  On August 28, 2015, an improvised explosive device (IED) was placed in a vehicle parked in front of the Ministry of Justice and Public Security; the device was constructed with military-grade explosives, but failed to detonate.  On September 10, 2015, a homemade IED detonated inside a car parked in front of the Ministry of Finance; there were no reported injuries although the blast did cause damage to nearby buildings. Similar IEDs have been found, made from both military-grade and household materials, and they represent an escalation in gang tactics to target Salvadoran government personnel and facilities.  Local police have arrested members of M18 in relation to these devices. \nExtortion is a very common crime in El Salvador.  Some extortion attempts are no more than random cold calls that originate from imprisoned gang members using cellular telephones, and the subsequent threats against the victim are made through social engineering and/or through information obtained about the victim’s family.  U.S. citizens who are visiting El Salvador for extended periods are at higher risk for extortion demands.  Many extortions and other crimes are not reported by victims for fear of reprisal and lack of faith in the ability of the local government to protect the victims.\nU.S. citizens should remain alert to their surroundings, especially when entering or exiting their homes or hotels, cars, garages, schools, and workplaces.  Whenever possible, travel in groups.  U.S. Embassy security officials advise all U.S. government personnel not to walk, run, or cycle in unguarded streets and parks, even in groups, and recommend exercising only in gyms and fitness centers.  Avoid wearing expensive jewelry, and do not carry large sums of money or display cash, ATM/credit cards, or other valuables.  Avoid walking at night in most areas of El Salvador. Incidents of crime along roads, including carjacking, are common in El Salvador.  Motorists should avoid traveling at night and always drive with their windows up and doors locked to deter potential robberies at traffic lights and on congested downtown streets.  Travel on public transportation, especially buses, both within and outside the capital, is risky and not recommended.  The Embassy advises official visitors and personnel to avoid using mini-buses and regular buses and to use only radio-dispatched taxis or those stationed in front of major hotels.\n\nFor more detailed information regarding personal security, please see the State Department's Country Specific Information for El Salvador.  U.S. citizens traveling abroad should regularly monitor the Bureau of Consular Affairs website, where the Worldwide Caution, Travel Warnings, and Travel Alerts can be found.  Follow us on Twitter and the Bureau of Consular Affairs page on Facebook as well. \n\nU.S. citizens living or traveling in El Salvador are strongly encouraged to sign up for the State Department's Smart Traveler Enrollment Program (STEP) to obtain updated information on travel and security within El Salvador.  Travelers may also obtain up-to-date information on security conditions by calling 888-407-4747 toll-free in the United States or on a regular toll line at 202-501-4444.\n\nThe U.S. Embassy is located on Final Boulevard Santa Elena Sur, Urbanización Santa Elena, Antiguo Cuscatlán, La Libertad, and can be reached at:\nTelephone: 503-2501-2999\nFax: 503-2278-5522 / 503-2278-6020\nEmail\nWebsite \nFacebook\nTwitter\nFor after-hours emergencies, please call 503-2501-2999.",
      "colorClass": "alert-warning",
      "source": "US State Department",
      "textOverview": "The Department of State continues to warn U.S. citizens that crime and violence levels in El Salvador remain critically high, and U.S. citizens traveling to El Salvador should remain alert to their surroundings."
    }
  ],
  "SA": [
    {
      "type": "Warning",
      "startDate": "2015-09-21T04:00:00.000Z",
      "link": "http://travel.state.gov/content/passports/en/alertswarnings/saudi-arabia-travel-warning.html",
      "text": "The Department of State urges U.S. citizens to carefully consider the risks of traveling to Saudi Arabia.  There have been attacks on U.S. citizens and other Western expatriates within the past year and there continue to be reports of threats against U.S. citizens and other Westerners, as well as sites frequented by them. There have been multiple Islamic State of Iraq and the Levant (ISIL) directed and inspired attacks on mosques in the past four months. The latest, in the city of Abha on August 6, targeted members of the Saudi security forces. Furthermore, there are ongoing security concerns related to the crisis in Yemen, particularly border incursions and missile attacks across the Saudi-Yemeni border by forces within Yemen. This replaces the Travel Warning issued February 24, 2015.\n\r\n\r\n\n\r\n\r\n\r\n\r\nU.S. government personnel and their families are restricted from traveling within 50 miles of the Yemeni border, and to the cities of Jizan and Najran, without permission from U.S. Embassy security officials. U.S. government personnel are also prohibited from traveling to the city of Qatif in the Eastern Province and its surrounding suburbs, including Awamiyah, and to the Al Hasa Governorate due to violent episodes that have occurred there in the past.\nSecurity threats continue and terrorist groups, some affiliated with ISIL or Al-Qaida in the Arabian Peninsula (AQAP), have targeted both Saudi and Western interests. Possible targets include housing compounds, hotels, restaurants, shopping areas, international schools, and other facilities where Westerners congregate, as well as Saudi government facilities and economic/commercial targets within the Kingdom. Consular services at the U.S. Embassy and Consulates were canceled March 15-19, 2015 due to heightened security concerns at our diplomatic facilities in the Kingdom.\nMultiple attacks on mosques, as well as additional places where Shia gather, have occurred in Saudi Arabia over the past four months, resulting in significant loss of life. On May 22, 2015 a suicide bomber attacked a mosque in Al-Qadeeh in Al Qatif Governorate. On August 6, 2015 a mosque in the city of Abha was bombed. Most of the victims in that attack were members of the Saudi security forces. On May 29, 2015 a blast occurred at another mosque in the Al Anoud district of Dammam.\nU.S. citizens have been the targets of recent attacks in the Kingdom. On January 30, 2015, two U.S. citizens were fired upon and injured in Hofuf in Al Hasa Governorate (Eastern Province). On October 14, 2014, two U.S. citizens were shot at a gas station in Riyadh. One was killed and the other wounded.\nThere have been several attacks on other nationalities during the past year. On November 29, 2014, a Canadian national was assaulted by a lone attacker with a cleaver at a shopping mall in Dhahran. On November 22, 2014, a Danish national was shot and injured in Riyadh by alleged ISIL supporters. On November 3, 2014, armed assailants attacked a community center in Dalwah in the Al Hasa Governorate, killing at least seven people and injuring several others. ISIL claimed responsibility for the attack.\nThe U.S. Embassy continues to receive reports of violence near the border with Yemen, including reports of small arms fire, bombs, artillery, and missile impacts. Media and independent sources report armed groups crossing the border into Saudi Arabia to conduct attacks on Saudi Arabian territory, primarily near western border cities, including Najran. The rugged border area dividing Yemen and Saudi Arabia remains porous in some areas and boundaries are not clearly defined. As the conflict continues in Yemen, violence can spill across the border at unpredictable times and locations. Forces hostile to Saudi Arabia within Yemen have weapons systems including mortars, artillery, and missiles that have been launched at targets in Saudi Arabia. On June 6, 2015, a missile was shot down 50 miles inside Saudi Arabia by Saudi forces that may have been targeting the King Khalid Air Base near Khamis Mushait. On August 26, 2015, a missile was fired across the border near Jizan and was intercepted by Saudi military. There is an increased possibility of strikes within 50 miles of the border, which could result in civilian deaths.\nVisitors who choose to travel to these areas despite U.S. government concerns should be aware that, in addition to the above noted border attacks, terrorist and criminal elements may be operating there, including AQAP. U.S. citizens are strongly urged to read the Department of State Travel Warning for Yemen before traveling to areas near the Yemeni frontier.\nU.S. citizens in Saudi Arabia are strongly encouraged to select hotels or housing compounds with careful attention to security measures and location. U.S. citizens should be aware of their surroundings at all times and are advised to keep a low profile; vary times and routes of travel; exercise caution while driving, and entering or exiting vehicles; and ensure that travel documents and visas are current and valid.\nIf the security threat changes or specific threats affecting U.S. citizens are discovered, this information will be made available through the Smart Traveler Enrollment Program (STEP) and U.S. Mission websites. Emergency Messages, Security Messages, and Messages for U.S. Citizens can be found on the U.S. Embassy Riyadh website.\nFor further information:\n\nSee the State Department's travel website for the Worldwide Caution, Travel Warnings, Travel Alerts, and Saudi Arabia Country Specific Information.\nEnroll in the Smart Traveler Enrollment Program (STEP) to receive security messages and make it easier to locate you in an emergency.\nContact the U.S. Embassy in Saudi Arabia located at Abdullah Ibn Huthafah Al-Sahmi Street, Diplomatic Quarter, at +966 11 488 3800, 8:00 a.m. to 5:00 p.m. Sunday through Thursday. After-hours emergency number for U.S. citizens is +966 11 488 3800.\nCall 1-888-407-4747 toll-free in the United States and Canada or 1-202-501-4444 from other countries from 8:00 a.m. to 8:00 p.m. Eastern Time, Monday through Friday (except U.S. federal holidays).\nFollow us on Twitter and Facebook.\n\nU.S. Embassy Riyadh\nTelephone: (966) (11) 488-3800\nFax: (966) (11) 483-0773\nEmergency after-hours telephone: (966) (11) 488-3800\nU.S. Consulate General Dhahran\nTelephone: (966) (13) 330-3200\nFax: (966) (13) 330-0464\nEmergency after-hours telephone: (966) (13) 330-3200\nU.S. Consulate General Jeddah\nTelephone: (966) (12) 667-0080\nFax: (966) (12) 669-3098\nEmergency after-hours telephone: (966) (12) 667-0080",
      "colorClass": "alert-warning",
      "source": "US State Department",
      "textOverview": "The Department of State urges U.S. citizens to carefully consider the risks of traveling to Saudi Arabia."
    }
  ],
  "SY": [
    {
      "type": "Warning",
      "startDate": "2015-08-27T04:00:00.000Z",
      "link": "http://travel.state.gov/content/passports/en/alertswarnings/syria-travel-warning.html",
      "text": "The Department of State continues to warn U.S. citizens against all travel to Syria and strongly recommends that U.S. citizens remaining in Syria depart immediately. This Travel Warning supersedes the Travel Warning dated March 3, 2015, to remind U.S. citizens that the security situation remains dangerous and unpredictable as a violent conflict between government and armed anti-government groups continues throughout the country, along with an increased risk of kidnappings, bombings, murder, and terrorism.\n\r\n\r\n\n\r\n\r\n\r\n\r\n \n No part of Syria should be considered safe from violence. The potential for hostile acts exists throughout the country, including kidnappings and the use of chemical warfare against civilian populations. Shelling and aerial bombardment, including of densely populated urban areas, have significantly raised the risk of death or serious injury. The destruction of infrastructure, housing, medical facilities, schools, and power and water utilities has also increased hardships inside the country.\n \n There is a terrorist threat from violent extremist groups including the Islamic State of Iraq and the Levant, (ISIL), formerly known as al-Qa’ida in Iraq (AQ), the al-Nusrah Front, and others. Tactics for these groups include the use of suicide bombers, kidnapping, use of small and heavy arms, and improvised explosive devices in major city centers, including Damascus, Aleppo, Hamah, Dara, Homs, Idlib, and Dayr al-Zawr. U.S. citizens have been specifically targeted for kidnapping, both for ransom and political purposes, and murdered by members of terrorist and violent extremist groups in Syria. U.S. citizens have disappeared within Syria. Public places, such as road checkpoints, border crossings, government buildings, shopping areas, and open spaces, have been targeted. Due to the security situation in Syria, the U.S. government’s ability to help U.S. citizens kidnapped or taken hostage is very limited.\nIndividuals who demonstrate an interest in groups opposing ISIL, including on social media, could open themselves to being targeted by ISIL itself if those individuals travel to Syria. Private U.S. citizens are strongly discouraged from traveling to Syria to take part in the conflict. The U.S. government does not support this activity, and our ability to provide consular assistance to individuals who are injured or kidnapped, or to the families of individuals who die as a result of taking part in the conflict is extremely limited.\nU.S. citizens are reminded that fighting on behalf of or providing other forms of support to designated terrorist organizations, including ISIL, can constitute the provision of material support for terrorism, which is a crime that can result in penalties including prison time and large fines.\nCommunications in Syria are difficult as phone and internet connections have become increasingly unreliable. The Department of State has received reports that U.S. citizens are experiencing difficulty and facing dangers traveling within the country and when trying to leave Syria via land borders, given the diminishing availability of commercial air travel out of Syria. Fierce clashes between pro-government and opposition forces continue in the vicinity of the Damascus and Aleppo airports. Land border checkpoints held by opposition forces should not be considered safe, as they are targeted by regime attacks and some armed groups have sought to fund themselves through kidnappings for ransom. Border areas are frequent targets of shelling and other attacks and are crowded because of internally-displaced refugees. Errant attacks will occasionally hit border towns just outside the borders as well. Road checkpoints have been controlled by armed terrorist and violent extremist groups and have been utilized to conduct kidnappings of individuals, including U.S. citizens.\nThe U.S. Department of State is concerned about the risks to civil aviation operating in the Damascus Flight Information Region (FIR) because of the ongoing armed conflict and volatile security environment. This FIR includes all the airspace over Syria and extends into adjacent international airspace. A number of armed extremist groups are known to be equipped with a variety of antiaircraft weapons that have the capability to threaten civil aircraft. The Federal Aviation Administration (FAA) has prohibited U.S. civil aviation from flying in the Damascus FIR. In addition, U.S. government personnel in Lebanon have been prohibited from taking flights that pass through the Damascus FIR. For additional background information regarding FAA flight prohibitions and advisories for U.S. civil aviation, U.S. citizens should consult the Federal Aviation Administration’s Prohibitions, Restrictions and Notices.\nThe U.S. Embassy in Damascus suspended its operations in February 2012 and therefore cannot provide protection or routine consular services to U.S. citizens in Syria. The Government of the Czech Republic, acting through its Embassy in Damascus, serves as Protecting Power for U.S. interests in Syria. The range of consular services the Czech Republic provides to U.S. citizens is extremely limited, and those services, including for U.S. passports and Consular Reports of Birth Abroad, may require significantly more processing time than at U.S. embassies or consulates outside of Syria. U.S. citizens in Syria who seek consular services should leave the country and contact a U.S. embassy or consulate in a neighboring country if at all possible. U.S. citizens who remain in Syria and require consular services may contact the U.S. Interests Section of the Embassy of the Czech Republic in Damascus at USIS_damascus@embassy.mzv.cz. \nU.S. citizens in Syria who are in need of emergency assistance in Syria, and are unable to reach the U.S. Interests Section of the Embassy of the Czech Republic or must make contact outside business hours, should contact the U.S. Embassy in Amman, Jordan:\n \n Telephone: +962 (6) 590-6950 (Daily 2-3:30 local time)\n Emergencies: +962 (6) 590-6500\n E-mail: Amman-ACS@state.gov \n \n If you seek information about U.S. citizens' services in Syria from the Office of Overseas Citizens' Services in Washington, please e-mail: SyriaEmergencyUSC@state.gov. \n \n For information on \"What the Department of State Can and Can't Do in a Crisis,\" please visit the Bureau of Consular Affairs' Emergencies and Crisis link at www.travel.state.gov. Up-to-date information on security can also be obtained by calling 1-888-407-4747 toll-free in the United States and Canada or, for callers outside the United States and Canada, on a regular toll line at 1-202-501-4444. These numbers are available from 8:00 a.m. to 8:00 p.m. Eastern Daylight Time, Monday through Friday (except U.S. federal holidays).\n \n For further information:\n\nSee the State Department's travel website for the Worldwide Caution, Travel Warnings, Travel Alerts, and Syria Country Specific Information.\n\n\nEnroll in the Smart Traveler Enrollment Program (STEP) to receive security messages and make it easier to locate you in an emergency. \n\n\nCall 1-888-407-4747 toll-free in the United States and Canada or 1-202-501-4444 from other countries from 8:00 a.m. to 8:00 p.m. Eastern Standard Time, Monday through Friday (except U.S. federal holidays).\n\nFollow us on Twitter and Facebook",
      "colorClass": "alert-warning",
      "source": "US State Department",
      "textOverview": "The Department of State continues to warn U.S. citizens against all travel to Syria and strongly recommends that U.S. citizens remaining in Syria depart immediately."
    }
  ],
  "PK": [
    {
      "type": "Warning",
      "startDate": "2015-08-28T04:00:00.000Z",
      "link": "http://travel.state.gov/content/passports/en/alertswarnings/pakistan-travel-warning.html",
      "text": "The Department of State warns U.S. citizens against all non-essential travel to Pakistan. This Travel Warning replaces the Travel Warning dated February 24, 2015, to remind U.S. citizens of ongoing security concerns in Pakistan.\n\r\n\r\n\n\r\n\r\n\r\n\r\nThe U.S. Embassy in Islamabad and the U.S. Consulate General in Karachi continue to provide consular services for all U.S. citizens in Pakistan. The U.S. Consulate General in Peshawar no longer offers consular services, and consular services at the U.S. Consulate General in Lahore remain temporarily suspended.\nThe presence of several foreign and indigenous terrorist groups continues to pose a danger to U.S. citizens throughout Pakistan. Across the country, terrorist attacks frequently occur against civilian, government, and foreign targets. Attacks range from targeted killings and kidnappings, to armed assaults against heavily guarded facilities, including Pakistani military installations and airports. The Government of Pakistan maintains heightened security measures, particularly in the major cities, and these measures may vary from day to day. Threat reporting indicates terrorist groups continue to seek opportunities to attack locations where U.S. citizens and Westerners are known to congregate or visit. Terrorists and criminal groups regularly resort to kidnapping for ransom.\nProtests due to domestic events and against the United States are not uncommon in Pakistan and have the potential to turn violent. Even when violent protests do not target U.S. citizens, they may result in harm to bystanders. U.S. citizens in Pakistan are strongly advised to avoid all protests and large gatherings. Rallies, demonstrations, and processions occur regularly throughout Pakistan on very short notice. Demonstrations might take on an anti-U.S. or anti-Western character, and U.S. citizens are urged to avoid large gatherings. In January 2015, protests against the French Charlie Hebdo magazine were staged in many Pakistani cities, including outside the French Consulate in Karachi, after the magazine’s office in Paris was attacked by gunmen angered by cartoons believed to be anti-Islamic. The Mission reminds U.S. citizens that even peaceful demonstrations might become violent and advises U.S. citizens to avoid demonstrations. Given multiple demands for resources, local authorities may have limited capacity to respond to requests for assistance.\nRECENT ATTACKS\nSo far in 2015, there have been more than 200 terror-related incidents in Pakistan. On August 16, a senior Punjab state official and 18 others were killed by a suicide bomber at his political office in Attock. A Pakistani Taliban splinter group named Jamaat-ul-Ahrar claimed responsibility. The same group previously used suicide bombers to attack two Christian churches in Lahore on March 15, killing 15 people and injuring another 70, and a police facility in Lahore on February 17, killing 8 people and injuring another 19.\nTargeted attacks against government officials, humanitarian and non-governmental organization (NGO) employees, tribal elders, and law enforcement personnel continue throughout the country. U.S.citizens have also been targeted. On April 16, 2015, a U.S. educator was seriously injured while driving her own vehicle in Karachi after being shot by two gunmen on motorbikes. Evidence obtained by local police suggests that she was targeted, in part, because she is a U.S. citizen.\nSuicide bomb attacks have occurred in major cities and other locations across the country, including universities, schools, rallies, places of worship, and major marketplaces in several Pakistani cities.\nSectarian violence occurs countrywide. On May 13, 2015, gunmen attacked a bus traveling in Karachi, killing more than 40 of the passengers. Most of the victims were members of the Ismaili Shia Muslim minority community. Members of minority communities have been victims of targeted killings and accusations of blasphemy, a crime that carries the death penalty in Pakistan. Places of worship of various faiths have frequently been targeted for attack by terrorists. U.S. government personnel are prohibited from attending services at places of worship in Karachi, Lahore, and Peshawar, and outside of the diplomatic enclave in Islamabad without prior approval. Foreign nationals, including U.S. citizens, on valid missionary visas have encountered increased scrutiny from local authorities since early 2011.\nTRAVEL RESTRICTIONS FOR GOVERNMENT PERSONNEL\nU.S. government personnel travel within Pakistan is often restricted based on security or other reasons. Movements by U.S. government personnel assigned to the Consulates General are severely restricted, and consulate staff cannot drive personally-owned vehicles. Embassy staff are permitted at times to drive personally-owned vehicles in the greater Islamabad area.\nU.S. personnel in Pakistan who are under Chief of Mission (COM) authority are instructed to vary travel routes and timing, even for routine trips. They are also instructed to minimize the duration of trips to public markets, restaurants, and other locations, as well as to minimize the number of U.S. personnel congregating in any one location at any one time. Personnel and visitors under COM authority are not allowed to use public transportation in Pakistan and are not authorized to stay overnight in hotels in Pakistan. Depending on ongoing security assessments, the U.S. Mission sometimes places public areas such as hotels, markets, restaurants, and Pakistan government offices off-limits to official personnel.\nAccess to many areas of Pakistan, including the Federally Administered Tribal Areas (FATA) along the Afghan border, the Swat Valley in Khyber Pakhtunkhwa Province, and the area adjacent to the Line of Control (LOC) in the disputed territory of Kashmir, is restricted by local government authorities for non-Pakistanis. Travel to any restricted region requires official permission from the Government of Pakistan. Failure to obtain such permission in advance can result in arrest and detention by Pakistani authorities. Due to security concerns, the U.S. government currently allows only essential travel within the FATA by U.S. officials. Travel to much of Khyber Pakhtunkhwa Province and Balochistan is also restricted.\nGENERAL SAFETY AND SECURITY\nThe Mission reiterates its advice to all U.S. citizens to maintain good situational awareness, avoid large crowds, and keep a low profile, particularly when visiting locations frequented by Westerners. U.S. citizens in Pakistan are strongly urged to avoid hotels that do not apply stringent security measures, and to vary times and routes for all travel.\nU.S. citizens in Pakistan have also been kidnapped for ransom or for personal reasons such as family disputes over property. In May 2015, a U.S. citizen was released after being kidnapped in a residential area of Karachi in February. The Mission is aware of other U.S. citizens who have been kidnapped, some released and some still being held. U.S. citizens have also been abducted by terrorists, or abducted by criminal elements and then sold to terrorists, and held hostage for multiple years. The kidnapping of Pakistani citizens and other foreign nationals, usually for ransom, continues to increase nationwide. U.S. citizens who feel they are in danger, or whose security is at risk, are strongly urged to depart Pakistan as soon as possible.\nThe U.S. Consulate in Karachi frequently receives reports from U.S. citizens who have been the victims of robberies at gunpoint. Many calls involve robberies during transit between Karachi’s Jinnah International Airport and the city. Some of the calls allege involvement by law enforcement.\nU.S. citizens seeking services from the U.S. Consulate General in Karachi might also encounter harassment from host government officials. Citing security concerns, host-government intelligence officials frequently stop U.S. citizens outside the Consulate and obtain their personal information before allowing them to proceed. U.S. citizens might later be visited at their homes or offices and questioned about the nature of their business in Pakistan and the purpose of their visit to the Consulate.\nENTRY/EXIT DIFFICULTIES\nU.S. citizens should ensure that their travel documents and visas are valid before travelling to Pakistan and at all times while in Pakistan. All U.S. citizens regardless of age must have a valid passport and visa for Pakistan, unless they have a Pakistani passport or National Identity Card for Overseas Pakistanis (NICOP). U.S. citizens throughout Pakistan have been fined, arrested, deported, harassed, and detained for overstaying their Pakistani visas or for traveling to Pakistan without the appropriate visa classification. U.S. citizens who attempt to renew or extend their visas while in Pakistan have been left without legal status for an extended period of time and subjected to harassment or interrogation by local authorities. The U.S. Embassy and Consulates General can provide very limited assistance to U.S. citizens who have overstayed their Pakistani visas. Since 2011, the number of U.S. citizens arrested, detained, and prosecuted for visa overstays has increased across the country.\nU.S. citizens in Pakistan are responsible for monitoring their visa restrictions and abiding by the terms of their visas to ensure they are in compliance with Pakistani immigration regulations. U.S. citizens occasionally notify the Embassy that they are unable to depart the country because their names have been added to the Exit Control List (ECL). The U.S. Embassy is unable to assist in such cases, which must be resolved through Pakistani legal channels.\nSecurity threats might, on short notice, temporarily restrict the ability of the U.S. Missions to provide routine consular services. All U.S. citizens are encouraged to apply for renewal of travel documents at least three months prior to expiration.\nU.S. citizens who travel to or remain in Pakistan despite this Travel Warning are encouraged to enroll with the Embassy in Islamabad or the Consulate General in Karachi. This enrollment can be completed online through the Department of State's Smart Traveler Enrollment Program (STEP) available on the Department of State website. U.S. citizens without internet access should contact the nearest Embassy or Consulate General for information on registering in person. Enrollment enables citizens to obtain updated information on travel and security within Pakistan via the emergency alert system.\nFor further information:\n\nSee the State Department's travel website for the Worldwide Caution, Travel Warnings, Travel Alerts, and Pakistan Country Specific Information.\n\n\nEnroll in the Smart Traveler Enrollment Program (STEP) to receive security messages and make it easier to locate you in an emergency.\n\n\nContact the U.S. Embassy in Islamabad, located at Diplomatic Enclave, Ramna 5, Islamabad, Pakistan, or by email at ACSIslamabad@state.gov. U.S. citizens requiring emergency assistance should call (92)(51) 208-0000.\n\n\nContact the U.S. Consulate General in Karachi, located at Plot 3-5 New TPX Area, Mai Kolachi Road. U.S. citizens requiring emergency assistance should call the Consular Section in Karachi at (92-21) 3527-5000. The fax number is (92-21) 3561-2420.\n\n\nMake an appointment for American Citizens Services with the Consular Section in Islamabad or Karachi. \n\n\nCall 1-888-407-4747 toll-free in the United States and Canada or 1-202-501-4444 from other countries from 8:00 a.m. to 8:00 p.m. Eastern Standard Time, Monday through Friday (except U.S. federal holidays).\n\n\nFollow us on Twitter and Facebook.",
      "colorClass": "alert-warning",
      "source": "US State Department",
      "textOverview": "The Department of State warns U.S. citizens against all non-essential travel to Pakistan."
    }
  ],
  "DZ": [
    {
      "type": "Warning",
      "startDate": "2015-08-26T04:00:00.000Z",
      "link": "http://travel.state.gov/content/passports/en/alertswarnings/algeria-travel-warning.html",
      "text": "The Department of State continues to warn U.S. citizens against travel to the Kabylie region and remote areas of southern and eastern Algeria.   This replaces the Travel Warning for Algeria dated February 24, 2015, to update information on the current security situation in Algeria. \n\r\n\r\n\n\r\n\r\n\r\n\r\nThe Department of State urges U.S. citizens who travel to Algeria to evaluate carefully the risks to their personal safety.  There is a high threat of terrorism and kidnappings in Algeria, as noted in the Department of State's most recent Worldwide Caution.  Although the major cities are heavily policed, attacks are still possible.  The majority of terrorist attacks, including bombings, false roadblocks, kidnappings, and ambushes occur in the mountainous areas to the east of Algiers (Kabylie region and eastern wilayas) and in the expansive Saharan desert regions of the south and southeast. \nAlthough most attacks are directed towards Algerian military or police, in September 2014, the ISIL-affiliated Jund al- Khilafah (Soldiers of the Caliphate) abducted and beheaded a French citizen in the Kabylie region.  In January 2013, an Al-Qaeda-linked organization, “Those Who Sign in Blood,” attacked a gas production facility near In Amenas, Algeria, near the Libyan border, holding foreign and Algerian workers hostage for four days with dozens killed, including three U.S. citizens.  In addition to these attacks, there have been kidnappings for ransom by terrorist groups operating in the trans-Sahara region.  Terrorist groups, including Al-Murabitoun, Al-Qaeda in the Islamic Maghreb (AQIM), the Movement for Unity and Jihad in West Africa (MUJAO), and various self-proclaimed ISIL affiliates remain active in the region.  There are also extremists along the Algeria/Tunisia border in the Chaambi mountains area, south of Souk Ahras, and Algerian and Tunisian security forces are conducting ongoing security operations there.\nThe Department of State recommends that U.S. citizens avoid overland travel to the areas east of Algiers or in the Sahara.  It is prudent to be cautious when traveling outside of Algiers and to ensure reliable and experienced transportation and logistical support.  The Algerian government requires all employees of foreign companies or organizations based in Algeria, who are not Algerian citizens, to contact the Ministry of Foreign Affairs before engaging in any travel within the interior of the country; the Ministry will notify local police of the planned travel and the police may choose to assign escorts for that travel.  Travelers should avoid mountainous regions located in less populated and less traveled areas where Algerian security services do not have a significant presence. \nThe U.S. government considers the potential threat to U.S. Embassy personnel assigned to Algiers sufficiently serious to require them to live and work under security restrictions.  The U.S. Department of State permits U.S. diplomats in Algeria to be accompanied only by adult family members and children under age 12.  Embassy travel restrictions limit and occasionally prevent the movement of U.S. Embassy officials and the provision of consular services in certain areas of the country.  Likewise, the Government of Algeria requires U.S. Embassy personnel to seek permission to travel outside the wilaya of Algiers and provides police escorts.  Travel to the military zone established around the Hassi Messaoud oil center requires Government of Algeria authorization. \nFor further information:\n\nSee the State Department's travel website for the Worldwide Caution, Travel Warnings, Travel Alerts, and Algeria Country Specific Information.\nEnroll in the Smart Traveler Enrollment Program (STEP) to receive security messages and make it easier to locate you in an emergency. \nContact the U.S. Embassy in Algeria, located at 5 Chemin Cheikh Bachir El-Ibrahimi in the El Biar district of Algiers.  For routine inquiries, please email ACSAlgiers@state.gov.  The Embassy is open Sunday-Thursday 0800-1630.  For emergencies, including after-hours, call [213]770 08 20 00. \nCall 1-888-407-4747 toll-free in the United States and Canada or 1-202-501-4444 from other countries from 8:00 a.m. to 8:00 p.m. Eastern Standard Time, Monday through Friday (except U.S. federal holidays).\nFollow us on Twitter and Facebook.",
      "colorClass": "alert-warning",
      "source": "US State Department",
      "textOverview": "The Department of State continues to warn U.S. citizens against travel to the Kabylie region and remote areas of southern and eastern Algeria."
    }
  ],
  "MX": [
    {
      "type": "Warning",
      "startDate": "2016-01-19T05:00:00.000Z",
      "link": "http://travel.state.gov/content/passports/en/alertswarnings/mexico-travel-warning.html",
      "text": "The U.S. Department of State warns U.S. citizens about the risk of traveling to certain places in Mexico due to threats to safety and security posed by organized criminal groups in the country. U.S. citizens have been the victims of violent crimes, such as homicide, kidnapping, carjacking, and robbery by organized criminal groups in various Mexican states. For information on security conditions in specific regions of Mexico, which can vary, travelers should reference the state-by-state assessments further below. This Travel Warning replaces the Travel Warning for Mexico, issued May 5, 2015, to update information about the security situation and to advise the public of additional restrictions on the travel of U.S. government (USG) personnel.\n\r\n\r\n\n\n\n  \n\n\n\n    \n        \n        \n        \n        \n        \n            \n        \n        \n        \n    \n    \n\n\n\n\n\njQuery(function() {\n    jQuery(\"input.hidden_name, input.hidden_code\").val(\"\");\n    jQuery(\"input.autocomplete_input\").val(\"\").blur();\n\n    var myopts = travelStateGov.globalfx.createAutoOpts(\"mexicoTravelWarnings\", travelStateGov.mexicoTravelWarnings.sourceData, \"content_par_autocomplete_mexicoTravelWarnings\", false, 0 ); \n\n    jQuery(\"#content_par_autocomplete_mexicoTravelWarnings_input\").autocomplete(myopts);\n\n    jQuery('#content_par_autocomplete_mexicoTravelWarnings_container').submit(function(e){\n        e.preventDefault();\n        var thisInput = jQuery(\".autocomplete_input\", jQuery(this));\n        thisInput.removeAttr(\"autocomplete\");\n        jQuery('#content_par_autocomplete_mexicoTravelWarnings_container .autocomplete_submit').trigger('click');\n    });\n    \n        \n});\n\n\n\n    \n\n    jQuery(\"#content_par_autocomplete_mexicoTravelWarnings_container .autocomplete_submit\").click(function(e) {\n        \n        var thisSubmitBtn = jQuery(this),\n            thisForm = thisSubmitBtn.parents(\"form\"),\n            thisInput = thisForm.find(\".autocomplete_input\"),\n            inputTerm = jQuery.trim(thisInput.val()),\n            hiddenCode = thisForm.find(\".hidden_code\"),\n            countryCode = hiddenCode.val();\n\n        e.preventDefault();\n\n        if(inputTerm === \"\" || countryCode === \"\") {\n            thisInput.val(\"No Results\");\n        } else {\n            MXMAP.mexicoAlertPopup(countryCode);\n            setTimeout(function() {\n                hiddenCode.val(\"\");      \n                //thisInput.focus().val(thisInput.attr(\"title\")).blur();       \n                thisInput.val(thisInput.attr(\"title\"));       \n            }, 100);\n        }        \n    });\n\n\n\n \n\n\n\n    \n        \n    \n    \n\n\n\n    \n        \n            \n                Mexico Travel Warning\n            \n             \n            \n            \n            \n                \n                    \n                \n            \n        \n    \n\n\r\n\r\n\r\n\r\n\nGeneral Conditions: Millions of U.S. citizens safely visit Mexico each year for study, tourism, and business, including more than 150,000 who cross the border every day. The Mexican government dedicates substantial resources to protect visitors to major tourist destinations, and there is no evidence that organized criminal groups have targeted U.S. visitors or residents based on their nationality. Resort areas and tourist destinations in Mexico generally do not see the levels of drug-related violence and crime that are reported in the border region or in areas along major trafficking routes.\nNevertheless, U.S. travelers should be aware that the Mexican government has been engaged in an extensive effort to counter organized criminal groups that engage in narcotics trafficking and other unlawful activities throughout Mexico. Crime and violence are serious problems and can occur anywhere, and U.S. citizens have fallen victim to criminal activity, including homicide, gun battles, kidnapping, carjacking, and highway robbery. While many of those killed in organized crime-related violence have themselves been involved in criminal activity, innocent persons have also been killed. The number of U.S. citizens reported to the Department of State as murdered in Mexico was 100 in 2014 and 103 in 2015.\nGun battles between rival criminal organizations or with Mexican authorities have taken place in towns and cities in many parts of Mexico and have occurred in broad daylight on streets and in other public venues, such as restaurants and clubs. During some of these incidents, U.S. citizens have been temporarily prevented from leaving the area. Criminal organizations have used stolen cars, buses, and trucks to create roadblocks on major thoroughfares, preventing the military and police from responding to criminal activity. The location and timing of future armed engagements is unpredictable. We recommend that you defer travel to the areas specifically identified in this Travel Warning and exercise extreme caution when traveling throughout the other areas for which advisories are in effect.\nU.S. citizens are encouraged to lower their personal profiles and to avoid displaying indicators of wealth such as expensive-looking jewelry, watches, or cameras. U.S. citizens are encouraged to maintain awareness of their surroundings and avoid situations in which they may be isolated or stand out as potential victims.\nKidnappings in Mexico have included traditional, \"express,\" and \"virtual\" kidnappings. Victims of traditional kidnappings are physically abducted and held captive until a ransom is paid for release. \"Express\" kidnappings are those in which a victim is abducted for a short time and forced to withdraw money, usually from an ATM, then released. A \"virtual\" kidnapping is an extortion-by-deception scheme wherein a victim is contacted by phone and convinced to isolate themselves from family and friends until a ransom is paid. The victim is coerced (by threat of violence) to remain isolated and to provide phone numbers for the victim's family or loved ones. The victim's family is then contacted and a ransom for the \"kidnapped\" extracted. Recently, some travelers to Mexico staying at hotels as guests have been targets of such \"virtual\" kidnapping schemes.\nOf particular safety concern are casinos, sports books, or other gambling establishments, and adult entertainment establishments. U.S. government personnel are specifically prohibited from patronizing these establishments in the states of Coahuila, Durango, Zacatecas, Aguascalientes, San Luis Potosi, Nuevo Leon, Tamaulipas, Jalisco, Colima and Nayarit.\nCarjacking and highway robbery are serious problems in many parts of the border region, and U.S. citizens have been murdered in such incidents. Most victims who complied with carjackers' demands have reported that they were not physically harmed. Carjackers have shot at vehicles that have attempted to flee. Incidents have occurred during the day and at night, and carjackers have used a variety of techniques, including roadblocks, bumping/moving vehicles to force them to stop, and running vehicles off the road at high speeds. There are indications that criminals target newer and larger vehicles, especially dark-colored SUVs. However, even drivers of old sedans and buses coming from the United States have been targeted. While violent incidents can occur anywhere and at any time, they most frequently occur at night and on isolated roads. To reduce risk when traveling by road, we strongly urge you to travel between cities throughout Mexico only during daylight hours, to avoid isolated roads, and to use toll roads (\"cuotas\") whenever possible.  U.S. government personnel are prohibited from intercity travel after dark in many areas of Mexico.  In remote areas, cell phone coverage is limited or non-existent.\nThe Mexican government has deployed federal police and military personnel throughout the country as part of its efforts to combat organized criminal groups. U.S. citizens traveling on Mexican roads and highways by car or bus may encounter government checkpoints, staffed by military or law enforcement personnel. In some places, criminal organizations have erected their own unauthorized checkpoints, at times wearing police and military uniforms, and have killed or abducted motorists who have failed to stop at them. You should cooperate at all checkpoints.\nDemonstrations are common and occur in all parts of the country. Even demonstrations intended to be peaceful can turn confrontational and escalate into violence. Protesters in Mexico may block traffic on roads, including major thoroughfares, or take control of toll booths on highways. Protestors may also block access to gas stations, and their presence at airports may cause flights to be delayed or suspended. U.S. citizens are urged to avoid areas of demonstrations, and to exercise caution if in the vicinity of any protests. Travelers who encounter protestors demanding unofficial tolls are generally allowed to pass upon payment. Travelers are urged not to exit from major highways. U.S. Citizens should avoid participating in demonstrations and other activities that might be deemed political by the authorities as the Mexican Constitution prohibits political activities by foreigners; such actions may result in detention, imprisonment, and/or deportation.\nThe Department imposes restrictions on U.S. government employees' travel in Mexico. Since July 2010, USG employees are prohibited from driving on non-official travel from the U.S.-Mexico border to or from the interior of Mexico or Central America. Personal travel by motor vehicle is permitted during daylight hours on Highway 15 toll road between Hermosillo and Nogales, on Highway 45 between Ciudad Juarez and Chihuahua City, and on the main roads between Palomas, Chihuahua and Nuevo Casas Grandes, Chihuahua.\nU.S. government personnel and their families are prohibited from personal travel to all areas to which it is advised to \"defer non-essential travel.” When travel for official purposes is essential, it is conducted with extensive security precautions. U.S. government personnel and their families are allowed to travel for personal reasons to the areas where no advisory is in effect or where the advisory is to exercise caution. While the general public is not forbidden from visiting places categorized under \"defer non-essential travel,\" U.S. government personnel will not be able to respond quickly to an emergency situation in those areas due to security precautions that must be taken by U.S. government personnel to travel to those areas. Travel at night is prohibited for U.S. government personnel in some states as indicated below.\nFor more information on road safety and crime along Mexico's roadways, see the Department of State's Country Specific Information.\nState-by-State Assessment: \nBelow is a state-by-state assessment of security conditions throughout Mexico. Travelers should be mindful that even if no advisories are in effect for a given state, crime and violence can still occur. For general information about travel and other conditions in Mexico, see our Country Specific Information.\nAguascalientes: Intercity travel at night is prohibited for U.S. government personnel.\n\nBaja California: Tijuana, Rosarito, Ensenada and Mexicali are major cities/travel destinations in the state of Baja California - Exercise caution in the northern state of Baja California, particularly at night. According to the Baja State Secretariat for Public Security, Tijuana and Rosarito continued to experience an increase in homicide rates from January to October 2015compared to the same period in the previous year. While most of these homicides appeared to be targeted criminal organization assassinations, turf battles between criminal groups have resulted in violent crime in areas frequented by U.S. citizens. Shooting incidents, in which innocent bystanders have been injured, have occurred during daylight hours.\n\nBaja California Sur: Cabo San Lucas and La Paz are major cities/travel destinations in the state of Southern Baja California – Exercise caution in the state capital of La Paz. According to the Department of Interior of Mexico, Baja California Sur registered its highest homicide rate ever as of October 2015. Many of these homicides have occurred in La Paz, where there has been an increase in public acts of violence between rival criminal organizations.\n\nCampeche: No advisory is in effect.\n\nChiapas: Palenque and San Cristobal de las Casas are major cities/travel destinations in Chiapas - No advisory is in effect.\n\nChihuahua: Ciudad Juarez, Chihuahua City, and Copper Canyon are major cities/travel destinations in Chihuahua - Exercise caution in traveling to: the business and shopping districts in the northeast section of Ciudad Juarez and its major industrial parks, the central downtown section and major industrial parks in the city of Chihuahua, the town of Palomas, the urban area of the city of Ojinaga, and the towns of Nuevo Casas Grandes and Casas Grandes and their immediate environs. Travel to the Nuevo Casas Grandes area should be through the Palomas port of entry (POE) on U.S. Highway 11, continuing south until reaching Mexico Highway 2 west to Nuevo Casas Grandes. Travel to Ojinaga should be on the U.S. side via U.S. Highway 67 through the Presidio POE. Defer non-essential travel to other areas in the state of Chihuahua and travel between cities only on major highways and only during daylight hours. Crime and violence remain serious problems throughout the state of Chihuahua, particularly in the southern portion of the state and in the Sierra Mountains, including Copper Canyon. \n\nCoahuila: Defer non-essential travel to the state of Coahuila. When traveling through the state, U.S. government personnel are allowed to travel only on toll highway 40 to highway 57 and only during daylight hours. Violence and criminal activity along the highways are continuing security concerns, particularly along the northern border between Piedras Negras and Nuevo Laredo. Please see above for general conditions for travel in Mexico. \n\nColima: Manzanillo is a major city/travel destination in Colima - Defer non-essential travel to the areas of the state of Colima that border the state of Michoacán, including the city of Tecoman. U.S. government personnel are generally prohibited from traveling within 12 miles of the Colima-Michoacán border. Intercity travel at night is prohibited for U.S. government personnel. \n\nDurango: Exercise caution in the state of Durango. Violence and criminal activity along the highways are a continuing security concern. U.S. government personnel may travel outside the city of Durango only during daylight hours on toll roads and must be in their hotel in the city of Durango to abide by an Embassy-imposed curfew of 1 a.m. to 6 a.m.\n\nEstado de Mexico: Toluca and Teotihuacan are major travel destinations in Estado de Mexico - Exercise caution in the State of Mexico. Due to high rates of crime and insecurity, defer non-essential travel to the municipalities of Coacalco, Ecatepec, Nezahualcoyotl, La Paz, Valle del Chalco, Solidaridad, Chalco, Ixtapaluca, and Tlatlaya, which are portions of the greater Mexico City metropolitan area, located just to the east of the Federal District of Mexico and Benito Juarez airport, unless traveling directly through the areas on major thoroughfares. Defer non-essential travel on any roads between Huitzilac, Morelos and Santa Martha, Estado de Mexico, including the Lagunas de Zempoala National Park and surrounding areas. Please see above for general conditions for travel in Mexico. \n\nGuanajuato: San Miguel de Allende and Leon are major cities/travel destinations in Guanajuato - No advisory is in effect. \n\nGuerrero: Acapulco, Ixtapa, Taxco and Zihuatanejo are major cities/travel destinations in Guerrero - Defer non-essential travel to all parts of the state, except for the cities of Acapulco, Ixtapa, and Zihuatanejo. Travel to Acapulco and Ixtapa/Zihuatanejo only by air or cruise ship, exercise caution, and remain in tourist areas. Travel in and out of Acapulco by air and cruise ship is permitted for U.S. government personnel. U.S. government personnel are prohibited from traveling within Guerrero state by land, including via the 95D toll road (“cuota”) to/from Mexico City and Acapulco, as well as highway 200 between Acapulco and Ixtapa/Zihuatanejo. In Acapulco, defer non-essential travel to areas further than two blocks inland of the Costera Miguel Aleman Boulevard, which parallels the popular beach areas. Lodging for U.S. government personnel is limited to the hotel zone (“zona hotelera”) of Acapulco, beginning from the Krystal Beach Acapulco hotel in the north and going south through Puerto Marquez, including the Playa Diamante area and ending at The Resort at Mundo Imperial hotel. In general, the popular tourist area of Diamante, just south of the city, has been less affected by violence. Any activity outside the hotel zone for U.S. government personnel is limited to the coastal area from La Quebrada to the beginning of the hotel zone and only during daylight hours. The state of Guerrero was the most violent state in Mexico in 2013, with 2,087 homicides and 207 reported cases of kidnapping, according to the Mexican Secretariado Ejecutivo Nacional de Seguridad Publica. Self-defense groups operate independently of the government in many areas of Guerrero. Armed members of these groups frequently maintain roadblocks and, although not considered hostile to foreigners or tourists, are suspicious of outsiders and should be considered volatile and unpredictable.\n\nHidalgo: No advisory is in effect. \n\nJalisco: Guadalajara, Puerto Vallarta, and Lake Chapala are major cities/travel destinations in Jalisco – Exercise caution throughout the state, particularly in rural areas and when using secondary highways. Defer non-essential travel to areas of the state that border the states of Michoacán and Zacatecas. The security situation along the Michoacán and Zacatecas borders continues to be unstable. U.S. government personnel are authorized to use Federal toll road 15D for travel to Mexico City; however, they may not stop in the town of La Barca or Ocotlan for any reason. Use of Highway 80 between Cocula and La Huerta is prohibited for personal travel by U.S. government personnel. U.S. government personnel are prohibited from personal travel to areas of Jalisco that border Zacatecas, and are prohibited from intercity travel at night. Please see above for general conditions for travel to Mexico.\n\nMexico City (also known as the Federal District): No advisory is in effect. See also the discussion in the section on Estado de Mexico for areas within the greater Mexico City metropolitan area.\n\nMichoacán: Morelia is a major city/travel destination in Michoacán - Defer non-essential travel to the state of Michoacán except the cities of Morelia and Lázaro Cardenas, and the area north of federal toll road 15D, where you should exercise caution. U.S. government employees are prohibited from traveling by land in Michoacán except on federal toll road 15D during daylight hours. Flying into Morelia and Lázaro Cardenas is permitted for U.S. government personnel. Please see above for general conditions for travel in Mexico. \n\n\nMorelos: Cuernavaca is a major city/travel destination in Morelos - Exercise caution in the state of Morelos. Defer non-essential travel on any roads between Huitzilac in the northwest corner of the state and Santa Marta, Estado de Mexico, including the Lagunas de Zempoala National Park and surrounding areas. Please see above for general conditions for travel in Mexico. \n\nNayarit: The Riviera Nayarit coast, including the cities of Tepic, Xalisco, and San Blas, is a major travel destination in Nayarit - U.S. government personnel may travel to Riviera Nayarit, San Blas, Santa María del Oro, Tepic, and Xalisco using major highways. Intercity travel at night is prohibited for U.S. government personnel. Defer non-essential travel to other areas of the state.\n\nNuevo Leon: Monterrey is a major city/travel destination in Nuevo Leon – Exercise caution in the state of Nuevo Leon. U.S. government personnel and their dependents may travel outside the city of Monterrey only during daylight hours on toll roads, and must return to the city of San Pedro Garza Garcia municipal boundaries to abide by a curfew of 1 a.m. and 6 a.m., except for travel to the airport after 5 a.m. Please see above for general conditions for travel in Mexico.\n\nOaxaca: Oaxaca, Huatulco and Puerto Escondido are major cities/travel destinations in Oaxaca - In Oaxaca city, U.S. citizens should avoid hiking around the auditorium and observatory at Cerro del Fortin, as foreigners are routinely held up at knifepoint and robbed in that area.\n\nPuebla: No advisory is in effect.\n\nQueretaro: No advisory is in effect.\n\nQuintana Roo: Cancun, Cozumel, Playa del Carmen, Riviera Maya and Tulum are major cities/travel destinations in Quintana Roo - No advisory is in effect. Exercise caution when traveling south of Felipe Carrillo Puerto or east of Jose Maria Morelos as cellular and internet service are virtually non-existent.\n\nSan Luis Potosi: Exercise caution in the state of San Luis Potosi. U.S. government personnel may travel outside the city of San Luis Potosi only during daylight hours on toll roads, and must be in their hotel in the city of San Luis Potosi between 1 a.m. to 6 a.m.to abide by an Embassy-imposed curfew.\n\nSinaloa: Mazatlan is a major city/travel destination in Sinaloa - Defer non-essential travel to the state of Sinaloa except the cities of Mazatlan, Los Mochis, and the Port of Topolobampo, where you should exercise caution. One of Mexico's most powerful criminal organizations is based in the state of Sinaloa, and violent crime rates remain high in many parts of the state. Travel in Mazatlan should be limited to Zona Dorada and the historic town center, as well as direct routes to and from these locations and the airport. Travel in Los Mochis and Topolobampo is restricted to the city and the port, as well as direct routes to/from these locations and the airport. Please see above for general conditions for travel in Mexico. \n\nSonora: Nogales, Puerto Peñasco, Hermosillo, and San Carlos are major cities/travel destinations in Sonora - Sonora is a key region in the international drug and human trafficking trades and can be extremely dangerous for travelers. Travelers throughout Sonora are encouraged to limit travel to main roads during daylight hours. Defer non-essential travel to the region west of Nogales, east of Sonoyta, and from Caborca north (including the towns of Saric, Tubutama, and Altar), and the eastern edge of Sonora bordering Chihuahua, as these are known centers of illegal activity. Travelers should also defer non-essential travel to the eastern edge of the state of Sonora, which borders the state of Chihuahua (all points along that border east of the northern city of Agua Prieta and the southern town of Alamos), and defer non-essential travel within the city of Ciudad Obregon and south of the city of Navojoa. You should exercise caution while transiting Vicam in southern Sonora due to roadblocks that can be instituted ad hoc by local indigenous and environmental groups. U.S. citizens visiting Puerto Peñasco should use the Lukeville, Arizona/Sonoyta, Sonora border crossing, and limit driving to daylight hours. Please see above for general conditions for travel in Mexico. \n\nTabasco: Villahermosa is a major city/travel destination in Tabasco- No advisory is in effect.\n\nTamaulipas: Matamoros, Nuevo Laredo, Reynosa, and Tampico are major cities in Tamaulipas. Defer all non-essential travel to the state of Tamaulipas. Throughout the state violent crime, including homicide, armed robbery, carjacking, kidnapping, extortion, and sexual assault, pose significant safety risks. State and municipal law enforcement capacity is limited to nonexistent in many parts of Tamaulipas. Violent conflicts between rival criminal elements and/or the Mexican military can occur in all parts of the region and at all times of the day. Violent criminal activity occurs more frequently along the northern border. Organized criminal groups sometimes target public and private passenger buses traveling through Tamaulipas. These groups sometimes take all passengers hostage and demand ransom payments. In Tamaulipas, U.S. government employees are subject to movement restrictions and a curfew between midnight and 6 a.m. Matamoros, Reynosa, Nuevo Laredo, and Ciudad Victoria have experienced numerous gun battles and attacks with explosive devices in the past year. The number of reported kidnappings in Tamaulipas is among the highest in Mexico. Please see above for general conditions for travel in Mexico.\n\nTlaxcala: No advisory is in effect. \n\nVeracruz: No advisory is in effect.  \n\nYucatan: (includes Merida and Chichen Itza) - No advisory is in effect. \n\nZacatecas: Exercise caution in the state of Zacatecas. U.S. government personnel may travel outside the city of Zacatecas only during daylight hours on toll roads. In the city of Zacatecas, U.S. government personnel must abide by an Embassy-imposed curfew of 1 a.m. to 6 a.m.\n\nFor further information:\n\nSee the State Department's travel website for the Worldwide Caution, Travel Warnings, Travel Alerts, and Country Specific Information for Mexico.\nEnroll in the Smart Traveler Enrollment Program (STEP) to receive security messages and make it easier to locate you in an emergency.\nContact the U.S. Embassy in Mexico, located at Paseo de la Reforma 305, Colonia Cuauhtemoc, at +52-55-5080-2000 x4440, (5080-2000 for calls in Mexico City, 01-55-5080-2000 for long distance calls in Mexico) 8:30 a.m. to 3:00 p.m. Monday through Friday. After-hours emergency number for U.S. citizens is +52-55-5080-2000.\nCall 1-888-407-4747 toll-free in the United States and Canada or 1-202-501-4444 from other countries from 8:00 a.m. to 8:00 p.m. Eastern Standard Time, Monday through Friday (except U.S. federal holidays).\nFollow us on Twitter and Facebook.\n\nConsulates (with consular districts):\n\nCiudad Juarez (Chihuahua): Paseo de la Victoria 3650, telephone. +52-656-227-3000.\nGuadalajara (Nayarit, Jalisco, Aguas Calientes, and Colima): Progreso 175, telephone +52-333-268-2100.\nHermosillo (Sinaloa and the southern part of the state of Sonora): Avenida Monterrey 141, telephone +52-662-289-3500.\nMatamoros (the southern part of Tamaulipas with the exception of the city of Tampico): Avenida Primera 2002, telephone +52-868-812-4402.\nMerida (Campeche, Yucatan, and Quintana Roo): Calle 60 no. 338-K x 29 y 31, Col. Alcala Martin, Merida, Yucatan, Mexico 97050, telephone +52-999-942-5700 or 202-250-3711 (U.S. number).\nMonterrey (Nuevo Leon, Durango, Zacatecas, San Luis Potosi, and the southern part of Coahuila):Prolongacion Ave. Alfonso Reyes No. 150, Col. Valle Poniente, Santa Catarina, Nuevo Leon, 66196, telephone +52-818-047-3100.\nNogales (the northern part of Sonora): Calle San Jose, Nogales, Sonora, telephone +52-631-311-8150.\nNuevo Laredo (the northern part of Coahuila and the northwestern part of Tamaulipas): Calle Allende 3330, Col. Jardin, telephone +52-867-714-0512.\nTijuana (Baja California Norte and Baja California Sur): Paseo de Las Culturas s/n Mesa de Otay, telephone +52-664-977-2000.\nAll other Mexican states, the Federal District of Mexico City, and the city of Tampico, Tamaulipas, are part of the Embassy's consular district. The U.S. Embassy is located in Mexico City at Paseo de la Reforma 305, Colonia Cuauhtemoc, telephone from the United States: 011-52-55-5080-2000; telephone within Mexico City: 5080-2000; telephone long distance within Mexico: 01-55-5080-2000.\n\nConsular Agencies:\n\nAcapulco: Hotel Emporio, Costera Miguel Aleman 121 – Suite 14, telephone +52-744-481-0100 or +52-744-484-0300.\nCancún: Blvd. Kukulcan Km 13 ZH Torre La Europea, Despacho 301 Cancun, Quintana Roo, Mexico C.P. 77500, telephone +52-998-883-0272.\nLos Cabos: Las Tiendas de Palmilla Local B221, Carretera Transpeninsular Km. 27.5, San José del Cabo, BCS, Mexico 23406 telephone, +52-624-143-3566 Fax: +52-624-143-6750.\nMazatlán: Playa Gaviotas #202, Zona Dorada, telephone +52-669-916-5889.\nOaxaca: Macedonio Alcalá no. 407, interior 20, telephone +52-951-514-3054, +52-951-516-2853.\nPiedras Negras: Abasolo #211, Zona Centro, Piedras Negras, Coah., telephone, +52-878-782-5586.\nPlaya del Carmen: \"The Palapa,\" Calle 1 Sur, between Avenida 15 and Avenida 20, telephone +52-984-873-0303 or 202-370-6708(U.S. number).\nPuerto Vallarta: Paradise Plaza, Paseo de los Cocoteros #1, Local #4, Interior #17, Nuevo Vallarta, Nayarit, telephone +52-322-222-0069.\nSan Miguel de Allende: Centro Comercial La Luciernaga, Libramiento Manuel Zavala (Pepe KBZON), telephone +52-415-152-2357.",
      "colorClass": "alert-warning",
      "source": "US State Department",
      "textOverview": "The U.S. Department of State warns U.S. citizens about the risk of traveling to certain places in Mexico due to threats to safety and security posed by organized criminal groups in the country."
    }
  ],
  "SC": [
    {
      "type": "Alert",
      "startDate": "2015-12-15T05:00:00.000Z",
      "link": "http://travel.state.gov/content/passports/en/alertswarnings/seychelles-travel-alert.html",
      "text": "The U.S. Department of State alerts U.S. citizens residing in or traveling to Seychelles of the upcoming Presidential election scheduled to take place December 16 -18.   U.S. citizens are advised to avoid political rallies and demonstrations during the election season.  This Travel Alert expires on January 15, 2016.\n\n\r\n\r\n\n\r\n\r\n\r\n\r\nNumerous public rallies and high-profile political events are expected to take place leading up to the election.  These activities will lead to increased pedestrian and vehicular traffic throughout the period. \nPrevious elections in Seychelles have generally been peaceful; however, even peaceful demonstrations can quickly turn violent with little or no warning.  You should avoid areas where rallies and demonstrations are taking place, and exercise caution in the vicinity of large gatherings.\nRemain aware of your surroundings, including local events, and monitor local news stations for updates.  Maintain a high level of vigilance and take appropriate steps to enhance your personal security.  You should also be aware that in an emergency situation, mobile phone networks can be overwhelmed with call volume, making cellular communication difficult.\nFor further information:\n\nSee the State Department's travel website for the Worldwide Caution, Travel Warnings, Travel Alerts, and Seychelles Country Specific Information.\n\nEnroll in the Smart Traveler Enrollment Program (STEP) to receive security messages and make it easier to locate you in an emergency. \n\nThe U.S. Consular Agency is located on the second floor of the Oliaji Trade Center in Victoria, Mahe.  Email usconsular@seychelles.net or call (248) 422 52 56.  The Agency is open on Tuesday, Wednesday, and Thursday from 8:30 to 12:30.  In an after-hours emergency, please call (230) 5253-3641 for the U.S. Embassy duty officer in Port Louis or (248) 251 52 56 for the Seychelles consular agent.\n\nCall 1-888-407-4747 toll-free in the United States and Canada or 1-202-501-4444 from other countries from 8:00 a.m. to 8:00 p.m. Eastern Standard Time, Monday through Friday (except U.S. federal holidays).",
      "colorClass": "alert-danger",
      "source": "US State Department",
      "textOverview": "The U.S. Department of State alerts U.S. citizens residing in or traveling to Seychelles of the upcoming Presidential election scheduled to take place December 16 -18."
    }
  ],
  "CG": [
    {
      "type": "Warning",
      "startDate": "2015-12-04T05:00:00.000Z",
      "link": "http://travel.state.gov/content/passports/en/alertswarnings/democratic-republic-of-the-congo-travel-warning.html",
      "text": "The Department of State warns U.S. citizens of the risks of travel to the Democratic Republic of the Congo (a.k.a. DRC or Congo-Kinshasa).  U.S. citizens should avoid all but essential travel to the provinces of North Kivu, South Kivu, the provinces of Bas-Uele, Haut-Uele and Ituriz (northeastern part of the former Oriental Province) and particularly the new provinces of Tanganyika and Haut-Lomami (northeastern and central parts of the former province of Katanga), where instability and sporadic violence continues. Very poor transportation infrastructure throughout the country and poor security conditions in eastern DRC make it difficult for the U.S. Embassy to provide consular services anywhere outside of Kinshasa. This replaces the Travel Warning dated November 25, 2014.\n\r\n\r\n\n\r\n\r\n\r\n\r\nArmed groups, bandits, and elements of the Congolese armed forces, primarily located in the North Kivu, South Kivu, and the new provinces of Bas-Uele, Haut Uele, Tanganyika, Haut-Lomami, and the eastern part of Maniema Province, are known to kill, rape, kidnap, pillage, steal vehicles, and carry out military or paramilitary operations in which civilians can be indiscriminately targeted. Kidnapping for ransom is common, particularly in areas north and west of Goma, North Kivu. Military operations continue to target the Democratic Forces for the Liberation of Rwanda throughout North and South Kivu, the Allied Democratic Forces in the Beni territory of North Kivu, and numerous other armed groups in the eastern Congo. The Lord's Resistance Army operates near the DRC’s borders with Central African Republic and the Republic of South Sudan, particularly in and around Garamba National Park.\nTravelers are frequently detained and questioned by poorly trained security forces at numerous official and unofficial roadblocks and border crossings throughout the country and especially near government buildings and installations in Kinshasa. Requests for bribes are extremely common, and security forces have occasionally injured or killed people who refuse to pay. If stopped at a roadblock, remain cautious. In the past year, several U.S. citizens have been illegally detained by government forces or robbed of their valuables while being searched.\nNational elections are scheduled to take place in November 2016. Political protests and demonstrations with the potential for violence may occur before, during, or after the election. U.S. citizens are urged to exercise caution, avoid any politically-related demonstrations or protests, and remain abreast of the security situation throughout the election period.\nDemonstrations, gatherings and even sporting events that are intended to be peaceful can become violent and turn deadly. Closely monitor local and international news from reliable sources. English-language news can be found on BBC at 92.6 FM. Radio Okapi broadcasts in French on 103.5 FM at 0700, 0800, 1200, and 1800 hours, and provides updates throughout the day. In emergencies, the Belgian Embassy operates a French-language radio broadcast system at FM 98.8. \nMany infectious diseases are endemic in the country, and outbreaks of potentially deadly infectious diseases can also occur without warning. See the Centers for Disease Control website for further information. Travelers should consult with their healthcare provider before traveling to the DRC for applicable vaccinations and malaria prophylaxis.  Ensure that medical insurance includes medevac coverage. \nFor further information:\n\nSee the State Department's travel website for the Worldwide Caution, Travel Warnings, Travel Alerts, and Country Specific Information for Democratic Republic of the Congo. \nEnroll in the Smart Traveler Enrollment Program (STEP). \nU.S. citizens who decide to travel to or remain in the DRC despite this Travel Warning are urged to provide their current contact information and next-of-kin information through STEP.  \nContact the U.S. Embassy in the DRC, located on 310 Avenue des Aviateurs in Kinshasa, including for after-hours emergencies at +243-81-556-0151; callers within the DRC should dial 081-556-0151 from 8:00 a.m. to 5:00 p.m. Monday through Thursday and 8:00 a.m. to 12:00 p.m. on Friday. \nCall 1-888-407-4747 toll-free in the United States and Canada or 1-202-501-4444 from other countries from 8:00 a.m. to 8:00 p.m. Eastern Standard Time, Monday through Friday (except U.S. federal holidays).\nFollow us on Twitter and Facebook.",
      "colorClass": "alert-warning",
      "source": "US State Department",
      "textOverview": "The Department of State warns U.S. citizens of the risks of travel to the Democratic Republic of the Congo (a.k.a. DRC or Congo-Kinshasa)."
    }
  ],
  "BF": [
    {
      "type": "Alert",
      "startDate": "2015-11-24T05:00:00.000Z",
      "link": "http://travel.state.gov/content/passports/en/alertswarnings/burkina-faso-travel-alert.html",
      "text": "The U.S. Department of State alerts U.S. citizens residing in or traveling to Burkina Faso of the upcoming presidential and legislative elections scheduled for November 29. U.S. citizens are reminded of the risks of travel to Burkina Faso and urged to exercise caution while traveling within Burkina Faso during the election season.  This Travel Alert expires on January 23, 2016.\n\n\r\n\r\n\n\r\n\r\n\r\n\r\nCampaigning, which began on November 8, will continue until elections are held on November 29.  A second round of elections could occur if no candidate obtains an absolute majority in the first round.\nThere is potential for sporadic civil disruptions throughout the presidential and legislative election period, including demonstrations, which can be spontaneous and occur with little or no advance warning throughout Burkina Faso.\n\nU.S. citizens in Burkina Faso should remain vigilant and utilize appropriate personal security practices.  Avoid political rallies, campaign events, polling stations, demonstrations, protests, and other large gatherings in the weeks before and after elections; maintain situational awareness and exercise good judgment; stay alert and aware of your surroundings at all times; and stay abreast of the situation through media outlets.  U.S. citizens should maintain adequate supplies of food, water, essential medicines, and other supplies to shelter in place for at least 72 hours should this become necessary.  Additional recommendations on emergency preparedness are available on the Travel.State.gov web page Emergencies Abroad.\nFor further information:\n\nSee the State Department's travel website for the Worldwide Caution, Travel Warnings, Travel Alerts, and Country Specific Information for Burkina Faso.\nEnroll in the Smart Traveler Enrollment Program (STEP) to receive security messages and make it easier to locate you in an emergency.\nContact the U.S. Embassy Ouagadougou, in Ouaga 2000, Sector 15, on Avenue Sembene Ousmane, southeast of the Monument aux Héros Nationaux, at (+226) 25-49-53-00, 7:30 a.m. to 5:00 p.m. Monday through Thursday and 7:30 a.m. to 12:30 p.m. on Friday. If you are a U.S. citizen in an emergency situation after normal Embassy operating hours, please contact the Embassy, dial “1,” and ask to be connected to the duty officer.\nCall 1-888-407-4747 toll-free in the United States and Canada or 1-202-501-4444 from other countries from 8:00 a.m. to 8:00 p.m. Eastern Standard Time, Monday through Friday (except U.S. federal holidays).",
      "colorClass": "alert-danger",
      "source": "US State Department",
      "textOverview": "The U.S. Department of State alerts U.S. citizens residing in or traveling to Burkina Faso of the upcoming presidential and legislative elections scheduled for November 29."
    },
    {
      "type": "Warning",
      "startDate": "2016-01-20T05:00:00.000Z",
      "link": "http://travel.state.gov/content/passports/en/alertswarnings/burkina-faso-travel-warning.html",
      "text": "The Department of State warns U.S. citizens of the risks of travel to Burkina Faso.  U.S. citizens in Burkina Faso, and those considering travel to Burkina Faso, should evaluate their personal security situation in light of continuing threats to safety and security. The ability of the U.S. Embassy to provide consular services in remote and rural areas is limited.  U.S. citizens should take steps to mitigate the risk of becoming a victim of violent acts, and reduce exposure to locations routinely frequented by Westerners.  This Travel Warning replaces the Travel Warning issued on October 9, 2015. \n\r\n\r\n\n\r\n\r\n\r\n\r\nCitizens who decide to remain in Burkina Faso despite this travel warning should maintain situational awareness at all times and register their presence within Burkina Faso with the Embassy by enrolling in the Smart Traveler Enrollment Program.  \nThe security environment in Burkina Faso is fluid and the potential for attacks throughout the country, including in Ouagadougou, remains.  On January 15, armed assailants attacked civilians at the Splendid Hotel and Cappuccino restaurant with gunfire and explosives.  People from 18 different countries were murdered in the attack, including one U.S. citizen.  Violent extremist and militant elements, including al-Qaeda in the Lands of Islamic Maghreb (AQIM) and al-Murabitun, have claimed responsibility for the attack. \nAlso on January 15, two gendarmerie officers were killed in an attack on their patrol near the mining town of Tinakoff (10km from the Malian border) and two Australian citizens were kidnapped in Baraboule, near the border with Mali.  They are allegedly being held by a group with links to al-Qaeda.\nIn 2015, a Romanian citizen was kidnapped at the Tambao manganese mining site (near the Nigerien border) by the extremist group al-Murabitun; gendarmerie outposts in Oursi and Samorogouan were attacked and several people were killed; and a complex attack (involving improvised explosive devices, RPGs, and small arms) on a gold convoy near Djibo resulted in one death.  Investigations into these incidents are ongoing.\nThe U.S. Embassy has placed restrictions on official government travel to Dori, Djibo, the road that connects these cities, and all areas north of that road.  Embassy personnel are also prohibited from traveling to or staying at Parc National du W (Parc W), the regional national park located on Burkina Faso’s southeastern border with Niger and Benin.  U.S. citizens are encouraged to follow the same guidance.\nFor further information:\n\nSee the State Department's travel website for the Worldwide Caution, Travel Warnings, Travel Alerts, and Country Specific Information for Burkina Faso.\nEnroll in the Smart Traveler Enrollment Program (STEP) to receive security messages and make it easier to locate you in an emergency.\nContact the U.S. Embassy Ouagadougou, in Ouaga 2000, Sector 15, on Avenue Sembene Ousmane, southeast of the Monument aux Héros Nationaux, at (+226) 25-49-53-00, 7:30 a.m. to 5:00 p.m. Monday through Thursday and 7:30 a.m. to 12:30 p.m. on Friday. If you are a U.S. citizen in an emergency situation after normal Embassy operating hours, please contact the Embassy, dial “1,” and ask to be connected to the duty officer.\nCall 1-888-407-4747 toll-free in the United States and Canada or 1-202-501-4444 from other countries from 8:00 a.m. to 8:00 p.m. Eastern Standard Time, Monday through Friday (except U.S. federal holidays).",
      "colorClass": "alert-warning",
      "source": "US State Department",
      "textOverview": "The Department of State warns U.S. citizens of the risks of travel to Burkina Faso.  U.S. citizens in Burkina Faso, and those considering travel to Burkina Faso, should evaluate their personal security situation in light of continuing threats to safety and security."
    }
  ],
  "MR": [
    {
      "type": "Warning",
      "startDate": "2016-02-23T05:00:00.000Z",
      "link": "http://travel.state.gov/content/passports/en/alertswarnings/mauritania-travel-warning.html",
      "text": "The U.S. Department of State warns U.S. citizens of the risks of traveling to Mauritania, particularly the eastern regions, due to activities by terrorist groups including al-Qaida in the Islamic Maghreb (AQIM), which are active in the neighboring regions of Mali. The ability of the U.S. Embassy to provide consular services in remote and rural areas of Mauritania is severely limited.  This replaces the Travel Warning for Mauritania dated October 2014, to update U.S. citizens on the current security situation.\n\r\n\r\n\n\r\n\r\n\r\n\r\nKidnapping and other violent acts, including by terrorist groups, have occurred in the past in the border regions of Guidimagha, Hodh El Charghi and Hodh El Gharbi near the south-eastern border with Mali, the eastern half of the Assaba region (east of Kiffa), Tidjikja, the eastern half of the Tagant region (east of Tidjikja), the eastern half of the Adrar region (east of Ouadane), and the Zemmour region of northern Mauritania (other than F’Derick and Zouerat).  Aside from the security risks, the remoteness and harsh environment of these areas present safety challenges as well.  The government of Mauritania has designated most of this area as a restricted security zone.  Entry into this region requires permission from the Mauritanian authorities.\nAQIM and al-Murabitun terrorist organizations and affiliates have declared their intention to attack foreign targets in north and west Africa (particularly the Sahel region bordering the Sahara).  In recent years, AQIM terrorist activity in Mauritania included kidnapping, murder, and attacks on foreign diplomatic missions and private citizens, gendarme military installations and personnel.  Although not currently active in Mauritania, the threat of terrorism remains.  Christian faith-based organizations operating in Mauritania, or individuals perceived to be proselytizing, may be targeted.\nU.S. Embassy personnel are restricted from traveling outside Nouakchott unless specifically authorized to do so, and then only during daylight hours.  U.S. citizens should take these restrictions into account when planning travel. \nU.S. citizens in Mauritania should be vigilant and aware of their surroundings at all times.  They should maintain good personal security practices, including always locking their homes and cars, varying routes and times of travel.  U.S. citizens should be particularly alert when frequenting locales associated with foreigners, including grocery stores, hotels, cultural centers, social and recreation clubs, beach areas, and restaurants.  Additionally, U.S. citizens should avoid demonstrations and highly publicized events/venues with no visible security presence.\nLandmines remain a danger along the border with the Western Sahara.  Travelers should cross borders only at designated border posts.\nFor further information:\n\nSee the State Department's travel website for the Worldwide Caution, Travel Warnings, Travel Alerts, and Mauritania Country Specific Information.\nEnroll in the Smart Traveler Enrollment Program (STEP).\nContact the U.S. Embassy Nouakchott located between the presidency building and the Spanish Embassy on Rue Abdallaye B. P. 222, Nouakchott, at (222) 4525-2660, 4525-1145, or 4525-3038 8:00a.m – 5:00p.m. Monday – Thursday, and 8:00am – 12:00pm on Friday.  After-hours emergency number for U.S. citizens is (222) 4525-3288.\nCall 1-888-407-4747 toll-free in the United States and Canada or 1-202-501-4444 from other countries from 8:00 a.m. to 8:00 p.m. Eastern Standard Time, Monday through Friday (except U.S. federal holidays).",
      "colorClass": "alert-warning",
      "source": "US State Department",
      "textOverview": "The U.S. Department of State warns U.S. citizens of the risks of traveling to Mauritania, particularly the eastern regions, due to activities by terrorist groups including al-Qaida in the Islamic Maghreb (AQIM), which are active in the neighboring regions of Mali."
    }
  ],
  "TD": [
    {
      "type": "Warning",
      "startDate": "2015-11-10T05:00:00.000Z",
      "link": "http://travel.state.gov/content/passports/en/alertswarnings/chad-travel-warning.html",
      "text": "This Travel Warning informs U.S. citizens that the Department of State has terminated the Authorized Departure status for non-emergency personnel and dependents, who had previously departed Chad.  These individuals may now return to the Embassy. The State Department nevertheless continues to warn U.S. citizens of the risks of travel to Chad. This replaces the Travel Warning issued on October 2.\n\r\n\r\n\n\r\n\r\n\r\n\r\nU.S. citizens already in Chad should continue to avoid all travel to border regions, particularly those areas adjacent to Chad’s eastern border and the Lake Chad region. The U.S. Embassy’s ability to provide consular services is limited in remote and rural areas. All U.S. citizens should review their personal security and have evacuation plans that can be carried out quickly. Do not rely solely on U.S. government assistance. All U.S. citizens affiliated with humanitarian relief efforts in eastern Chad should have an evacuation plan developed with the United Nations agency coordinating their work.\nViolent extremist organizations in the region, such as Boko Haram (The Islamic State in the West Africa Province) and al-Qai’da in the Lands of the Islamic Maghreb, are intent on harming Westerners and Western interests and are able to cross borders easily. On June 15 and July 11, Boko Haram conducted suicide attacks in N’Djamena targeting a police station and a market. The group continues to be extremely active in Chad, targeting local security forces and civilians in the Lake Chad region. Kidnapping for ransom is also a threat in the region.\nChad’s security environment is volatile and can deteriorate unexpectedly, especially along the border areas. There are Travel Warnings for neighboring Cameroon, Central African Republic (CAR), Libya, Niger, Nigeria, and Sudan. U.S. citizens should also note there are minefields along the borders with Libya and Sudan, and that borders can close without warning.\nU.S. citizens should take steps to mitigate the risk of becoming a victim of violent crime or terrorism by being vigilant and aware of their surroundings, especially at public gatherings and locations frequented by foreigners, such as markets, restaurants, bars, and places of worship. Avoid crowds, especially those associated with car accidents, since these incidents can become confrontational. Similarly, avoid demonstrations because even peaceful assemblies can turn violent.\nAll U.S. government personnel require authorization from the U.S. Embassy to travel outside of N'Djamena, and may be subject to other restrictions, including curfews, as security situations warrant. U.S. citizens should consider taking similar precautions when making travel plans. Exercise caution throughout the country, especially at night.\nFor further information:\n\nSee the State Department's travel website for the Worldwide Caution, Travel Warnings, Travel Alerts, and Country Specific Information for Chad.\nEnroll in the Smart Traveler Enrollment Program (STEP). Be sure to provide your current contact and next-of-kin information in STEP.\nContact the U.S. Embassy in N’Djamena, located on Avenue Felix Eboue, at +(235) 2251-62-11, 2251-70-09, 2251-77-59, 2251-90-52, 2251-92-18, and 2251-92-33 from 8:00 a.m. to 5:00 p.m. Monday through Thursday and 8:00 a.m. to 12:00 p.m. on Friday. After-hours emergency number for U.S. citizens is +235 6662-2100.\nCall 1-888-407-4747 toll-free in the United States and Canada or 1-202-501-4444 from other countries from 8:00 a.m. to 8:00 p.m. Eastern Standard Time, Monday through Friday (except U.S. federal holidays).\nFollow us on Twitter and Facebook.",
      "colorClass": "alert-warning",
      "source": "US State Department",
      "textOverview": "This Travel Warning informs U.S. citizens that the Department of State has terminated the Authorized Departure status for non-emergency personnel and dependents, who had previously departed Chad."
    }
  ],
  "SO": [
    {
      "type": "Warning",
      "startDate": "2015-10-01T04:00:00.000Z",
      "link": "http://travel.state.gov/content/passports/en/alertswarnings/somalia-travel-warning.html",
      "text": "The U.S. Department of State continues to warn U.S. citizens to avoid all travel to Somalia. This replaces the Travel Warning dated October 24, 2014, to update information on security concerns.\n\r\n\r\n\n\r\n\r\n\r\n\r\nThere is no U.S. Embassy or other formal U.S. diplomatic facility in Somalia at this time. Consequently, the U.S. government is not in a position to assist or effectively provide services to U.S. citizens in Somalia. In light of this and continuous security threats, the U.S. government recommends that U.S. citizens avoid all travel to Somalia.\n\nThe security situation in Somalia remains unstable and dangerous. Terrorist operatives and armed groups in Somalia continue to attack Somali authorities, the African Union Mission in Somalia (AMISOM), and other non-military targets. Kidnapping, bombings, murder, illegal roadblocks, banditry, and other violent incidents and threats to U.S. citizens and other foreign nationals can occur in any region of Somalia. In addition, there is a particular threat to foreigners in places where large crowds gather and Westerners frequent, including airports, government buildings, and shopping areas. Inter-clan and inter-factional fighting can flare up with little or no warning.\n\nWhile some parts of south/central Somalia are now under Somali government control with the military support of African Union forces, al-Shabaab, an Al-Qaida affiliate, has demonstrated the capability to carry out attacks in government-controlled territory with particular emphasis on targeting government facilities, foreign delegations’ facilities and movements, and commercial establishments frequented by government officials, foreign nationals, and the Somali diaspora. In February 2012, al-Shabaab announced that it had merged with Al-Qaida.\n\nAl-Shabaab-planned assassinations, suicide bombings, and indiscriminate armed attacks in civilian populated areas are frequent in Somalia. On December 25, 2014, al-Shabaab conducted an attack within the Mogadishu International Airport secure perimeter resulting in the deaths of at least eight individuals, including one U.S. citizen. Al-Shabaab remains intent on conducting attacks at popular restaurants, hotels, and convoys. This year, there have been at least four prominent hotel attacks located in the heart of the Somali capital. One U.S. citizen was killed in those attacks. Separately, in late April, a car bomb detonated adjacent to a favorite eatery frequented by government ministries and presidential palace officials. In late-June, a car bomb targeted United Arab Emirates military instructors near a military hospital, killing at least three Somali soldiers. Additionally, in January, a suicide car bomber killed at least six people in a strike apparently aimed at a Turkish government convey the day before that country’s president was to arrive in Somalia.\nKidnappings remain a daily threat in Somalia – to include Somaliland and Puntland - in addition to larger assaults, assassinations, and grenade attacks. Beyond the high profile attacks noted above, al-Shabaab has also claimed responsibility for other regional terrorist attacks.\nPirates and other criminals have specifically targeted and kidnapped foreigners working in Somalia. In January 2012, a U.S. citizen was kidnapped while on work-related travel in Somalia and in October 2011, a U.S. citizen aid worker living in Somalia was also kidnapped. In both cases, as well as in recent kidnappings of other Westerners, the victims took precautionary measures by hiring local security personnel, but those hired to protect them may have played a role in the abductions. A strong familiarity with Somalia and/or extensive prior travel to the region does not reduce travel risk. U.S. citizens considering travel to Somalia, including Somaliland and Puntland, are advised to obtain kidnap and recovery insurance, as well as medical evacuation insurance, prior to travel.\n\nAdditionally, U.S. citizens are urged to avoid sailing near the coast of Somalia as attacks have occurred as far as 1,000 nautical miles off the coast in international waters. Merchant vessels, fishing boats, and recreational craft all risk seizure by pirates and having their crews held for ransom in the waters off the Horn of Africa, especially in the international waters near Somalia. Somali pirates captured and killed four U.S. citizens aboard their boat on February 22, 2011. If transit around the Horn of Africa is necessary, it is strongly recommended that vessels travel in convoys, maintain good communications contact at all times, and follow the guidance provided by the Maritime Security Center – Horn of Africa (MSC-HOA). You should consult the Maritime Administration’s Horn of Africa Piracy page for information on maritime advisories, self-protection measures, and naval forces in the region.\nThe United States continues to be concerned about the risks to U.S. civil aviation operating in the territory and airspace of Somalia due to the hazards associated with terrorist and militant activity. The Federal Aviation Administration (FAA) has prohibited U.S. civil aviation from flying below flight level (FL) 260 in the territory and airspace of Somalia. For additional background information regarding FAA flight prohibitions and advisories for U.S. civil aviation, U.S. citizens should consult the Federal Aviation Administration’s Prohibitions, Restrictions and Notices.\n\nFor further information:\n\n\nSee the State Department's travel website for the Worldwide Caution, Travel Warnings, Travel Alerts, and the Country Specific Information for Somalia.\nEnroll in the Smart Traveler Enrollment Program (STEP) to receive security messages and make it easier to locate you in an emergency.\nContact the U.S. Embassy in Kenya located on United Nations Avenue, Nairobi, at +254 (0) 20 363 6451 7:15 a.m. to 4:30 p.m. Monday through Thursday and 7:15 a.m. to 12:15 p.m. on Friday. After-hours emergency number for U.S. citizens is +254 (0) 20 363 6170.\nCall 1-888-407-4747 toll-free in the United States and Canada or 1-202-501-4444 from other countries from 8:00 a.m. to 8:00 p.m. Eastern Standard Time, Monday through Friday (except U.S. federal holidays).\nFollow us on Twitter and Facebook.",
      "colorClass": "alert-warning",
      "source": "US State Department",
      "textOverview": "The U.S. Department of State continues to warn U.S. citizens to avoid all travel to Somalia."
    }
  ],
  "CM": [
    {
      "type": "Warning",
      "startDate": "2015-12-22T05:00:00.000Z",
      "link": "http://travel.state.gov/content/passports/en/alertswarnings/cameroon-travel-warning.html",
      "text": "The Department of State warns U.S. citizens of the high risk of traveling to Cameroon, and urges U.S. citizens to avoid all travel to the North and Far North Regions of the country because of the general threat of violent crime, terrorism, and the targeting of westerners for murder and kidnappings, particularly by the extremist terrorist group Boko Haram.  There is a growing threat in the East Region, where former Seleka and criminal elements from the Central African Republic (CAR) occasionally cross the border into Cameroon to steal property and take hostages for ransom. Because of the security situation in the country, the U.S. Embassy’s ability to provide consular services in remote and rural areas is extremely limited. This replaces the Travel Warning issued on September 30, 2015 to emphasize the increasing criminal threat in the eastern part of the Adamawa Region.\n\r\n\r\n\n\r\n\r\n\r\n\r\nThe Boko Haram terrorist group is active in the Far North Region, and has actively targeted foreign residents, tourists, and government leaders, which may place U.S. citizens traveling to or living in the Far North and North Regions of Cameroon at risk. Twenty one foreigners have been reported kidnapped since 2013.  Since July 2015, the group has carried out at least 14 suicide bombings in the North and Far North Regions, including the city of Maroua.  The U.S. Embassy continues to maintain restrictions on travel by U.S. official personnel to the North, Far North, and East Regions of Cameroon, as well as any travel north of Ngaoundere in the Adamawa Region.  Due to increased criminal activity, the Embassy has now implemented a similar travel restriction east of Ngaoundere in the Adamawa Region.\nU.S. citizens should exercise extreme caution when traveling within 60 miles/100 kilometers of the border with Nigeria’s Adamawa State in the North and Adamawa Regions of Cameroon, the border area with Chad, and the border areas with CAR. Violence, banditry, and military operations in border areas can quickly spill over into Cameroon.  Note there are Travel Warnings for neighboring Nigeria, Chad, and CAR. Additionally, the threat of piracy is present in the waters of the Bakassi peninsula in the Gulf of Guinea.\nCriminal activity continues to be a major concern, particularly in Yaounde, Douala, and other towns.  Burglaries, armed robberies, theft by intimidation, and snatch-and-grab crimes are commonplace in these areas.  High unemployment and an under-equipped police force exacerbate the situation.  An influx of refugees fleeing conflict in CAR and Nigeria has strained Cameroon’s economy and added population to already crowded urban areas.  Road banditry, especially along the eastern border with CAR, is reported periodically. \nFor further information:\n\nSee the State Department's travel website for the Worldwide Caution, Travel Warnings, Travel Alerts, and Country Specific Information for Cameroon.\nEnroll in the Smart Traveler Enrollment Program (STEP).  U.S. citizens who decide to travel to or remain in Cameroon despite this Travel Warning are urged to provide their current contact information and next-of-kin information through STEP. \nContact the U.S. Embassy in Cameroon located on Avenue Rosa Parks close to the Mont Febe Golf Club in Yaounde, at +237 22220-1500 ext. 4341/4023 from 8:00 a.m. to 5:00 p.m. Monday through Thursday and 8:00 a.m. to 12:00 p.m. on Friday. After-hours emergency number for U.S. citizens is +237 22220-1500 ext. 4531.\nCall 1-888-407-4747 toll-free in the United States and Canada or 1-202-501-4444 from other countries from 8:00 a.m. to 8:00 p.m. Eastern Standard Time, Monday through Friday (except U.S. federal holidays).\nFollow us on Twitter and Facebook.",
      "colorClass": "alert-warning",
      "source": "US State Department",
      "textOverview": "The Department of State warns U.S. citizens of the high risk of traveling to Cameroon, and urges U.S. citizens to avoid all travel to the North and Far North Regions of the country because of the general threat of violent crime, terrorism, and the targeting of westerners for murder and kidnappings, particularly by the extremist terrorist group Boko Haram."
    }
  ]
}